{
    "vaults": [
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Advanced Graphics Summit: 'Marvel's Spider-Man' Remastered: A PC Postmortem",
            "author": "Rebecca Fernandez OShea ",
            "organization": "Nixxes Software",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028914/Advanced-Graphics-Summit-Marvel-s",
            "index": 34,
            "overview": "Marvels Spider-Man was originally developed by Insomniac Games in partnership with Sony Interactive Entertainment and Marvel for PlayStation 4 in 2018, followed by the PlayStation 5 version Marvel's Spider-Man Remastered in 2020. Marvel's Spider-Man Remastered has been lovingly brought to PC by Nixxes Software.nNixxes has extensive experience bringing games to PC, with their back catalogue of critically acclaimed PC ports going back 20 years.nIn this talk, Nixxes will discuss the process and challenges of bringing Marvel's Spider-Man Remastered to PC, covering some hot topics such as Direct3D 12 pipeline state object creation and management, non-unified memory management, ray tracing, debugging device removal crashes and supporting widescreen and resolutions other than the television standard of 16:9.",
            "translated": "Marvels Spider-Man最初是由Insomniac Games开发的，与Sony Interactive Entertainment合作，并于2018年与PlayStation 4的Marvel合作，随后是PlayStation 5版本Marvel的Spider-Man在2020年进行的Remaster。nixxes Software.nnixxes具有丰富的经验，可以将游戏带到PC，他们的后背备受赞誉的PC端口可以追溯到20年。NIN这次演讲将讨论将Marvel的蜘蛛侠重新制作到PC上的过程和挑战，覆盖了一些热门的PC，诸如Direct3D 12管道状态对象创建和管理，非自义内存管理，射线跟踪，调试设备拆卸崩溃以及支持宽屏和分辨率之类的主题，除了16：9的电视标准外。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Advanced Graphics Summit: Open-World Water Rendering and Real-Time Simul...",
            "author": "Zhenyu Mao ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028829/Advanced-Graphics-Summit-Open-World",
            "index": 35,
            "overview": "Water is an essential element in video games, particularly in open-world games. In the past, most solutions relied on pre-generated meshes for rendering and flow maps from offline fluid simulators. In contrast, real-time fluid simulation is rarely used and requires a top-of-the-line GPU to achieve the task.In this session, Zhenyu Mao and Kui Wu from LIGHTSPEED STUDIOS will present Photon Water System, an in-house unified solution for rendering and simulating large water bodies in open-world games. Their solution enables both pre-computing and simultaneous updating of water data (height, velocity, and foams) based on physical equations. This data is converted into an adaptive water mesh on the fly for real-time rendering. Several advanced water rendering techniques, such as CDLOD, are also used for acceleration. An in-depth discussion of the solution's application will be provided.",
            "translated": "水是视频游戏中的重要元素，尤其是在开放世界游戏中。过去，大多数解决方案都依靠预生成的网格来用于离线流体模拟器的渲染和流图。相比之下，实时流体模拟很少使用，需要一流的GPU才能完成任务。在本次会议中，Lightspeed Studios的Zhenyu Mao和Kui Wu将呈现Photon Water System，这是一个内部的统一在开放世界游戏中渲染和模拟大型水体的解决方案。他们的解决方案可以基于物理方程式对水数据（高度，速度和泡沫）的预先计算和同时更新。这些数据被转换为自适应水网，以进行实时渲染。几种先进的水渲染技术，例如CDLOD，也用于加速。将对解决方案的应用程序进行深入讨论。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Advanced Graphics Summit: Realistic Real-Time Sky Dome Rendering in 'Gra...",
            "author": "Kentaro Suzuki ",
            "organization": "Polyphony Digital Inc.",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1029434/Advanced-Graphics-Summit-Realistic-Real",
            "index": 36,
            "overview": "Gran Turismo 7 includes the feature of dynamic time and weather changes to create a more realistic driving experience and the excitement of dramatic racing action. To achieve this, the team at Polyphony Digital implemented a new sky dome rendering system. Sky dome has two main parts: the sky and clouds. The team studied a highly accurate atmospheric model for sky rendering and developed a highly efficient run-time look-up table. Furthermore, they implemented noise-based modeling and lighting with ray marching for cloud rendering. Through this session, attendees will gain insight into a method for rendering the sky dome based on a higher quality atmospheric modelcompared to conventional methods and its use for real-time rendering. In particular, a fundamental technique of atmospheric scattering simulations, the importance of measurement-based atmospheric composition, and accurate Mie scattering will be discussed in detail.",
            "translated": "Gran Turismo 7包括动态时间和天气变化的特征，以创造更现实的驾驶体验和戏剧性赛车动作的兴奋。为了实现这一目标，Polyphony Digital的团队实施了一个新的Sky Dome渲染系统。天穹顶有两个主要部分：天空和云。该团队研究了一个高度准确的大气模型，用于天空渲染，并开发了高效的运行时间查找桌。此外，他们通过Ray Martinging进行云渲染，实施了基于噪声的建模和照明。通过本次会议，与会者将根据与传统方法相比的高质量大气模型及其用于实时渲染的使用，以了解一种渲染天穹顶的方法。特别是，将详细讨论一种大气散射模拟的基本技术，基于测量的大气组成和准确的MIE散射的重要性。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Advanced Graphics Summit: Reinventing the Wheel for Snow Rendering",
            "author": "Paolo Surricchio ",
            "organization": "Santa Monica Studio",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028844/Advanced-Graphics-Summit-Reinventing-the",
            "index": 37,
            "overview": "Peek behind the curtain at the decision-making process that led the rendering team at Santa Monica Studio to rewrite their snow displacement solution. Dive into the technical details of the previous and current solutions, showing and comparing limitations of the previous and new systems, how and why each component is developed, and what problems they solve. See the visual breakdown of how each part contributes to the final image, and how artists interface with the system. Through examples, understand how it's possible to design and implement reusable rendering componentswhile both solving a specific problem and leaving the door open to future changes.",
            "translated": "在决策过程中窥视幕后，导致圣莫尼卡工作室的渲染团队重写了他们的雪排量解决方案。深入了解以前和当前解决方案的技术细节，显示和比较以前和新系统的局限性，如何开发每个组件以及它们解决的问题。请参阅每个部分如何贡献最终图像以及艺术家如何与系统接口的视觉分解。通过示例，了解如何设计和实施可重复使用的渲染组件，同时解决了特定问题，又可以让门开放到未来的变化中。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "How Polygon Labs Is Optimizing Games for an Emerging Blockchain Future",
            "author": "Sameer Chauhan ",
            "organization": "Polygon Labs",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1031958/How-Polygon-Labs-Is-Optimizing",
            "index": 223,
            "overview": "Sponsored Game Developer News Desk interview presented by Polygon Labs",
            "translated": "赞助游戏开发人员新闻台采访由Polygon Labs提出"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "How Unity's Tools Make Life Easier for Game Developers",
            "author": "Kellen Malone ",
            "organization": "Hi-Rez",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1031957/How-Unity-s-Tools-Make",
            "index": 228,
            "overview": "Sponsored Game Developer News Desk interview presented by Unity",
            "translated": "赞助游戏开发人员新闻台采访由Unity提出"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Planning for Change: How Telltale Games Developed Their Modern Writing P...",
            "author": "Zac Litton ",
            "organization": "Telltale Games",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1033601/Planning-for-Change-How-Telltale",
            "index": 343,
            "overview": "Developing a modern and effective narrative pipeline that empowers writers while facilitating iteration and production tracking can be challenging and daunting. Between the wide array of available tools and the ever-present option of custom development, it can feel the pitfalls outnumber the possibilities. But there is another path.nnIn this presentation, Zac Litton (CTO, Telltale Games) will illuminate his approach to narrative tool implementation. Along with Stephen Stanford (Product Manager, Backlight Gem), he will cover how his team integrated Backlight Gem the narrative design system for interactive media creators with Unreal Engine and custom intermediaries to successfully deliver Telltale's current writing and design pipeline. Zac will also explore practical issues in narrative tool development and illustrate how good planning, evaluation, and feature rollout can alleviate these challenges.",
            "translated": "开发一条现代有效的叙事管道，在促进迭代和生产跟踪的同时赋予作家的能力可能具有挑战性和艰巨。在各种各样的可用工具和永远存在的自定义开发方案之间，它可以感觉到陷阱的数量超过了可能性。但是还有另一条路。他将与斯蒂芬·斯坦福（Stephen Stanford）（背光宝石产品经理）一起介绍他的团队如何将背光宝石与互动媒体创建者和虚幻的引擎和自定义中介机构相结合，以成功地交付Telltale的当前写作和设计管道。ZAC还将探索叙事工具开发中的实际问题，并说明良好的计划，评估和功能推广如何减轻这些挑战。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Why a Game of Any Size Can Benefit From Denuvo's Anti-cheat Solutions",
            "author": "Steeve Huin ",
            "organization": "Irdeto",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1031956/Why-a-Game-of-Any",
            "index": 479,
            "overview": "Sponsored Game Developer News Desk interview presented by Irdeto",
            "translated": "赞助游戏开发人员新闻台采访由irdeto提出"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Animation Summit: 'Potionomics' Show and Tell",
            "author": "Anguel Bogoev ",
            "organization": "Voracious Games, LLC",
            "trackname": "Animation Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028946/Animation-Summit-Potionomics-Show-and",
            "index": 51,
            "overview": "In this session, Anguel Bogoev, Animation and Pipeline Overlord at Voracious Games, will share a look into the animation, storytelling, and design considerations of Potionomics. Starting with broader emotional and conceptual targets, they'll present some of the guiding principles, exploring how they're used to build a shared gut feeling on consensus. After, they'll talk about commitment to animation principles, exploring how that affected our production capacity and scale. Then an overview of how they gauged social media reaction to their application of the principles and testing ideas with audiences. They'll close with some examples of the principles created to understand character personality and body language. Relating different features of poses to the emotional qualities that need to be communicated.",
            "translated": "在本次会议上，Anguel Bogoev（Voracious Games）的动画和管道霸主将分享掌potionomics的动画，讲故事和设计考虑。从更广泛的情感和概念目标开始，他们将介绍一些指导原则，探索如何用来建立共同的共识感。之后，他们将谈论对动画原则的承诺，探讨这如何影响我们的生产能力和规模。然后概述他们如何评估社交媒体对他们对原则的应用和观众测试思想的反应。他们将结束一些为了解性格个性和肢体语言而创建的原则的例子。将姿势的不同特征与需要传达的情感品质相关联。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Animation Summit: Motion Matching at EA: Five Years Later",
            "author": "JC Delannoy ",
            "organization": "Electronic Arts",
            "trackname": "Animation Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028821/Animation-Summit-Motion-Matching-at",
            "index": 52,
            "overview": "EA began integrating Motion Matching into its games over five years ago. This talk will discuss how EA's usage of Motion Matching has evolved over this time and where they are at now. The underlying core algorithms for Motion Matching are well known at this point, so instead JC Delannoy, Senior Software Engineer at Electronic Arts, plans to focus on higher-level concepts that have a big impact on animators, technical animators and designers.",
            "translated": "EA在五年前开始将运动匹配整合到游戏中。这次演讲将讨论EA在这段时间以及他们现在的位置中的运动匹配使用情况如何发展。目前，用于运动匹配的核心核心算法是众所周知的，因此，Electronic Arts的高级软件工程师JC Delannoy计划专注于对动画师，技术动画师和设计师产生重大影响的高级概念。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "\"Good Numbers\" in Game Design",
            "author": "Alexander King ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028788/-Good-Numbers-in-Game",
            "index": 2,
            "overview": "Do you ever find yourself designing something for a game and needing to plug in some numbers? If you only need a couple of them, probably anything will do. But it might be that you need a whole set of numbers, possibly even an unending set of them. Where do you start? Which ones should you pick?Designer and spreadsheets aficionado Alexander King shares his solution: Compiling a document of \"Good Numbers\" that are handy to use in a wide range of situations. In this talk, he'll share what properties make numbers \"good\" for use in games, and how to make your own toolkit to use in your own work.",
            "translated": "您是否曾经发现自己为游戏设计东西并需要插入一些数字？如果您只需要几个，那么可能会做任何事情。但这可能是您需要一组数字，甚至可能是无休止的一组。你从哪里开始？您应该选择哪些？设计师和电子表格爱好者亚历山大·金（Alexander King）分享了他的解决方案：编写一份“好数字”的文档，这些文件在各种情况下都很方便。在本演讲中，他将分享哪些属性使数字“好”用于游戏中，以及如何使自己的工具包在自己的工作中使用。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "\"Stuck in a Loop\": Designing the Clones of 'The Last Clockwinder'",
            "author": "John Austin ",
            "organization": "Pontoco",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029318/-Stuck-in-a-Loop",
            "index": 3,
            "overview": "What if automation games played more like performance art than programming? In The Last Clockwinder, you use the time-looping recordings of your own body to create factories and wild Rube Goldberg-esque contraptions.In this talk, project lead John Austin will do a deep dive on the design process of the game: How they approached creating a recording system that always stays in sync, and wrangled the complexity of freeform player cloning in a 3D interactive environment. He will discuss how they re-engineered the classic automation game loop to focus more on \"execution\" rather than \"planning,\" and how to design engineering games that don't end up feeling like work.",
            "translated": "如果自动化游戏比编程更像是性能艺术，该怎么办？在上一个时钟方面，您使用自己的身体的时光唱片来创建工厂和野生Rube Goldberg式的装置。在这次演讲中，项目负责人约翰·奥斯汀（John Austin）将对游戏的设计过程进行深入研究：他们如何：接近创建一个始终保持同步的录制系统，并在3D交互式环境中克隆了自由式播放器的复杂性。他将讨论他们如何重新设计经典的自动化游戏循环，以更多地专注于“执行”而不是“计划”，以及如何设计最终感觉不喜欢工作的工程游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'Farming Simulator' Postmortem",
            "author": "Christian Ammann ",
            "organization": "GIANTS Software",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029064/-Farming-Simulator",
            "index": 6,
            "overview": "Farming Simulator is one of the most-played simulation titles today. In this postmortem, see how the initial idea of two students wanting to develop their own game engine resulted in the creation of an open-world 3D simulation game about the real world of farming and its influencesall the way through the introduction of a career mode in the game.GIANTS Software's Christian Ammann and Stefan Geiger will outline why this was an important step for the time, and they will cover the technological challenges of cross-platform and multiplayer development, and explain why they believe user-generated content is an important factor in the game's success.",
            "translated": "耕种模拟器是当今最受欢迎的模拟游戏之一。在这次验尸中，请参阅两个想要开发自己的游戏引擎的最初想法如何导致创建一个关于农业现实世界及其影响力的开放世界3D模拟游戏，这是通过在职业模式中引入职业模式的方式Game.giants软件的Christian Ammann和Stefan Geiger将概述为什么这是当时的重要一步，他们将涵盖跨平台和多人游戏开发的技术挑战，并解释为什么他们认为他们认为用户生成的内容是重要因素在游戏的成功中。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'The Looker': The Art of Parody Against the Menace of Goofiness",
            "author": "Bradley Lovell ",
            "organization": "Subcreation Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029354/-The-Looker-The-Art",
            "index": 12,
            "overview": "Why would anyone care about the parody of a game that came out seven years prior? As it turns out, there are some solid reasons why.In this talk, Bradley Lovell, developer of 2022's The Looker, a parody of the 2015 open-world puzzle game The Witness, discusses what it takes to make a high-bandwidth parody that goes beyond obvious audio-visual gags to tell jokes through gameplay, as well as engage deeply with the source material. This discussion touches on the core appeals of parody games, as well as the unique opportunities for humor that games afford. Bradley also discusses the importance of maintaining internal consistency so a game's humor and subversion of expectations do not cause unintentional damage to its core design.",
            "translated": "为什么有人会关心七年前出现的游戏的模仿？事实证明，有一些可靠的原因。超越了明显的视听性插科打or，可以通过游戏玩法来笑话，并深入互动。这项讨论涉及模仿游戏的核心吸引力，以及游戏提供的幽默机会。布拉德利还讨论了保持内部一致性的重要性，因此游戏的幽默和颠覆期望不会对其核心设计造成无意的损害。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'The Looker': The Art of Parody Against the Menace of Goofiness",
            "author": "Bradley Lovell ",
            "organization": "Subcreation Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028867/-The-Looker-The-Art",
            "index": 13,
            "overview": "Why would anyone care about the parody of a game that came out seven years prior? As it turns out, there are some solid reasons why.In this talk, Bradley Lovell, developer of 2022's The Looker, a parody of the 2015 open-world puzzle game The Witness, discusses what it takes to make a high-bandwidth parody that goes beyond obvious audio-visual gags to tell jokes through gameplay, as well as engage deeply with the source material. This discussion touches on the core appeals of parody games, as well as the unique opportunities for humor that games afford. Bradley also discusses the importance of maintaining internal consistency so a game's humor and subversion of expectations do not cause unintentional damage to its core design.",
            "translated": "为什么有人会关心七年前出现的游戏的模仿？事实证明，有一些可靠的原因。超越了明显的视听性插科打or，可以通过游戏玩法来笑话，并深入互动。这项讨论涉及模仿游戏的核心吸引力，以及游戏提供的幽默机会。布拉德利还讨论了保持内部一致性的重要性，因此游戏的幽默和颠覆期望不会对其核心设计造成无意的损害。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'The Sims': Process and Learnings for Developing DEI Content",
            "author": "Phillip Ring ",
            "organization": "Electronic Arts",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029364/-The-Sims-Process-and",
            "index": 14,
            "overview": "Phillip Ring, Executive Producer on The Sims 4 at Maxis, Electronic Arts, shares insights and lessons from working on The Sims team and how they have been engaging with Diversity, Equity & Inclusivity (DEI) in their games. This talk looks at the changing expectations of players and will include insights and best practices for connecting with your game communities, underrepresented communities, and resource groups to help deliver on these expectations. Phillip will share examples from The Sims 4including the addition of a recent feature enabling pronouns for Simsand why it is important to uphold the values of your studio, team, and community.",
            "translated": "Electronic Arts的《模拟人生4》的执行制片人Phillip Ring分享了Sims团队工作的洞察力和课程，以及他们如何参与多样性，公平与包容性（DEI）。这次演讲着眼于玩家的期望不断变化，并将包括与您的游戏社区，代表性不足的社区和资源组联系的见解和最佳实践，以帮助实现这些期望。菲利普（Phillip）将分享《模拟人生》中的示例4，包括添加最近的功能，为模拟人生提供代词，为什么要维护您的工作室，团队和社区的价值很重要。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'TUNIC': This Was Here the Whole Time",
            "author": "Andrew Shouldice ",
            "organization": "ISOMETRICORP Games Ltd.",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029384/-TUNIC-This-Was-Here",
            "index": 15,
            "overview": "TUNIC is an action-adventure game with a focus on secrets and exploration. In this session, Andrew Shouldice talks about the techniques used during TUNIC's development for thinking about secrets: What makes a good secret? How to make sure secrets beget further secrets? What's the value of hiding things just barely beneath the surface? Importantly: How do you make your finite game feel like it's got a bottomless supply of mysteries? With examples from TUNIC's development (and probably spoilers), Andrew offers a model for representing secrets as loose ends, and why the joy of resolving them is not always better than the joy of having lots of tantalizing mysteries.",
            "translated": "Tunic是一款动作冒险游戏，专注于秘密和探索。在本次会议上，安德鲁·努斯（Andrew Neegrice）谈论了上衣开发过程中用于思考秘密的技术：什么是一个好秘密？如何确保秘密得到进一步的秘密？隐藏事物的价值几乎只是在表面之下？重要的是：您如何使您的有限游戏感觉到它没有底部的奥秘供应？安德鲁（Andrew）以束缚的发展（可能是破坏者）的形式提供了一个模型，以将秘密表示为松散的目的，以及为什么解决它们的喜悦并不总是比拥有许多诱人的奥秘的乐趣更好。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'Unpacking' Zen: Designing a Game Without Fail States or Scores",
            "author": "Wren Brier ",
            "organization": "Witch Beam",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029400/-Unpacking-Zen-Designing-a",
            "index": 16,
            "overview": "A zen game about taking items out of boxes after a move might sound extremely niche, but Unpacking by Witch Beam Games has gone on to achieve critical and commercial success, selling over a million copies and winning over 20 awards around the worldincluding a BAFTA for its narrative and a GDCA for innovation. The game lacks many conventional game design components: There are no scores, no time limits, no fail states, no consequences to choices, and no dialogue. Not only did Unpacking not need these elements, it is a better game for omitting them. What's left when all of these things are taken away? And why design a game like this? This talk will explore the rationale for Unpacking's design and the way it was implemented in practice.",
            "translated": "一款关于在搬迁后从箱子里取出物品的禅宗游戏听起来可能非常利基，但是《巫婆束》游戏的拆开已经继续取得了关键和商业上的成功，卖出了超过一百万份，并在世界范围内获得了20多个奖项，包括世界范围内的奖项。叙事和创新的GDCA。该游戏缺乏许多传统的游戏设计组件：没有分数，没有时间限制，没有失败状态，对选择的后果也没有对话。不仅解开包装不需要这些元素，而且是省略它们的更好游戏。当所有这些东西被带走时剩下什么？为什么要设计这样的游戏？这次演讲将探讨解开设计设计的基本原理以及实践中实施的方式。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Breaking Barriers: Combat Accessibility in 'God of War Ragnarok'",
            "author": "Adam Oliver ",
            "organization": "Santa Monica Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028971/Breaking-Barriers-Combat-Accessibility-in",
            "index": 74,
            "overview": "The God of War franchise has its roots in delivering approachable, expressive combat for players of widely varying abilities. However, its complexity also provides unique opportunities for unintended barriers for players with disabilities, conflicting with those very roots. In crafting the latest entry, God of War: Ragnark, Santa Monica Studio pushed many aspects of its combat further than ever beforeand accessibility was no exception. Join Adam Oliver as he covers the journey the team went on as they expanded the accessibility of God of War combat. Combat design, specific examples of resolving unintentional barriers, methods of challenging design instincts to achieve accessibility wins, and navigating conflicts with intended design will be explored in this presentation.",
            "translated": "战神特许经营权的源自其为具有不同能力的球员提供平易近人，表现力的战斗。但是，它的复杂性还为残疾人的意外障碍提供了独特的机会，与这些根源冲突。在制作最新的作品《战神：拉格纳克》时，圣莫尼卡工作室比以往任何时候都更进一步地推动了战斗的许多方面，这也不例外。加入亚当·奥利弗（Adam Oliver），涵盖团队扩大战神战斗的可及性时继续前进的旅程。战斗设计，解决无意障碍的具体示例，挑战设计本能以获得可及性获胜的方法以及通过预期设计的冲突。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Breaking Barriers: Combat Accessibility in 'God of War Ragnarok'",
            "author": "Adam Oliver ",
            "organization": "Santa Monica Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028726/Breaking-Barriers-Combat-Accessibility-in",
            "index": 75,
            "overview": "The God of War franchise has its roots in delivering approachable, expressive combat for players of widely varying abilities. However, its complexity also provides unique opportunities for unintended barriers for players with disabilities, conflicting with those very roots. In crafting the latest entry, God of War: Ragnark, Santa Monica Studio pushed many aspects of its combat further than ever beforeand accessibility was no exception. Join Adam Oliver as he covers the journey the team went on as they expanded the accessibility of God of War combat. Combat design, specific examples of resolving unintentional barriers, methods of challenging design instincts to achieve accessibility wins, and navigating conflicts with intended design will be explored in this presentation.",
            "translated": "战神特许经营权的源自其为具有不同能力的球员提供平易近人，表现力的战斗。但是，它的复杂性还为残疾人的意外障碍提供了独特的机会，与这些根源冲突。在制作最新的作品《战神：拉格纳克》时，圣莫尼卡工作室比以往任何时候都更进一步地推动了战斗的许多方面，这也不例外。加入亚当·奥利弗（Adam Oliver），涵盖团队扩大战神战斗的可及性时继续前进的旅程。战斗设计，解决无意障碍的具体示例，挑战设计本能以获得可及性获胜的方法以及通过预期设计的冲突。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Build the Next Generation of VR and MR Experiences with Meta Presence Pl...",
            "author": "Aashay Desai ",
            "organization": "Meta",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028975/Build-the-Next-Generation-of",
            "index": 80,
            "overview": "Learn how Presence Platform's state-of-the-art AI, machine perception, graphics, and audio technologies are helping developers build experiences that blend the physical and virtual worlds.",
            "translated": "了解存在平台的最新AI，机器感知，图形和音频技术如何帮助开发人员建立融合物理和虚拟世界的体验。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Building Sustainable Game Economies: The Three Design Pillars (Presented...",
            "author": "Edward Castronova ",
            "organization": "Indiana University",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028982/Building-Sustainable-Game-Economies-The",
            "index": 83,
            "overview": "Join us for an in-depth look at the challenges of designing sustainable game economies. Whether you're a game developer, designer, or producer, this talk will provide valuable insights and core concepts to help you build prosperous game economies and optimize your live ops.nnKnown for his work on virtual worlds, Pr. Edward Castronova will cover the fundamentals for designing healthy, long-lasting game economies that resonate with players. Through three design pillars, Castranova demystifies economic concepts such as inflation and reviews the suitable approaches to creating in-game currencies, resource allocation, trading, and pricing systems. You will also learn how to leverage data and analytics to make informed decisions and how continuous testing and iterating can help optimize your game economy's performance while keeping players invested through live ops.",
            "translated": "加入我们，深入了解设计可持续游戏经济体的挑战。无论您是游戏开发人员，设计师还是制作人，这次演讲都将提供宝贵的见解和核心概念，以帮助您建立繁荣的游戏经济体并优化您的实时OPS.nnnon，他在虚拟世界上的工作，PR。爱德华·卡斯特罗诺娃（Edward Castronova）将涵盖设计健康，持久的游戏经济体，这些游戏经济体引起玩家的共鸣。通过三个设计支柱，卡斯特拉诺娃（Castranova）揭开了通货膨胀等经济概念的神秘信息，并回顾了创建游戏内货币，资源分配，交易和定价系统的合适方法。您还将学习如何利用数据和分析来做出明智的决策，以及持续测试和迭代如何有助于优化游戏经济的性能，同时通过实时操作使玩家投资。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Cards, Dice, and RNGs: Using Randomness Intentionally",
            "author": "Randy Smith ",
            "organization": "Waves All Day",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028736/Cards-Dice-and-RNGs-Using",
            "index": 84,
            "overview": "Randomness is a ubiquitous design tool, and one that can make and break gameplay in confounding ways. But even among the best designers, there is a tendency to apply it without proper care or to run up against the limits of a hazy memory of probability math. This presentation provides a formal toolkit and a practical framework for making day-to-day design decisions about how, when, and why to use which randomization mechanics, gleaned from the best and worst examples from digital and tabletop gaming. Designers are empowered to keep their designs on track, apply randomness with intention towards specific goals, empower their players to manage randomness, and notice, diagnose and fix problems when they arise.",
            "translated": "随机性是一种无处不在的设计工具，它可以以混乱的方式制作和打破游戏玩法。但是，即使在最好的设计师中，也有在不适当护理的情况下应用它的趋势，或者在概率数学的朦胧记忆范围内奔跑。本演示文稿提供了一个正式的工具包和实用框架，用于制定有关如何，何时以及为什么使用哪种随机机制，从数字和桌面游戏中最好和最差的示例中收集的那种随机机制。设计师有权保持其设计步入正轨，将随机性应用于特定目标，使玩家能够管理随机性，并在出现时注意，诊断和解决问题。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Climate Games: The Developer's Field Guide",
            "author": "Arnaud Fayolle ",
            "organization": "Ubisoft, Positive Play",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028989/Climate-Games-The-Developer-s",
            "index": 91,
            "overview": "Video games contribute to climate change, but could they also be part of the solution?To be relevant in a warming world, more developers aspire to use their games to raise awareness and activate players toward pro-environmental goals. But addressing a topic as complex as the climate crisis is incredibly hard, and developers with the best intentions often struggle to figure out the right approach for their game to foster meaningful action that can be embraced by their audience.The Developer's Field Guide for Climate Games aims to solve this by providing a proven step-by-step method to structure the developers' creative journey and make sure they maximize the impact potential of their game. It is based on the extensive experience that the team Ubisoft Positive Play has built over the last two years, by accompanying and supporting over 20 dev teams on the green activations on 15 different brands.",
            "translated": "视频游戏有助于气候变化，但它们也可以成为解决方案的一部分吗？在变暖世界中相关，越来越多的开发人员渴望使用游戏来提高认识并激活玩家实现亲环境目标。但是，解决一个像气候危机一样复杂的话题非常困难，最佳意图的开发人员通常很难找到适合其游戏的方法来促进受众的有意义的行动。旨在通过提供逐步构建开发人员的创意旅程的逐步逐步的方法来解决这一问题，并确保它们最大程度地发挥了游戏的影响。这是基于乌比苏夫特（Ubisoft）积极的广泛经验，过去两年来，育种队在15个不同品牌上伴随并支持20多个开发团队的绿色激活。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Climate Games: The Developer's Field Guide",
            "author": "Arnaud Fayolle ",
            "organization": "Ubisoft, Positive Play",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028740/Climate-Games-The-Developer-s",
            "index": 92,
            "overview": "Video games contribute to climate change, but could they also be part of the solution?To be relevant in a warming world, more developers aspire to use their games to raise awareness and activate players toward pro-environmental goals. But addressing a topic as complex as the climate crisis is incredibly hard, and developers with the best intentions often struggle to figure out the right approach for their game to foster meaningful action that can be embraced by their audience.The Developer's Field Guide for Climate Games aims to solve this by providing a proven step-by-step method to structure the developers' creative journey and make sure they maximize the impact potential of their game. It is based on the extensive experience that the team Ubisoft Positive Play has built over the last two years, by accompanying and supporting over 20 dev teams on the green activations on 15 different brands.",
            "translated": "视频游戏有助于气候变化，但它们也可以成为解决方案的一部分吗？在变暖世界中相关，越来越多的开发人员渴望使用游戏来提高认识并激活玩家实现亲环境目标。但是，解决一个像气候危机一样复杂的话题非常困难，最佳意图的开发人员通常很难找到适合其游戏的方法来促进受众的有意义的行动。旨在通过提供逐步构建开发人员的创意旅程的逐步逐步的方法来解决这一问题，并确保它们最大程度地发挥了游戏的影响。这是基于乌比苏夫特（Ubisoft）积极的广泛经验，过去两年来，育种队在15个不同品牌上伴随并支持20多个开发团队的绿色激活。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Designing 'MARVEL SNAP'",
            "author": "Ben Brode ",
            "organization": "Second Dinner",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029024/Designing-MARVEL-SNAP",
            "index": 116,
            "overview": "Come absorb 15 years of collectible card game design experience as Ben Brode (Hearthstone, MARVEL SNAP) blasts card game knowledge direct from his brain into your ears and eyes. Hearthstone created the digital card game genre, and MARVEL SNAP took it in a whole new direction with three-minute battles, locations, and by straight jacking the doubling cube from Backgammon. Ben Brode learned a ton from his decade working on Hearthstone, and even more from the five years he's been working on SNAP. He's going to try and get as much of that into 60 minutes as is physically possible. ALSO! There will be tales of glory and stories of woe as he dissects the good, bad, and ugly of designing the card game everyone's talking about. Will this talk be delivered entirely via freestyle rap? No, but wow wouldn't that be rad.",
            "translated": "当Ben Brode（Marvel，Marvel Snap）将纸牌游戏知识直接从他的大脑和眼睛爆炸，吸收了15年的收藏纸牌游戏设计经验。Hearthstone创建了数字纸牌游戏类型，Marvel Snap以三分钟的战斗，位置和直接从Backgammon的双倍加倍的位置朝着全新的方向带来了全新的方向。本·布罗德（Ben Brode）从他从事炉石传说的十年中学到了很多东西，甚至从他从事Snap工作的五年来得知。他将尽可能地将其达到60分钟的可能性。还！当他剖析每个人在谈论的纸牌游戏时，将会有荣耀的故事和祸患的故事。这次演讲将完全通过自由式说唱进行吗？不，但是哇，那不是Rad。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Developing 'Terra Nil': A Strategy Game About Nature, Not Expansion",
            "author": "Sam Alfred ",
            "organization": "Free Lives",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029027/Developing-Terra-Nil-A-Strategy",
            "index": 117,
            "overview": "Terra Nil is a strategy game that eschews many of the mainstays of its genre. Lead designer Sam Alfred offers a look at how the team drew inspiration from the natural world to make a strategy game that's not about the exploitation of natural resources, but about balance. This talk on the design of Terra Nil illustrates how, by looking outside established boundaries, old genres can be reinvigorated.",
            "translated": "Terra NIL是一款策略游戏，避免了其类型的许多主要支柱。首席设计师萨姆·阿尔弗雷德（Sam Alfred）介绍了团队如何从自然世界中汲取灵感来制作一款策略游戏，而不是剥削自然资源，而是关于平衡。关于Terra nil设计的这一演讲说明了如何通过在既定的界限外观，可以重新启动旧类型。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Developing Marvel's 'Iron Man VR' for Meta Quest (Presented by Meta)",
            "author": "Matt Walker ",
            "organization": "Meta (Camouflaj)",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029026/Developing-Marvel-s-Iron-Man",
            "index": 118,
            "overview": "\"Marvels Iron Man VR is a made-for-VR-story story that originally launched on PSVR in July of 2020, and debuted on the Meta Quest 2 and Pro last December. Iron Man is one of the most iconic Super Heroes and the game allows users to suit up in Tony's armor to take to the skies, having complete control of his suit, gear, gadget, and weapons.nnIn this talk, Camouflaj developers will discuss adapting the title for the completely wireless Quest 2 headset and share insights on the unique challenges and opportunities they faced.\"",
            "translated": "“ Marvels Irran Man VR是一个为VR故事制作的故事，最初是在2020年7月在PSVR上推出的，并于去年12月在Meta Quest 2和Pro上首次亮相。《钢铁侠》是最具标志性的超级英雄之一和游戏之一。允许用户完全控制他的西装，装备，小工具和武器。他们面临的独特挑战和机遇。”"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Experimental Game Workshop",
            "author": "Jack Hart ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029048/Experimental-Game",
            "index": 134,
            "overview": "The Experimental Game Workshop Showcase, which has featured games like Baba Is You, Braid, Untitled Goose Game, and Card Shark is back for its 21st year at GDC.In this fast-paced, game-packed session, panelists will showcase a selection of surprising and intriguing prototypes made by innovation-minded game developers from all over the world. By demonstrating games that defy conventions and traditions in search of new genres and ideas, this session aims to ignite the imagination of all game makers. Come see what's happening in the world of Experimental Games, and be inspired!",
            "translated": "实验游戏研讨会展示柜，其中包括Baba是您，编织，无标题的鹅游戏和Card Shark等游戏，并在GDC中回来了21年。来自世界各地的创新游戏开发人员制作的令人惊讶和有趣的原型。通过展示违背惯例和传统来寻找新类型和想法的游戏，本届会议旨在激发所有游戏制造商的想象力。快来看看实验游戏世界中正在发生的事情，并受到启发！"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Game Design for Inclusion Beyond Representation",
            "author": "Tanya X. Short ",
            "organization": "Kitfox Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028802/Game-Design-for-Inclusion-Beyond",
            "index": 188,
            "overview": "A Colgate toothbrush's handle is designed to have affordances for its purpose: The handle feels natural to hold in a way that presents its bristles comfortably to brush your teeth. Similarly, game designers seeking to create inclusive games must follow a process and practice that lends itself to inclusivity. They must develop tools to detect alienation, game loops to support growth, and progression gates to recognize different needs of accessibility. In this session, four designers (Tanya X. Short, Rjon Taylor-Foster, Emily Short, and more!) will share their personal lessons learned and paths forward for developing their inclusive games, including Boyfriend Dungeon, Mask of the Rose, and Spirit Swap.",
            "translated": "高露洁牙刷的手柄旨在为其目的提供负担：手柄以一种自然的方式握住，以舒适的刷牙刷牙以刷牙。同样，寻求创建包容性游戏的游戏设计师必须遵循一个过程和练习，以使其具有包容性。他们必须开发工具来检测疏远，游戏循环以支持增长以及进步大门，以识别可访问性的不同需求。在本届会议上，四位设计师（Tanya X. Short，Rjon Taylor-Foster，Emily Short等！）将分享他们的个人课程，并向开发包容性游戏的前进，包括男友Dungeon，玫瑰的面具和精神，交换。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Games and Meaning, or You Have No Idea How Hard It Is To Run a Sweatshop",
            "author": "Soren Johnson ",
            "organization": "Mohawk Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029133/Games-and-Meaning-or-You",
            "index": 196,
            "overview": "Can games teach us about our ourselves? Can a game be a statement about the world? Do we design games intentionally or accidentally? This talk addresses these questions and much moreincluding Voros McCracken, Ottoman fratricide, fancy hats, Le Corbusier, nuclear holocaust, Mt. Rushmore, and the 1994 Caribbean Cup. Come find out how hard it is to run a sweatstop. Stay for a hopeful and skeptical look at how to make games that say what we want them to say.",
            "translated": "游戏可以教会我们自己的自己吗？游戏可以成为关于世界的陈述吗？我们是故意还是偶然地设计游戏？本演讲解决了这些问题，包括Voros McCracken，Othman Fratricide，Fancy Hats，Le Corbusier，核大屠杀，Rushmore山和1994年的加勒比海杯。快来找出运行汗水有多困难。保持充满希望和持怀疑态度的观看如何制作我们想说他们说些什么的游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Games of Tomorrow - How VR developers are Mixing their Reality. (Present...",
            "author": "Kimberly Unger ",
            "organization": "Meta",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029134/Games-of-Tomorrow-How-VR",
            "index": 197,
            "overview": "Hear from developers building with the latest mixed reality technologies from Meta to create the next generation of VR/MR experiences. Come check out the mixed reality games that our developers are building against a future where 6dof is as much about the real world as it is about the virtual.",
            "translated": "通过META的最新混合现实技术来聆听开发人员的来信，以创建下一代VR/MR体验。快来看看我们开发人员正在与6DOF与现实世界一样多的未来和虚拟的混合现实游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Houston, We Have a Planet: The Spherical Terrain of 'Kerbal Space Progra...",
            "author": "Sung Campbell ",
            "organization": "Intercept Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029155/Houston-We-Have-a-Planet",
            "index": 221,
            "overview": "Join us for a guided panel discussion with developers from Intercept Games, who will talk through the process and challenges of creating fully spherical planets in Kerbal Space Program 2. Artists and engineers will describe the steps that went into recreating a fan-favorite celestial body from the mesh up using the Unity game engine with new tools, new pipelines, and new team members.",
            "translated": "加入我们与Intercept Games的开发人员进行指导小组讨论，他们将在Kerbal Space计划中谈论过程和创建完全球形行星的挑战2。艺术家和工程师将描述从重新创建粉丝最喜欢的天体的步骤使用新工具，新管道和新团队成员使用Unity Game Engine网站网格。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Layered Battles: Generating Multiple Qualitative Tactical Battles for 'M...",
            "author": "Frdric Giraud ",
            "organization": "Ubisoft Paris",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029206/Layered-Battles-Generating-Multiple-Qualitative",
            "index": 279,
            "overview": "Layered Battles is a system created by Ubisoft to procedurally generate a variety of tactical battles through Mario + Rabbids: Sparks of Hope, with specific battles intentions in mind. It allowed the team to win production time over battle creation, to focus on the tactical aspect, while maintaining a high-quality level. To achieve that, the team had to question what the opportunities and needs were for this new game compared to Kingdom Battle. The production went through multiple prototypes, ending with the current system.Every battle is decomposed in 4 layers: Arena chunks, Covers, Navigation, and Enemies and Spawns.Each layer is composed of multiples assets tagged with keywords, which are stored in a library. Multiples tags from different layers can be taken from the library to be used in the configuration files to guide the generation system towards a specific result.",
            "translated": "分层战是Ubisoft创建的一个系统，可以通过Mario + Rabbids进行程序进行各种战术战斗：希望的火花，并牢记特定的战斗意图。它使团队能够在战斗创作上赢得生产时间，专注于战术方面，同时保持高质量的水平。为了实现这一目标，与王国战斗相比，该团队必须质疑这款新游戏的机会和需求。生产经过多个原型，以当前系统结尾。每一个战斗都分解为4层：竞技场的块，封面，导航和敌人和敌人和产卵。每个层由带有关键字标记的倍数资产组成，这些资产存储在库中。可以从库中获取来自不同图层的倍数标签，以在配置文件中使用，以指导生成系统达到特定结果。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Layered Battles: Generating Multiple Qualitative Tactical Battles for 'M...",
            "author": "Frdric Giraud ",
            "organization": "Ubisoft Paris",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028810/Layered-Battles-Generating-Multiple-Qualitative",
            "index": 280,
            "overview": "Layered Battles is a system created by Ubisoft to procedurally generate a variety of tactical battles through Mario + Rabbids: Sparks of Hope, with specific battles intentions in mind. It allowed the team to win production time over battle creation, to focus on the tactical aspect, while maintaining a high-quality level. To achieve that, the team had to question what the opportunities and needs were for this new game compared to Kingdom Battle. The production went through multiple prototypes, ending with the current system.Every battle is decomposed in 4 layers: Arena chunks, Covers, Navigation, and Enemies and Spawns.Each layer is composed of multiples assets tagged with keywords, which are stored in a library. Multiples tags from different layers can be taken from the library to be used in the configuration files to guide the generation system towards a specific result.",
            "translated": "分层战是Ubisoft创建的一个系统，可以通过Mario + Rabbids进行程序进行各种战术战斗：希望的火花，并牢记特定的战斗意图。它使团队能够在战斗创作上赢得生产时间，专注于战术方面，同时保持高质量的水平。为了实现这一目标，与王国战斗相比，该团队必须质疑这款新游戏的机会和需求。生产经过多个原型，以当前系统结尾。每一个战斗都分解为4层：竞技场的块，封面，导航和敌人和敌人和产卵。每个层由带有关键字标记的倍数资产组成，这些资产存储在库中。可以从库中获取来自不同图层的倍数标签，以在配置文件中使用，以指导生成系统达到特定结果。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Meta's Oculus Studios: Building Next-Gen Multiplayer Games with Amazon G...",
            "author": "Santhan Pamulapati ",
            "organization": "Amazon Web Services",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029449/Meta-s-Oculus-Studios-Building",
            "index": 319,
            "overview": "Managing a reliable, resilient, and scalable game backend can be a challenge for any game studio. The challenge increases significantly when you bring together multiple game studios that all come with varying game engines, backend tools, and development experiences. In this session, Meta walks through the history of Oculus Studios and their journey to integrate with common Meta-supported solutions. Learn how they are using Amazon GameLift to standardize their game hosting and matchmaking services to allow their studios to speed up development, reduce costs, and concentrate on making the next great multiplayer game.",
            "translated": "管理可靠，弹性和可扩展的游戏后端对于任何游戏工作室来说都是一个挑战。当您将各种游戏引擎，后端工具和开发体验汇集的多个游戏工作室汇集在一起​​时，挑战就会大大增加。在本次会议上，Meta浏览了Oculus Studios的历史及其与普通的元支持解决方案融为一体的旅程。了解他们如何使用Amazon Gamelift标准化其游戏托管和对接服务服务，以使他们的工作室能够加快开发，降低成本并专注于制作下一款出色的多人游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Plays Like You Remember: Adapting Classics for 'Teenage Mutant Ninja Shr...",
            "author": "Frederic Gemus ",
            "organization": "Tribute Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029280/Plays-Like-You-Remember-Adapting",
            "index": 346,
            "overview": "Playing with nostalgia is always a risky bet, but the team at Tribute Games won big when making Teenage Mutant Ninja Turtles: Shredder's Revenge. In this design talk, game designer Frederic Gemus will share Tribute Games' design philosophies and how they were successfully applied to the game. With the help of concrete examples from the production of the game, attendees will learn how to properly adapt older licenses by finding their key aspects, the difference between remaking versus redoing features, and, finally, how to inject new ideas into the mix.",
            "translated": "与怀旧玩耍总是一个冒险的赌注，但是在制作青少年忍者乌龟时，Tribute Games的球队赢得了巨大的赌注：Shredder的报仇。在这次设计演讲中，游戏设计师弗雷德里克·普莱克斯（Frederic Gemus）将分享“致敬”游戏的设计理念，以及如何成功地应用它们。在游戏生产中的具体示例的帮助下，与会者将学习如何通过找到其关键方面，重建功能与重做功能之间的差异以及如何将新想法注入组合中的差异。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Recorded: AI Enhanced Procedural City Generation (Presented by Tencent A...",
            "author": "Hong Shang ",
            "organization": "Tencent AI Lab",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028921/Recorded-AI-Enhanced-Procedural-City",
            "index": 359,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Rules of the Game 2023: Deep Techniques from Distinctive Designers",
            "author": "Richard Rouse III ",
            "organization": "FarBridge",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028847/Rules-of-the-Game-2023",
            "index": 367,
            "overview": "There are the rules that make the game, and then there are the rules that make the game designer. In the popular \"Rules of the Game\" session, we assemble a group of established and respected game designers with great games under their belt. Each designer then goes in deep on one of the rules they use on their projects, sharing specific techniques that you can use on your own games. This fast-paced and energizing session gives you plenty of \"rules\" to learn from, each presented in a tight 10-minute talk. These techniques will challenge your way of thinking, expand your toolbox, and in some cases you may even not agree with them. But it's all part of the process of thinking about the process of game design. Coming out of this session, you can go make your own games with the rules you think are most important to who you are as a game designer.",
            "translated": "有一些规则使游戏制定，然后有使游戏设计师的规则。在流行的“游戏规则”会议中，我们组装了一群成熟且受人尊敬的游戏设计师，他们拥有出色的游戏。然后，每个设计师都深入了解他们在项目上使用的规则之一，共享可以在自己的游戏中使用的特定技术。这次快节奏且充满活力的会议为您提供了许多“规则”，可以学习，每个规则都在一个紧密的10分钟演讲中呈现。这些技术将挑战您的思维方式，扩展工具箱，在某些情况下，您甚至可能不同意它们。但这是思考游戏设计过程的过程的一部分。在本届会议之外，您可以使用自己认为对游戏设计师的身份最重要的规则来制作自己的游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tencent Games Developer Summit: Arena Breakout: Creating a Next-gen FPS ...",
            "author": "Yiming SUN ",
            "organization": "Tencent Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028950/Tencent-Games-Developer-Summit-Arena",
            "index": 388,
            "overview": "Is creating a next-generation quality, gritty, hardcore, first-person shooter for mobile feasible? Can we enjoy the PvP shooting experience on mobile devices when compared to PC or console? The next-generation mobile FPS game Arena Breakout, developed by MoreFun Studios, a subsidiary of Tencent Games, achieved remarkable success in 2022. In this panel, Yiming Sun, the lead producer of Arena Breakout, will share his development experience on this challenging project. With the advancement of mobile hardware and network technology, many game experiences that were once exclusive to PC and consoles have been brought to mobile platforms, injecting new vitality and business potential into the space. Learn more about how Yiming and his team tackled some of these unique research and development challenges while making Arena Breakout.",
            "translated": "是否创建下一代质量，坚韧，铁杆，第一人称射击游戏，以使手机可行？与PC或控制台相比，我们可以在移动设备上享受PVP拍摄体验吗？由Tencent Games的子公司Morefun Studios开发的下一代移动FPS游戏竞技场突破性突破性在2022年取得了巨大的成功。。随着移动硬件和网络技术的发展，许多曾经是PC和游戏机独有的游戏体验已被带到移动平台上，并将新的活力和业务潜力注入了该领域。进一步了解Yiming和他的团队在制作竞技场突破时如何应对其中一些独特的研发挑战。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tencent Games Developer Summit: Arena Breakout: Creating a Next-gen FPS ...",
            "author": "Yiming SUN ",
            "organization": "Tencent Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028719/Tencent-Games-Developer-Summit-Arena",
            "index": 389,
            "overview": "Is creating a next-generation quality, gritty, hardcore, first-person shooter for mobile feasible? Can we enjoy the PvP shooting experience on mobile devices when compared to PC or console? The next-generation mobile FPS game Arena Breakout, developed by MoreFun Studios, a subsidiary of Tencent Games, achieved remarkable success in 2022. In this panel, Yiming Sun, the lead producer of Arena Breakout, will share his development experience on this challenging project. With the advancement of mobile hardware and network technology, many game experiences that were once exclusive to PC and consoles have been brought to mobile platforms, injecting new vitality and business potential into the space. Learn more about how Yiming and his team tackled some of these unique research and development challenges while making Arena Breakout.",
            "translated": "是否创建下一代质量，坚韧，铁杆，第一人称射击游戏，以使手机可行？与PC或控制台相比，我们可以在移动设备上享受PVP拍摄体验吗？由Tencent Games的子公司Morefun Studios开发的下一代移动FPS游戏竞技场突破性突破性在2022年取得了巨大的成功。。随着移动硬件和网络技术的发展，许多曾经是PC和游戏机独有的游戏体验已被带到移动平台上，并将新的活力和业务潜力注入了该领域。进一步了解Yiming和他的团队在制作竞技场突破时如何应对其中一些独特的研发挑战。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Language of Gameplay and How to Speak It",
            "author": "Jakub Stokalski ",
            "organization": "11 Bit Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029351/The-Language-of-Gameplay-and",
            "index": 410,
            "overview": "Stories in games are often delivered alongside gameplay, not through ityet in the player's mind, there is only one \"story\": the experience of playing the game as a whole. To make our games say things we want, we often lean on linear media storytelling toolbox, and it works. But all games (intently or not) also speak through player actions and the content they operate on, framed by the designers' intent. It's only fitting we develop our design toolset to power this language. This talk aims to explore conceptual foundations for thinking consciously about designing meaningful experiences in games, spoken through gameplay and systems, not only words and pictures.",
            "translated": "游戏中的故事通常与游戏玩法并不是在玩家心中的Ityet并肩作用，只有一个“故事”：整个游戏的经历。为了让我们的游戏说我们想要的话，我们经常倾向于线性媒体讲故事的工具箱，并且它起作用。但是，所有游戏（无意识与否）也通过玩家的动作及其操作的内容来讲话，并由设计师的意图构成。我们将设计工具集开发为为该语言提供动力是合适的。本演讲旨在探索概念基础，以自觉地思考有关通过游戏玩法和系统说出的有意义的体验，而不仅仅是单词和图片。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Level Design Evolution of 'A Plague Tale'",
            "author": "Laura Mas Maury ",
            "organization": "Asobo Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029353/The-Level-Design-Evolution-of",
            "index": 412,
            "overview": "Laura Mas Maury, Level Designer at Asobo Studio, talks through the evolution of A Plague Tale's Level Design. She shares some practical advice about breaking linearity or creating opportunities for the player in a narrative driven game. She bases her analysis on case studies from different levels: from action sequences to narrative driven areas. The talk shares some practical advice the Level Design Team has learned along the way. It also gives insights on the challenges of designing a \" Plague 2.0 \" and what the 70 people team faced creating an adventure game, as well as their main takeaways.",
            "translated": "Asobo Studio的Level Designer Laura Mas Maury通过瘟疫故事的水平设计的演变进行了交谈。她分享了一些关于打破线性或在叙事驱动的游戏中为玩家创造机会的实用建议。她将分析基于不同级别的案例研究：从动作序列到叙事驱动的领域。演讲分享了一些实用建议，即级别设计团队在此过程中学到的一些实用建议。它还可以洞悉设计“瘟疫2.0”的挑战，以及70人团队所面临的创建冒险游戏以及他们的主要收获。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Level Design Evolution of 'A Plague Tale'",
            "author": "Laura Mas Maury ",
            "organization": "Asobo Studio",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028870/The-Level-Design-Evolution-of",
            "index": 413,
            "overview": "Laura Mas Maury, Level Designer at Asobo Studio, talks through the evolution of A Plague Tale's Level Design. She shares some practical advice about breaking linearity or creating opportunities for the player in a narrative driven game. She bases her analysis on case studies from different levels: from action sequences to narrative driven areas. The talk shares some practical advice the Level Design Team has learned along the way. It also gives insights on the challenges of designing a \" Plague 2.0 \" and what the 70 people team faced creating an adventure game, as well as their main takeaways.",
            "translated": "Asobo Studio的Level Designer Laura Mas Maury通过瘟疫故事的水平设计的演变进行了交谈。她分享了一些关于打破线性或在叙事驱动的游戏中为玩家创造机会的实用建议。她将分析基于不同级别的案例研究：从动作序列到叙事驱动的领域。演讲分享了一些实用建议，即级别设计团队在此过程中学到的一些实用建议。它还可以洞悉设计“瘟疫2.0”的挑战，以及70人团队所面临的创建冒险游戏以及他们的主要收获。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Many Dimensions of Kirby",
            "author": "Shinya Kumazaki ",
            "organization": "HAL Laboratory, Inc.",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029356/The-Many-Dimensions-of",
            "index": 414,
            "overview": "One year after the launch of Kirby and the Forgotten Land, developers Shinya Kumazaki and Tatsuya Kamiyama discuss how they brought traditional Kirby gameplay into a 3D world, as well as examine some of the new features in the game, including the fan-favorite Mouthful Mode. Additionally, the developers will talk about the recently launched Kirby's Return to Dream Land Deluxe for Nintendo Switch and how they reimagined the 2D gameplay and the world of the multiplayer Wii classic. Close out the 30th anniversary of Kirby with this session celebrating Kirby's multi-dimensional milestone year. Pink attire not required!",
            "translated": "开发人员Shinya Kumazaki和Tatsuya Kamiyama在推出Kirby和被遗忘的土地后一年，讨论了他们如何将传统的Kirby游戏玩家带入3D世界，并检查了游戏中的一些新功能。此外，开发人员将讨论最近推出的Kirby回到Nintendo Switch的Dream Land Deluxe，以及他们如何重新想象2D游戏玩法和多人Wii Classic的世界。在本届会议上庆祝柯比的多维里程碑一年，结束了柯比30周年。不需要粉红色的服装！"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "To the Beat Y'all: What Designers Can Learn From Hip Hop",
            "author": "Jarory de Jesus ",
            "organization": "Housemarque",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029375/To-the-Beat-Y-all",
            "index": 426,
            "overview": "This session will give audiences an insight into the origins of hip hop and its cross-section with games, focusing on the pillar of the emcee and their literary techniques. Those selfsame techniques are applied to game story structure and written dialogue. Musical examples demonstrate the rhetorical techniques and structures that hip hop artists utilize, while game examples demonstrate how to apply those techniques to game production. Take a deep dive into hip hop's literary techniquesexploring the economy language, use of terminology, and the hierarchy of language in hip hop songs... with examples of how games can make use of these techniques.",
            "translated": "本届会议将使观众了解嘻哈的起源及其与游戏的横截面，重点是司仪的支柱及其文学技巧。这些自我标记技术应用于游戏故事结构和书面对话。音乐示例展示了嘻哈艺术家使用的修辞技术和结构，而游戏示例演示了如何将这些技术应用于游戏制作。深入了解嘻哈的文学技术，以经济语言，术语的使用以及嘻哈歌曲中语言的层次结构……其中包括游戏如何利用这些技术的示例。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "To the Beat Y'all: What Designers Can Learn From Hip Hop",
            "author": "Jarory de Jesus ",
            "organization": "Housemarque",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1028878/To-the-Beat-Y-all",
            "index": 427,
            "overview": "This session will give audiences an insight into the origins of hip hop and its cross-section with games, focusing on the pillar of the emcee and their literary techniques. Those selfsame techniques are applied to game story structure and written dialogue. Musical examples demonstrate the rhetorical techniques and structures that hip hop artists utilize, while game examples demonstrate how to apply those techniques to game production. Take a deep dive into hip hop's literary techniquesexploring the economy language, use of terminology, and the hierarchy of language in hip hop songs... with examples of how games can make use of these techniques.",
            "translated": "本届会议将使观众了解嘻哈的起源及其与游戏的横截面，重点是司仪的支柱及其文学技巧。这些自我标记技术应用于游戏故事结构和书面对话。音乐示例展示了嘻哈艺术家使用的修辞技术和结构，而游戏示例演示了如何将这些技术应用于游戏制作。深入了解嘻哈的文学技术，以经济语言，术语的使用以及嘻哈歌曲中语言的层次结构……其中包括游戏如何利用这些技术的示例。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Cross-Platform Game Development with the New URP...",
            "author": "Jonas Mortensen ",
            "organization": "Unity Technologies",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029391/Unity-Developer-Summit-Cross-Platform",
            "index": 438,
            "overview": "In this session, you will discover how to build beautiful cross-platform games in the Universal Render Pipeline (URP). URP technical artists walk you through the new URP Sample Scene to teach you how to scale the graphics of your games and provide solutions for common scalability challenges. See technical rundowns of select graphics features such as custom post-processing, custom lighting and shaders, plus tips on how to apply them in your own projects.",
            "translated": "在本届会议中，您将发现如何在通用渲染管道（URP）中构建美丽的跨平台游戏。URP技术艺术家带您浏览新的URP样本场景，以教您如何扩展游戏的图形并为常见可伸缩性挑战提供解决方案。请参阅精选的图形功能的技术利润，例如自定义后处理，自定义照明和着色器，以及如何将它们应用于自己的项目中的技巧。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Harnessing the Power of ECS for Unity (Presented...",
            "author": "Laurent Gibert ",
            "organization": "Unity Technologies",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029392/Unity-Developer-Summit-Harnessing-the",
            "index": 439,
            "overview": "Learn more about ECS for Unity and how Sunblink built HEROish. This highly performant card-battling MOBA title relies on ECS functionality, including the Entities package and Netcode for Entities. Hear how you can start exploring ECS for Unity through code samples and demo projects that will be delivered in 2023.",
            "translated": "了解有关ECS的更多信息，以了解Unity以及如何建立Herioish。这种表现较高的卡片冠军MOBA标题依赖于ECS功能，包括实体软件包和实体的NetCode。听听如何通过2023年将交付的代码样本和演示项目开始探索ECS的ECS。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: How to Build Web3 Games That Are Actually Fun (Presented by ...",
            "author": "Peter Kieltyka ",
            "organization": "Horizon",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-23/play/1029159/Web3-Forum-How-to-Build",
            "index": 469,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'God of War Ragnarok's' Visual Scripting Solution",
            "author": "Sam Sternklar ",
            "organization": "Santa Monica Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028787/-God-of-War-Ragnarok",
            "index": 8,
            "overview": "As games become larger and larger, designers are tasked with scripting more complex systems and sequences. Programming departments across the industry are responsible for ensuring that the environments and APIs available to designers are simultaneously flexible, safe, and efficient. For the development of God of War: Ragnark, Santa Monica Studio found its existing scripting solution lacking, and set out to alter both the tools available for scripting and how their designers approach scripting as a wholeand in the process give more freedom to designers and programmers alike. This talk discusses using event-based scripting, command deferral, and strong collaboration with designers in the context of creating a flexible, safe, and efficient scripting environment.",
            "translated": "随着游戏的越来越大，设计师的任务是脚本更复杂的系统和序列。整个行业的编程部门负责确保设计人员可用的环境和API同时灵活，安全和高效。为了发展战神：拉格纳克（Ragnark），圣塔莫尼卡（Santa Monica）工作室发现其现有的脚本解决方案缺乏，并着手更改两个可用于脚本的工具，以及他们的设计师如何将脚本作为整个过程，使设计师和程序员更加自由也一样。本演讲讨论了基于事件的脚本，命令延期和与设计师的强大合作，以创建灵活，安全和高效的脚本环境。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'Us vs. Them' and the LaserDisc Debacle of 1984",
            "author": "Warren Davis ",
            "organization": "Independent",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029402/-Us-vs-Them-and",
            "index": 17,
            "overview": "With the appearance of Dragon's Lair in 1983, it seemed that LaserDisc games were poised to be the future of the arcade industry. Within months, a slew of LaserDisc-based video arcade games from multiple manufacturers flooded the market. Warren Davis, coming off the success of Q*bert, worked on one such game, Us vs. Them, intended as a kit for the hugely popular M.A.C.H. 3. But despite every indication that Us vs. Them was headed for record sales and widespread acclaim, LaserDisc games became reviled and shunnedorders were canceled, lawsuits were filed, and the arcade industry suffered a major crash. Why? What were the factors that led to this turnaround? Warren dives into the making of Us vs. Them and how the bottom fell out of the industry just as it was about to be released.",
            "translated": "随着1983年Dragon's Lair的出现，Laserdisc Games似乎有望成为街机行业的未来。在几个月内，来自多家制造商的一系列基于激光的视频街机游戏淹没了市场。沃伦·戴维斯（Warren Davis）取得了Q*Bert的成功，从事这样的游戏，美国与他们，目的是作为非常受欢迎的M.A.C.H.的套件。3。但是，尽管有一切迹象表明我们与他们的销售尚未获得创纪录的好评，但Laserdisc Games遭到了谴责，被取消了Shunnedorders，提起诉讼，并且街机行业遭受了重大崩溃。为什么？导致这种转变的因素是什么？沃伦（Warren）深入了解我们与他们的制作，以及当即将发布时如何从行业中脱颖而出。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Achieving Real-Time Ray Tracing on Xbox with Unity and DirectX 12 (Prese...",
            "author": "Adam Miles ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028910/Achieving-Real-Time-Ray-Tracing",
            "index": 26,
            "overview": "Join Unity and Microsoft in this deep dive technical session that explores Unity's latest DX12 improvements and advancements for ray tracing on Xbox. See how Light Brick Studio updated their hit game LEGO Builder's Journey with the latest ray tracing features for Xbox. Learn about the latest performance gains for DX12, and how recent Unity Editor improvements streamline game development workflows for Windows platforms. You'll also get a full introduction to Unity's ray tracing solution for Xbox, how to leverage the High Definition Render Pipeline to make the most out of advanced graphics features, and get an insider's look at future ray tracing features. ",
            "translated": "加入Unity和Microsoft参加这次深度潜水技术会议，探讨了Unity在Xbox上进行射线追踪的最新DX12改进和进步。查看Light Brick Studio如何使用Xbox的最新射线跟踪功能更新他们的热门游戏乐高建筑商的旅程。了解DX12的最新性能增长，以及最近的Unity编辑器改进如何简化Windows平台的游戏开发工作流程。您还将全面介绍Unity的Xbox射线跟踪解决方案，如何利用高清渲染管道来充分利用高级图形功能，并了解Insider对未来的射线跟踪功能的介绍。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Architecture Deep Dive for a No-coding Gaming Platform(Yahaha) and its A...",
            "author": "Glenn SJ Lee ",
            "organization": "YAHAHA Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028949/Architecture-Deep-Dive-for-a",
            "index": 53,
            "overview": "nDo you wish your game development education was a little more accessible now? n nBecoming a professional developer is an endless journey and difficult where you should start. nLearning Game Development as a service is a vaster task than you think, and there are various areas of expertise such as game concept, programming & coding, 3D modeling, animation, so on. nIf your learning starts with various programming languages, it doesn't sound very exciting and joyful.n nThe 3D no-code metaverse platform provided by Yahaha enables users to experience a compact full-spectrum of game development and the value chain from concept creation to game publishing.nnAlso, various automated advanced tools such as Node graph, Lua Script, and AI system provided by YAHAHA will provide many insights to those learning game development.",
            "translated": "您希望您的游戏开发教育现在更容易访问吗？n nbecoming a专业开发人员是一段无尽的旅程，您应该从应该开始的地方很难。学习游戏开发作为一项服务是一项比您想象的一项vaster任务，并且有各种专业知识，例如游戏概念，编码和编码，3D建模，动画等。nif您的学习始于各种编程语言，听起来并不令人兴奋和快乐。nn n the 3D无代码元平台由Yahaha提供game Publishing.nnalso，各种自动化的高级工具，例如Yahaha提供的节点图，LUA脚本和AI系统，将为那些学习游戏开发的人提供许多见解。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Art Optimization in the 41st Millennium: How FatShark Constructed their ...",
            "author": "Jesper Tingvall ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028960/Art-Optimization-in-the-41st",
            "index": 58,
            "overview": "Rendering high resolution art is the single biggest tax on any game, making art optimization a critical path to performance. While making Warhammer 40K: Darktide, Stockholm-based developer FatShark partnered with Simplygon to resolve a range of common art optimization issues. Using real examples from Darktide, FatShark will share detailed challenges and Simplygon will demonstrate a specific part of the toolset designed to solve. In this talk, you'll learn how to go from optimizing small assets like characters to large assets like entire levels and walk away with not only a broad understanding of art optimization, but also specific solutions made possible by the Simplygon toolsets.",
            "translated": "渲染高分辨率艺术是任何游戏中最大的税收，使艺术优化成为绩效的关键途径。在制作战锤40k时：Darktide时，位于斯德哥尔摩的开发人员Fatshark与SimplyGon合作解决了一系列常见的艺术优化问题。Fatshark使用Darktide的真实示例将分享详细的挑战，而SimplyGon将展示旨在解决的工具集的特定部分。在这次演讲中，您将学习如何从优化角色（例如角色）到整个级别等大型资产，不仅对艺术优化的广泛理解，而且还通过SimplyGon工具集提供了特定的解决方案。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Autodesk Developer Summit: Maya Codex: Leveraging Large Language Models ...",
            "author": "Chip Weatherman ",
            "organization": "Autodesk",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028968/Autodesk-Developer-Summit-Maya-Codex",
            "index": 69,
            "overview": "Join experts from Autodesk as they discuss their collaboration with Microsoft on how they're connecting AI with content creation tools like Maya. They'll showcase how they took advantage of large language models and natural language processing to make it easier for artists to interact and create intuitively in Maya.",
            "translated": "加入Autodesk的专家，与Microsoft讨论他们如何与Maya这样的内容创建工具连接的合作。他们将展示他们如何利用大型语言模型和自然语言处理，以使艺术家更容易在Maya中进行互动和直观。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "BroadLeaf: Real-Time Cinematic Rendering of Large-Scale Forests",
            "author": "Yixin Hu ",
            "organization": "Tencent America",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028728/BroadLeaf-Real-Time-Cinematic-Rendering",
            "index": 79,
            "overview": "Realistic real-time rendering of large-scale forests is an important, yet difficult, problemdue to the massive number of plant-leaf geometries. In this session, Yixin Hu, Senior Graphics Researcher at Tencent America, proposes a new method: BroadLeaf. For rendering large-scale plane leaves with cinematic quality in real time. Their rendered plant leaves have explicit geometries (triangle meshes) and are single-leaf interactable. To reach this result, BroadLeaf generates and handles the Level of Details (LODs) of tree leaves automatically and provides a smooth and efficient LOD transition. The leaves from different levels are organized hierarchically, which accelerates and makes more precise the LOD selection and culling for reducing the rendering geometry complexity. Learn more about how BroadLeaf is faster and more robust than existing methods, and how it can be easily integrated into game engines or directly used in real-time rendering applications. ",
            "translated": "对大规模森林的实时渲染现实是对大量植物叶几何形状数量的重要而困难的问题。在本届会议上，腾讯美国的高级图形研究员Yixin Hu提出了一种新方法：Broadleaf。用于实时渲染具有电影质量的大型平面叶子。它们渲染的植物叶具有明确的几何形状（三角形网格），并且是单叶可以相互作用的。为了达到此结果，Broadleaf会自动生成和处理树叶的细节水平（LOD），并提供平稳有效的LOD过渡。来自不同级别的叶子是分层组织的，这加速并更精确地选择了LOD选择和淘汰，以降低渲染几何复杂性。了解更多有关Broadeaf的速度比现有方法更快，更健壮的信息，以及如何轻松地集成到游戏引擎中或直接用于实时渲染应用程序中。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Building Night City: The Technology of 'Cyberpunk 2077'",
            "author": "Charles Tremblay ",
            "organization": "CD Projekt RED",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028734/Building-Night-City-The-Technology",
            "index": 82,
            "overview": "Night City is one of the most ambitious virtual cities realized in a video game to date. Since it has a scale that, from the technical perspective, makes even The Witcher 3: The Wild Hunt seem small, the tech team at CD Projekt RED had to re-design many parts of their in-house engine. This talk describes the challenges faced and solutions developed when building Red Engine 4from using a prefab-based hierarchy to build and assemble the world, to the approaches taken for streaming different game systems, as well as how the team managed memory and CPU performance. In addition to covering the technical decisions that were made, this talk will dig into the \"why\" behind those decisions, as well as look at where the technology succeeded and what could be done differently. ",
            "translated": "夜城是迄今为止视频游戏中最雄心勃勃的虚拟城市之一。从技术角度来看，它的规模甚至使《巫师3：野外狩猎》看起来很小，因此CD Projekt Red的科技团队不得不重新设计其内部发动机的许多部分。本演讲描述了使用基于预制的层次结构构建红色引擎4时所面临的挑战和解决方案，以构建和组装世界，以供流式传输不同的游戏系统所采用的方法，以及团队如何管理内存和CPU性能。除了涵盖做出的技术决策之外，这次演讲还将挖掘这些决策背后的“为什么”，并查看技术成功的位置以及可以做些不同的事情。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Case Study: Creating Realistic Facial Motion for 'The Quarry'",
            "author": "Aruna Inversin ",
            "organization": "Digital Domain",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028739/Case-Study-Creating-Realistic-Facial",
            "index": 87,
            "overview": "In this case study of Digital Domain's technology and pipeline developed for the facial performance capture on The Quarry, attendees will learn about the exciting workflows used to transfer human emotion automatically to realistic digital characters. These feature film-quality facial capture technologies have been adapted to support game-scale workloads and interactivity. This deep dive into the Digital Domain facial pipeline will entice developers to think about new approaches to solving human performances onto digital puppets.",
            "translated": "在这种案例研究中，针对采石场的面部绩效捕获开发了数字域技术和管道，与会者将了解用于自动转移人类情感的令人兴奋的工作流程。这些故事片质量的面部捕获技术已适应了支持游戏规范的工作量和互动性。深入研究数字域面部管道将吸引开发人员考虑将人类表演解决在数字木偶上的新方法。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Case Study: Creating Realistic Facial Motion for 'The Quarry'",
            "author": "Aruna Inversin ",
            "organization": "Digital Domain",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028987/Case-Study-Creating-Realistic-Facial",
            "index": 88,
            "overview": "In this case study of Digital Domain's technology and pipeline developed for the facial performance capture on The Quarry, attendees will learn about the exciting workflows used to transfer human emotion automatically to realistic digital characters. These feature film-quality facial capture technologies have been adapted to support game-scale workloads and interactivity. This deep dive into the Digital Domain facial pipeline will entice developers to think about new approaches to solving human performances onto digital puppets.",
            "translated": "在这种案例研究中，针对采石场的面部绩效捕获开发了数字域技术和管道，与会者将了解用于自动转移人类情感的令人兴奋的工作流程。这些故事片质量的面部捕获技术已适应了支持游戏规范的工作量和互动性。深入研究数字域面部管道将吸引开发人员考虑将人类表演解决在数字木偶上的新方法。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Connect Players Across Platforms and Storefronts with Epic Online Servic...",
            "author": "Rajen Kishna ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029004/Connect-Players-Across-Platforms-and",
            "index": 103,
            "overview": "Players today expect to play on any platform and connect with any of their friends. In this session, you'll get an overview of Epic Online Services and how its free back-end functionality enables game communities to play togetherno matter which platform players are using.Epic Games' Josh Markiewicz and Rajen Kishna will dive into Epic Online Services' crossplay functionality, explain what's needed to get started, and illustrate how you can implement EOS crossplay features in your game using any engine. They are joined by guest speaker Samuel Malone from Vaulted Sky Games, who will provide real-world examples of how Epic Online Services powers their chaotic multiplayer hide-and-seek game Midnight Ghost Hunt.",
            "translated": "今天的玩家希望在任何平台上玩耍，并与任何朋友建立联系。在本届会议中，您将获得史诗般的在线服务的概述，以及其免费的后端功能如何使游戏社区能够玩togetherno Mattery。交叉游戏功能，说明入门需要的内容，并说明如何使用任何引擎在游戏中实现EOS交叉游戏功能。来自Vaulted Sky Games的嘉宾演讲嘉宾Samuel Malone也加入了他们的行列，他们将提供现实的示例，说明史诗般的在线服务如何为他们混乱的多人游戏捉迷藏游戏午夜幽灵狩猎。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Constrain Your Content: Generating Better Content with Constraint Progra...",
            "author": "Marc Taylor ",
            "organization": "Big Duck Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028744/Constrain-Your-Content-Generating-Better",
            "index": 104,
            "overview": "This session reviews some of the challenges encountered when creating levels for Big Duck Games' Flow Fit and Flow Fit: Sudoku, and how they were overcome by using Constraint Programming. Marc Taylor, Puzzle Master at Big Duck Games, will dive into the practical application of Constraint Programming for content generation, covering in detail how to approach the creation of Constraint Programming models for solvers. He will also give detailed coverage of how to create a valid Sudoku puzzle using a CP-SAT solver, as well as go on an exploration of how the constraints can be quickly changed to create a significant amount of diverse content. Finally, he will discuss how Constraint Programming can be used as a tool to assist in manual content creation.",
            "translated": "本届会议回顾了为Big Duck Games的流动拟合和流拟合：Sudoku以及如何通过使用约束编程克服它们时遇到的一些挑战。Big Duck Games的拼图大师马克·泰勒（Marc Taylor）将深入介绍约束编程的实际应用，以详细介绍如何为求解器创建约束编程模型。他还将提供有关如何使用CP-SAT求解器创建有效的Sudoku难题的详细报道，并探索如何快速更改约束以创建大量不同的内容。最后，他将讨论如何将约束编程用作帮助创建手动内容的工具。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Create Hyper-realistic Real-Time Characters (Presented by Unity Technolo...",
            "author": "Mark Schoennagel ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029006/Create-Hyper-realistic-Real-Time",
            "index": 106,
            "overview": "Imagine a game character that looks real and captures your motion in real-time. It's now a reality. Players can use their own real-time interactive digital characters to play immersive games. This session will showcase how to achieve this with the Unity ecosystem of tools.",
            "translated": "想象一个看起来真实的游戏角色，并实时捕获您的动作。现在是现实。玩家可以使用自己的实时交互式数字角色来玩沉浸式游戏。本届会议将展示如何使用工具的统一生态系统来实现这一目标。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Creating Your First Game in Fortnite (With UEFN) (Presented by Epic Games)",
            "author": "Jay Villanueva ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029012/Creating-Your-First-Game-in",
            "index": 110,
            "overview": "Fortnite has become an ecosystem where anyone can create and publish their own games. In fact, nearly half of all time spent in Fortnite already takes place in games and experiences that have been created by players using the Fortnite Creative toolset. Our mission is to build on this and empower anyone to create games and experiences in Fortnite to be enjoyed by millions of players.In this talk, we'll dive into our plans for turning this vision into a realityand take a look at some of the technology and tools that are going to get us there.",
            "translated": "Fortnite已成为一个生态系统，任何人都可以创建和发布自己的游戏。实际上，在Fortnite上花费的所有时间的近一半已经发生在使用Fortnite Creative Toolset的玩家创造的游戏和经验中。我们的使命是建立在这方面，并授权任何人在Fortnite中创建游戏和体验，以被数百万的玩家享受。在这次演讲中，我们将研究我们将这种愿景变为现实的计划，并看看一些将使我们到达那里的技术和工具。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Cross-Platform Mobile and PC Rendering in 'Earth: Revival'",
            "author": "Chao Wang ",
            "organization": "Nuverse, JNG Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028751/Cross-Platform-Mobile-and-PC",
            "index": 113,
            "overview": "Earth: Revival' delivers a high-quality open-world game on mobile devices and PCs using a unified, highly scalable cross-platform renderer. The custom Unity-based engine utilizes a hybrid occlusion culling method, a new multi-threaded rendering architecture, a tile-based deferred renderer, and a render graph dedicated to cross-platform optimizations.In this session, Chao Wang, Game Engine Technical Director at Nuverse, will discuss engine and render pipeline optimizations for multiple generations of mobile and PC devices. He will present techniques for \"write once, run anywhere\" cross-platform shaders and render passes, and show examples of novel rendering features.",
            "translated": "Earth：Revival'使用统一，高度可扩展的跨平台渲染器在移动设备和PC上提供高质量的开放世界游戏。基于自定义的统一发动机利用混合遮挡方法，一种新的多线程渲染架构，基于瓷砖的延期渲染器以及专门用于跨平台优化的渲染图。在Nuverse上，将讨论发动机和渲染管道优化的多代移动设备和PC设备。他将介绍“一次写，在任何地方运行”跨平台着色器和渲染通行证的技术，并展示新颖渲染功能的示例。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Deep Dive into Data-Oriented Design for a Cross-platform UGC Game Engine...",
            "author": "Zhongfu Gao ",
            "organization": "YAHAHA Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029021/Deep-Dive-into-Data-Oriented",
            "index": 115,
            "overview": "This talk demonstrates the challenges we faced during the development of Yahaha Studio, and explains why we chose to use the Data Oriented Design pattern.nnBy using DoD, the platform could have a high degree of control over game data and game logic. This would allow the platform to perform the underlying network synchronization and developers would have to worry less about it. The platform could use this to optimize performance at runtime by, for example, dynamically adjusting the AOI strategy and network synchronization interval, etc. The design has other benefits as well, such as easy tracking of game data and being able to update the platform with good backward compatibility.",
            "translated": "这次演讲展示了我们在Yahaha Studio开发期间面临的挑战，并解释了为什么我们选择使用面向数据的设计模式。使用DOD，该平台可以高度控制游戏数据和游戏逻辑。这将使平台执行基础网络同步，而开发人员将不必担心它。该平台可以使用它来在运行时优化性能，例如，动态调整AOI策略和网络同步间隔等。设计还具有其他好处，例如轻松跟踪游戏数据并能够使用好的向后兼容性。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Discord Apps 101: Come Build! (Presented by Discord)",
            "author": "Shay DeWael ",
            "organization": "Discord",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029031/Discord-Apps-101-Come-Build",
            "index": 119,
            "overview": "Interested in enhancing your Discord experience and building a customized app for your friends? Discord developers have made mini-games, LFG helpers, leaderboards, game alerts, wiki lookups, and more - so join us for a platform overview, some inspiration, and a power session on new features and design best practices. Whether you want to build for just your friends or to build a business, Discord enables you to create fun and personalized experiences in a place where millions of users already hang out. Discord apps can take just weeks (or even days) to prototype - you can even test some concepts from your next game idea! Come learn directly from our API team - and we won't judge you for doodling about your Big Idea while we teach you how to get started.",
            "translated": "有兴趣增强您的不和谐体验并为您的朋友构建定制应用程序吗？Discord Developers制作了迷你游戏，LFG帮助者，排行榜，游戏警报，Wiki查找等等 - 因此，请加入我们，以获取平台概述，一些灵感以及有关新功能和设计最佳实践的力量会议。无论您是想为朋友建立还是建立业务，不一致，都可以使您能够在数百万用户已经闲逛的地方创建有趣而个性化的体验。Discord应用程序可能仅需几周（甚至几天）才能实现 - 您甚至可以从下一个游戏创意中测试一些概念！直接向我们的API团队学习 - 我们不会在我们教您如何入门时对您的大主意进行审判。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Efficient Software Occlusion Culling on Mobile Platform in 'Life After'",
            "author": "Wenhui Tao ",
            "organization": "Netease Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028763/Efficient-Software-Occlusion-Culling-on",
            "index": 128,
            "overview": "In this session, Wenhui Tao, Game Engine Programmer at NetEase Games, talks about the efficient software occlusion culling (SOC) solution used in the mobile game Life After. The solution consists of three highly optimized components. It has a lightweight SOC algorithm, along with an efficiently organized culling pipeline, and an innovative occlusion mesh generator which providing high-quality occlusion meshes for the SOC algorithm.In practice, within about 1.5ms per frame on low-end phones (e.g. iPhone 6s), the solution works perfectly with the game's dynamic open world, reducing draw calls by an average of 65% without introducing any false occlusions, allowing artists to create large and complex scenes without paying too much attention to performance issues.In this talk, Wenhui Tao covers all three parts, showing how to optimize the flow and codes of the culling algorithm for Neon-capable phones, as well as how to cut down the pipeline cost by eliminating cache misses and taking advantage of multi-threading. He will also reveal how to use the so-called 'visibility functions' to smooth surfaces and generate high-quality occlusion meshes.",
            "translated": "在本次会议上，游戏引擎程序员ATEASE游戏Wenhui Tao讨论了在移动游戏寿命中使用的有效软件遮挡（SOC）解决方案。该解决方案由三个高度优化的组件组成。它具有轻巧的SOC算法，以及有效组织的剔除管道，以及创新的遮挡网状发电机，可为Soc Algorithmm.cor提供高质量的闭塞网格，以在每帧约1.5ms的低端手机（例如，低端手机）内（例如6s），该解决方案与游戏的动态开放世界完美搭配，将抽奖电话平均减少了65％，而无需引入任何虚假的遮挡，使艺术家能够创建大型且复杂的场景而无需过多关注表演问题。Wenhui Tao覆盖了所有三个部分，展示了如何优化具有霓虹灯能力的手机的剔除算法的流量和代码，以及如何通过消除缓存失误和利用多线程的优势来降低管道成本。他还将揭示如何使用所谓的“可见性函数”来平滑表面并产生高质量的闭塞网格。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Extending In-Game Textures Using CDNs for 'Call of Duty: Modern Warfare 2'",
            "author": "Chris Fowler ",
            "organization": "Sledgehammer Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028772/Extending-In-Game-Textures-Using",
            "index": 135,
            "overview": "This session presents an overview of On-Demand Texture streaming technology for Call of Duty, up to and including 2022's Modern Warfare 2. This system significantly reduces the install size of a Call of Duty title while retaining high-quality image quality and low latency multiplayer experience.Sledgehammer Games' Principal Engineer Chris Fowler goes into how they split texture assets for packaging into the title vs. streaming via CDN, and how they download some content on demand as you encounter it from a CDN near the user.",
            "translated": "本次会议概述了《使命召唤》的按需纹理流媒体技术，包括2022年的现代战争2。该系统大大降低了使命召唤标题的安装大小，同时保留了高质量的图像质量和低潜伏期的多人游戏经验。SeledshammerGames的首席工程师Chris Fowler进入了如何将纹理资产拆分，以通过CDN包装到标题与流式传输中，以及他们在用户附近的CDN遇到的时如何按需下载一些内容。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Android Game Graphics: OpenGL ES vs. Vulkan Cas...",
            "author": "Nate Trost ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028939/Google-Developer-Summit-Android-Game",
            "index": 202,
            "overview": "This session will explore the two graphics APIs available to games running on Android: OpenGL ES and Vulkan. The pros and cons of each API will be discussed. A case study of the performance and power benefits of Vulkan will be presented. Recommendations will be given on when to consider supporting both APIs versus one or the other.",
            "translated": "本届会议将探索在Android上运行的游戏：OpenGL ES和Vulkan上可用的两个图形API。将讨论每个API的优缺点。将介绍有关Vulkan的性能和功率益处的案例研究。将提出建议何时考虑支持API与另一个或另一个API。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Built for Billions, Tailored for Games; Harness...",
            "author": "Ishan Sharma ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028983/Google-Developer-Summit-Built-for",
            "index": 203,
            "overview": "Building and maintaining the platform to run games is getting more complex - shortening time-to-market, hyperscaling to meet global player traffic, maximizing uptime and stability, and more, all the while maintaining low operating costs. In this talk, discover how to build a dedicated game server environment with Google Kubernetes Engine. You'll learn how, by using GKE, you can unite your technology with Google Cloud to create a fleet of next-generation servers that are fully managed, resilient, cost-effective, manageable, and flexible. We will learn about exciting new features and overview a demo to get you started quickly.",
            "translated": "构建和维护运行游戏平台的情况变得越来越复杂 - 缩短了市场的时间，超级缩放以满足全球玩家的流量，最大化正常运行时间和稳定性等等，同时保持低廉的运营成本。在本演讲中，发现如何使用Google Kubernetes引擎构建专用的游戏服务器环境。您将通过使用GKE了解如何将技术与Google Cloud团结起来，以创建一个完全管理，弹性，具有成本效益，易于管理和灵活的下一代服务器机队。我们将了解令人兴奋的新功能并概述演示，以使您快速入门。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: GKE and Unity: A Matchmaker Made in Heaven (Pre...",
            "author": "Ishan Sharma ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029142/Google-Developer-Summit-GKE-and",
            "index": 206,
            "overview": "Google Kubernetes Engine (GKE) is a managed environment for deploying, managing, and scaling containerized applications using the Google Cloud Platform. GKE can be used to power a number of critical player-impacting game features. This talk will discuss how Unity uses GKE to power its multiplayer matchmaking services, and how GKE can be used to scale these workloads to meet the demands of millions of players.",
            "translated": "Google Kubernetes Engine（GKE）是使用Google Cloud Platform部署，管理和缩放集装应用程序的托管环境。GKE可用于为许多严重影响玩家的游戏功能供电。本演讲将讨论Unity如何使用GKE为其多人游戏配对服务提供动力，以及如何使用GKE来扩展这些工作量以满足数百万球员的需求。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Google Play Games on PC: Com2uS Success Story (...",
            "author": "Andrew Giugliano ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029147/Google-Developer-Summit-Google-Play",
            "index": 207,
            "overview": "Curious to learn more about Google Play Games on PC? Hear from Google Play's partner Com2uS on their entire onboarding journey for Summoners War: Chronicles. From the motivation behind joining the platform, simship launch between mobile and PC, and practical optimization tips for cross-platform gaming, join us to learn more about the success of Summoners War: Chronicles.",
            "translated": "好奇想了解有关PC上的Google Play游戏的更多信息吗？从Google Play的合作伙伴Com2us那里听到召唤战争的整个入门旅程：编年史。从加入该平台的动机，移动和PC之间的Simship启动以及用于跨平台游戏的实用优化技巧，加入我们，以了解有关Summoners War：Chronicles的成功的更多信息。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Google Play Games on PC: Pass Certification in ...",
            "author": "Patrick Martin ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029149/Google-Developer-Summit-Google-Play",
            "index": 209,
            "overview": "You have an excellent mobile game and are looking for your next big market. Why not try shipping it on PC using Google Play Games for PC? Here we'll cover the certification process and common changes needed to bring your game to a new platform.",
            "translated": "您拥有出色的手机游戏，并正在寻找下一个大型市场。为什么不尝试使用PC上的Google Play游戏在PC上运输它？在这里，我们将介绍将您的游戏带入新平台所需的认证过程和所需的常见更改。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Improving Game Performance with Android Dynamic...",
            "author": "Charlie Stokes ",
            "organization": "ARM",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029174/Google-Developer-Summit-Improving-Game",
            "index": 212,
            "overview": "Android Dynamic Performance Framework (ADPF) is a set of Android APIs that can reduce overheating, improve battery usage, and improve CPU performance for critical tasks. This talk will describe how best to use this technology through Unity's Adaptive Performance or by directly accessing the APIs. It will include a demo of the new expanded Dr ARM game to illustrate the benefits of the latest ADPF features.",
            "translated": "Android动态性能框架（ADPF）是一组Android API，可以减少过热，改善电池使用情况并改善关键任务的CPU性能。本演讲将描述如何通过Unity的自适应性能或直接访问API来最好地使用这项技术。它将包括一个新扩展的DR ARM游戏的演示，以说明最新的ADPF功能的好处。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Google Developer Summit: Squeezing Out the Last 5% of Performance: AGDE,...",
            "author": "Simon Cooke ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029314/Google-Developer-Summit-Squeezing-Out",
            "index": 215,
            "overview": "The Android Game Development Extension for Visual Studio (AGDE) continues to provide support for developing games for Android in ways that integrate well with your existing development environment.In our newest release, we're adding Profile Guided Optimization (PGO) support. Join us to learn what PGO is, how it works, how to use it, and how with some work on your side you can bake it into your build process. As a consequence of this, we'll show you how to reduce the load on your testers by multiplexing their work across devices in your test lab, increase the number of devices you're testing on, be ready to test your games on Firebase, and improve the runtime performance of your games by 5% - or in some cases even more.",
            "translated": "Visual Studio（AGDE）的Android Game开发扩展扩展，继续为Android开发游戏的支持提供与您现有开发环境良好相结合的方式。在我们的最新版本中，我们添加了个人资料指导优化（PGO）支持。加入我们，了解什么是PGO，它的工作方式，如何使用它以及如何在您身边进行某些工作，您可以将其烘烤到构建过程中。因此，我们将向您展示如何通过在测试实验室中的设备上多重工作来减少测试人员的负载，增加您正在测试的设备的数量，准备在Firebase上测试您的游戏，并将游戏的运行时性能提高5％，或者在某些情况下更多。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Grappling with Performance: Rendering Optimization Strategies in 'Rumble...",
            "author": "Jon Moore ",
            "organization": "Iron Galaxy Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028790/Grappling-with-Performance-Rendering-Optimization",
            "index": 216,
            "overview": "Rumbleverse is a 40-player battle royale game built in Unreal Engine 4but using a general-purpose engine doesn't stop Iron Galaxy Studios from making engine-level optimizations to push the game to look the best it can be, while running at 60 FPS across console generations. Jon Moore, the game's lead rendering engineer, will share many optimizations made throughout the game's development and how optimization opportunities arise when leveraging a specific game's constraints. Ultimately, choice of engine doesn't affect optimization potential.",
            "translated": "Rumbleverse是一款40名玩家的大皇家游戏游戏，在虚幻引擎中建造了4个，但使用通用发动机并没有阻止Iron Galaxy Studios对发动机级优化进行优化，以推动游戏的最佳状态，而在60 fps运行时跨控制台世代。游戏的首席渲染工程师乔恩·摩尔（Jon Moore）将在整个游戏的开发中分享许多优化，以及在利用特定游戏的约束时如何出现优化机会。最终，发动机的选择不会影响优化潜力。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Level Up Your Game: Explore Play-to-Own Economy with Metamask Wallet (Pr...",
            "author": "Ezgi Cengiz ",
            "organization": "ConsenSys",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029447/Level-Up-Your-Game-Explore",
            "index": 291,
            "overview": "In this session, we'll explore the potential of PlayTo Own with MetaMask Wallet as a powerful tool for game developers and players. MetaMask allows users to manage their cryptocurrency wallets and interact with blockchain-based applications.As a game developer, you'll learn how MetaMask SDK can be integrated into your game to enable new revenue streams. With MetaMask, you can easily implement in-game purchases and enable players to buy, sell, and trade virtual goods using tokens and NFTs. We'll walk you through the process of setting up MetaMask in your game and show you how to leverage this technology to create a more engaging and profitable game experience.As a game player, you'll discover the benefits of using MetaMask Wallet to make purchases and engage with your favorite games. With MetaMask, you'll have a secure and easy-to-use wallet that can store various cryptocurrencies/NFTs and enable seamless transactions.",
            "translated": "在本届会议中，我们将探索使用MetAmask Wallet作为游戏开发人员和玩家的强大工具的潜力。MetAmask允许用户管理其加密货币钱包并与基于区块链的应用程序进行交互。作为游戏开发人员，您将了解如何将MetAmask SDK集成到游戏中以启用新的收入流。使用MetAmask，您可以轻松地实施游戏中的购买，并使玩家能够使用令牌和NFT购买，出售和交易虚拟商品。我们将引导您完成游戏中设置元掩体的过程，并向您展示如何利用这项技术创造更具吸引力和盈利的游戏体验。作为游戏玩家，您会发现使用MetAmask Wallet的好处购买并参与您喜欢的游戏。使用MetAmask，您将拥有一个安全且易于使用的钱包，可以存储各种加密货币/NFT并实现无缝交易。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: Exploring the Technical Arts in the...",
            "author": "Joshua Yu ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029050/LIGHTSPEED-STUDIOS-Developer-Summit-Exploring",
            "index": 292,
            "overview": "The creation of open-world mobile games often presents both potential and difficulties in the area of art design due to its considerable amount of content and intricate gameplay. Developers have also long been confronted with the task of integrating dynamic indirect lighting, particularly into expansive open-world games, as limited baking is inadequate in effectively adjusting to changes in the environment, nor can mobile devices calculate real-time processes such as ray tracing. Joshua Yu and Leon Wei from LIGHTSPEED STUDIOS will explain the rendering and performance optimization techniques and shading solutions that were used in UNDAWN to deliver an engaging experience. They will also present a real-time irradiance solution that creates irradiance probes in accurate positions and processes them into irradiance storage which is then employed to shade indirect lighting for objects. This technique ensures the GPU's rendering potency.",
            "translated": "开放世界手机游戏的创建经常在艺术设计领域既有潜力又出现困难，因为它的内容大量和复杂的游戏玩法。长期以来，开发人员还面临着整合动态间接照明的任务，尤其是在广阔的开放世界游戏中，因为有限的烘焙在有效地适应环境变化方面不足，移动设备也无法计算实时流程，例如射线示踪等实时流程。。Lightspeed Studios的Joshua Yu和Leon Wei将解释Undawn中使用的渲染和性能优化技术和阴影解决方案，以提供引人入胜的体验。他们还将提出一种实时辐照解决方案，该解决方案可在准确的位置中创建辐照探针，并将其处理为辐照度存储，然后将其用于对物体的间接照明。此技术确保GPU的渲染效力。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: Exploring the Technical Arts in the...",
            "author": "Joshua Yu ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028771/LIGHTSPEED-STUDIOS-Developer-Summit-Exploring",
            "index": 293,
            "overview": "The creation of open-world mobile games often presents both potential and difficulties in the area of art design due to its considerable amount of content and intricate gameplay. Developers have also long been confronted with the task of integrating dynamic indirect lighting, particularly into expansive open-world games, as limited baking is inadequate in effectively adjusting to changes in the environment, nor can mobile devices calculate real-time processes such as ray tracing. Joshua Yu and Leon Wei from LIGHTSPEED STUDIOS will explain the rendering and performance optimization techniques and shading solutions that were used in UNDAWN to deliver an engaging experience. They will also present a real-time irradiance solution that creates irradiance probes in accurate positions and processes them into irradiance storage which is then employed to shade indirect lighting for objects. This technique ensures the GPU's rendering potency.",
            "translated": "开放世界手机游戏的创建经常在艺术设计领域既有潜力又出现困难，因为它的内容大量和复杂的游戏玩法。长期以来，开发人员还面临着整合动态间接照明的任务，尤其是在广阔的开放世界游戏中，因为有限的烘焙在有效地适应环境变化方面不足，移动设备也无法计算实时流程，例如射线示踪等实时流程。。Lightspeed Studios的Joshua Yu和Leon Wei将解释Undawn中使用的渲染和性能优化技术和阴影解决方案，以提供引人入胜的体验。他们还将提出一种实时辐照解决方案，该解决方案可在准确的位置中创建辐照探针，并将其处理为辐照度存储，然后将其用于对物体的间接照明。此技术确保GPU的渲染效力。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: Multi-agent AI Production of FPS Ga...",
            "author": "Gerry SUN ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028822/LIGHTSPEED-STUDIOS-Developer-Summit-Multi",
            "index": 298,
            "overview": "In-game AI is a vital element in the creation of FPS games, as it can be implemented in various situations including PVE gameplay, to take over for disconnected players, and populate online matchmaking services. These circumstances necessitate a high level of both AI power and human-like behavior, thus creating a challenge for classical rule-based AI solutions.Gerry and Zhichao will be delivering a presentation to discuss the implementation of a reinforcement learning AI solution that LIGHTSPEED STUDIOS is incorporating into an FPS game. This solution requires minimal human replay to create training data and has been demonstrated to be more efficient than imitation learning AI solution. The reinforcement learning AI proves to have a win rate that surpasses 90% when pitted against behavioral tree AI, and its performance throughout the game has been highly acclaimed by game developers.",
            "translated": "游戏中的AI是创建FPS游戏的重要因素，因为它可以在包括PVE游戏玩法在内的各种情况下实施，以接管脱节的玩家并填充在线对接服务。这些情况需要高水平的人工智能和类似人类的行为，从而为基于经典规则的AI解决方案带来挑战。Gerry和Zhichao将发表演讲，讨论Lightspeed Studios是强化的学习AI解决方案的实施纳入FPS游戏。该解决方案需要最少的人类重播才能创建训练数据，并且已证明比模仿学习AI解决方案更有效。强化学习AI被证明具有胜利率，在对抗行为树AI时超过90％，并且游戏开发人员在整个游戏中的表现都受到了广泛的好评。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: Multi-agent AI Production of FPS Ga...",
            "author": "Gerry SUN ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029245/LIGHTSPEED-STUDIOS-Developer-Summit-Multi",
            "index": 299,
            "overview": "In-game AI is a vital element in the creation of FPS games, as it can be implemented in various situations including PVE gameplay, to take over for disconnected players, and populate online matchmaking services. These circumstances necessitate a high level of both AI power and human-like behavior, thus creating a challenge for classical rule-based AI solutions.Gerry and Zhichao will be delivering a presentation to discuss the implementation of a reinforcement learning AI solution that LIGHTSPEED STUDIOS is incorporating into an FPS game. This solution requires minimal human replay to create training data and has been demonstrated to be more efficient than imitation learning AI solution. The reinforcement learning AI proves to have a win rate that surpasses 90% when pitted against behavioral tree AI, and its performance throughout the game has been highly acclaimed by game developers.",
            "translated": "游戏中的AI是创建FPS游戏的重要因素，因为它可以在包括PVE游戏玩法在内的各种情况下实施，以接管脱节的玩家并填充在线对接服务。这些情况需要高水平的人工智能和类似人类的行为，从而为基于经典规则的AI解决方案带来挑战。Gerry和Zhichao将发表演讲，讨论Lightspeed Studios是强化的学习AI解决方案的实施纳入FPS游戏。该解决方案需要最少的人类重播才能创建训练数据，并且已证明比模仿学习AI解决方案更有效。强化学习AI被证明具有胜利率，在对抗行为树AI时超过90％，并且游戏开发人员在整个游戏中的表现都受到了广泛的好评。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: The Use of AI-Powered Technology in...",
            "author": "Xin Wang ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029370/LIGHTSPEED-STUDIOS-Developer-Summit-The",
            "index": 302,
            "overview": "This presentation will examine how AI-powered technology is deployed in digitizing content and optimizing the UGC gaming experience. The YAO system will be introduced and discussed, as to how it can live stream a basketball game in a virtual world without markers or specific scenario requirements. Additionally, this presentation will explore the issue of existing user-generated content (UGC) games, which feature a range of editors allowing players to create their own scenes and game objects but do not provide a convenient method of replicating objects and scenes from their real lives. This presentation will address the product ideas, related works, advantages and uniqueness of YAO, and essential technologies used in the research and development process. It'll also cover image-based object and scene generation, which would enable players to directly import images from their real lives into the UGC game.",
            "translated": "本演讲将研究如何在数字化内容和优化UGC游戏体验中部署AI驱动的技术。将介绍和讨论YAO系统，以了解它如何在没有标记或特定场景要求的情况下在虚拟世界中播放篮球游戏。此外，本演示文稿将探讨现有的用户生成内容（UGC）游戏的问题，该游戏具有一系列编辑器，允许玩家创建自己的场景和游戏对象，但不提供从其真实中复制对象和场景的方便方法生命。本演讲将解决YAO的产品思想，相关作品，优势和独特性，以及在研发过程中使用的基本技术。它还将涵盖基于图像的对象和场景的生成，这将使玩家能够将图像直接从现实生活中导入UGC游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "LIGHTSPEED STUDIOS Developer Summit: The Use of AI-Powered Technology in...",
            "author": "Xin Wang ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028873/LIGHTSPEED-STUDIOS-Developer-Summit-The",
            "index": 303,
            "overview": "This presentation will examine how AI-powered technology is deployed in digitizing content and optimizing the UGC gaming experience. The YAO system will be introduced and discussed, as to how it can live stream a basketball game in a virtual world without markers or specific scenario requirements. Additionally, this presentation will explore the issue of existing user-generated content (UGC) games, which feature a range of editors allowing players to create their own scenes and game objects but do not provide a convenient method of replicating objects and scenes from their real lives. This presentation will address the product ideas, related works, advantages and uniqueness of YAO, and essential technologies used in the research and development process. It'll also cover image-based object and scene generation, which would enable players to directly import images from their real lives into the UGC game.",
            "translated": "本演讲将研究如何在数字化内容和优化UGC游戏体验中部署AI驱动的技术。将介绍和讨论YAO系统，以了解它如何在没有标记或特定场景要求的情况下在虚拟世界中播放篮球游戏。此外，本演示文稿将探讨现有的用户生成内容（UGC）游戏的问题，该游戏具有一系列编辑器，允许玩家创建自己的场景和游戏对象，但不提供从其真实中复制对象和场景的方便方法生命。本演讲将解决YAO的产品思想，相关作品，优势和独特性，以及在研发过程中使用的基本技术。它还将涵盖基于图像的对象和场景的生成，这将使玩家能够将图像直接从现实生活中导入UGC游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Modernizing Rendering at Supercell",
            "author": "Timo Heinpurola ",
            "organization": "Supercell",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028820/Modernizing-Rendering-at",
            "index": 320,
            "overview": "This presentation will give attendees a view into the process of implementing a new core rendering framework at Supercell, and walk them through the steps of modifying their existing billion-dollar games, such as Clash of Clans, to use the new system. The project was successfully completed with limited resources over two and a half years, with minimal disruption to the existing player baseand it was motivated both by the need to support the Metal graphics API, but also to prepare for the next decade of game development at Supercell. Attendees will hear about the motivations behind the project as well as the actual process of implementing the new system. The presentation will also explain how the culture of independence and trust at Supercell enabled the efficient execution of the project.",
            "translated": "本演示文稿将使与会者了解在SuperCell实施新的核心渲染框架的过程，并介绍修改其现有的十亿美元游戏（例如Clash of Clash of Clash of Clash）的步骤，以使用新系统。该项目成功完成了两年半的资源有限的资源，而对现有玩家Baseand的中断最小，这两者都受到支持金属图形API的动力，但也准备为Supercell的接下来的游戏开发做准备。与会者将听到有关项目背后的动机以及实施新系统的实际过程。演讲还将解释超级电池独立和信任的文化如何使项目有效执行。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Modernizing Rendering at Supercell",
            "author": "Timo Heinpurola ",
            "organization": "Supercell",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029242/Modernizing-Rendering-at",
            "index": 321,
            "overview": "This presentation will give attendees a view into the process of implementing a new core rendering framework at Supercell, and walk them through the steps of modifying their existing billion-dollar games, such as Clash of Clans, to use the new system. The project was successfully completed with limited resources over two and a half years, with minimal disruption to the existing player baseand it was motivated both by the need to support the Metal graphics API, but also to prepare for the next decade of game development at Supercell. Attendees will hear about the motivations behind the project as well as the actual process of implementing the new system. The presentation will also explain how the culture of independence and trust at Supercell enabled the efficient execution of the project.",
            "translated": "本演示文稿将使与会者了解在SuperCell实施新的核心渲染框架的过程，并介绍修改其现有的十亿美元游戏（例如Clash of Clash of Clash of Clash）的步骤，以使用新系统。该项目成功完成了两年半的资源有限的资源，而对现有玩家Baseand的中断最小，这两者都受到支持金属图形API的动力，但也准备为Supercell的接下来的游戏开发做准备。与会者将听到有关项目背后的动机以及实施新系统的实际过程。演讲还将解释超级电池独立和信任的文化如何使项目有效执行。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Motion Tracking Meets AI, Creating a New Category of Games (Presented by...",
            "author": "David Lee ",
            "organization": "Nex",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029435/Motion-Tracking-Meets-AI-Creating",
            "index": 322,
            "overview": "Full-body motion capture used to require special sensors and green rooms. Now it can be done in real-time with any simple smartphone camera and the power of AI systems. This talk will explore new tools from Nex that make full-body motion tracking something any game developer can leverageopening up a new world of immersive motion-based experiences.",
            "translated": "全身运动捕获用于需要特殊的传感器和绿色房间。现在，可以使用任何简单的智能手机摄像头和AI系统的功能实时完成。这次演讲将探索NEX的新工具，该工具使全身运动跟踪任何游戏开发人员都可以利用新的基于运动的经验的新世界。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Picking a Good Spot: Naughty Dog's Post System",
            "author": "Ming-Lun \"Allen\" Chou ",
            "organization": "Naughty Dog",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029277/Picking-a-Good-Spot-Naughty",
            "index": 341,
            "overview": "In this talk, Game Programmer Ming-Lun \"Allen\" Chou will present Naughty Dog's post system and its evolution over time. A post is a spot in the game world, picked for general gameplay purposes. It can be an NPC's destination, a place to spawn objects, or a point of interest to look at. Where can a post be placed? How is a good post picked? How to do it efficiently? This talk will go over several implementations and their performance characteristics.",
            "translated": "在这次演讲中，游戏程序员Ming-Lun“ Allen” Chou将随着时间的流逝而呈现顽皮的狗的邮政系统及其演变。帖子是游戏世界中的一个地方，被选为一般游戏目的。它可以是NPC的目的地，产卵对象的地方或值得关注的点。帖子可以放在哪里？一个好帖子如何选择？如何有效地进行？这次演讲将介绍多个实施及其性能特征。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Picking a Good Spot: Naughty Dog's Post System",
            "author": "Ming-Lun \"Allen\" Chou ",
            "organization": "Naughty Dog",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028831/Picking-a-Good-Spot-Naughty",
            "index": 342,
            "overview": "In this talk, Game Programmer Ming-Lun \"Allen\" Chou will present Naughty Dog's post system and its evolution over time. A post is a spot in the game world, picked for general gameplay purposes. It can be an NPC's destination, a place to spawn objects, or a point of interest to look at. Where can a post be placed? How is a good post picked? How to do it efficiently? This talk will go over several implementations and their performance characteristics.",
            "translated": "在这次演讲中，游戏程序员Ming-Lun“ Allen” Chou将随着时间的流逝而呈现顽皮的狗的邮政系统及其演变。帖子是游戏世界中的一个地方，被选为一般游戏目的。它可以是NPC的目的地，产卵对象的地方或值得关注的点。帖子可以放在哪里？一个好帖子如何选择？如何有效地进行？这次演讲将介绍多个实施及其性能特征。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Practical High-Performance Rendering On Mobile Platforms",
            "author": "Xiaoxin Guo ",
            "organization": "Tencent Holdings Ltd",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029284/Practical-High-Performance-Rendering-On",
            "index": 350,
            "overview": "Rendering in Honor of Kings (HOK) is very challenging in terms of hardware compatibility and performance. The target hardware ranges from entry-level phones to the latest model. In addition, the team has to support more than 100-million daily active users without sacrificing the core experience. In this presentation, Xiaoxin Guo, Senior Rendering Engineer at Tencent Holdings Ltd, will dive into the shading pipeline in detail and propose several optimizations that helped them ship their game at 1080p 60fps, and target various hardware specifications.",
            "translated": "在硬件兼容性和性能方面，以纪念国王（HOK）的渲染非常具有挑战性。目标硬件的范围从入门级电话到最新型号。此外，团队必须在不牺牲核心体验的情况下支持超过1亿个活跃用户。在本演讲中，Tencent Holdings Ltd的高级渲染工程师Xiaoxin Guo将详细介绍阴影管道，并提出了几种优化，这些优化帮助他们以1080p 60fps运送游戏，并针对各种硬件规格。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Practical High-Performance Rendering On Mobile Platforms",
            "author": "Xiaoxin Guo ",
            "organization": "Tencent Holdings Ltd",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028837/Practical-High-Performance-Rendering-On",
            "index": 351,
            "overview": "Rendering in Honor of Kings (HOK) is very challenging in terms of hardware compatibility and performance. The target hardware ranges from entry-level phones to the latest model. In addition, the team has to support more than 100-million daily active users without sacrificing the core experience. In this presentation, Xiaoxin Guo, Senior Rendering Engineer at Tencent Holdings Ltd, will dive into the shading pipeline in detail and propose several optimizations that helped them ship their game at 1080p 60fps, and target various hardware specifications.",
            "translated": "在硬件兼容性和性能方面，以纪念国王（HOK）的渲染非常具有挑战性。目标硬件的范围从入门级电话到最新型号。此外，团队必须在不牺牲核心体验的情况下支持超过1亿个活跃用户。在本演讲中，Tencent Holdings Ltd的高级渲染工程师Xiaoxin Guo将详细介绍阴影管道，并提出了几种优化，这些优化帮助他们以1080p 60fps运送游戏，并针对各种硬件规格。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Preparing AI Systems for 'God of War Ragnarok'",
            "author": "Goksu Ugur ",
            "organization": "Santa Monica Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028840/Preparing-AI-Systems-for-God",
            "index": 353,
            "overview": "More enemy variety, more companions, a more-lived world with a lot more characters and wildlife: The AI team had their work cut out for them as the studio transitioned into creating the sequel for God of War (2018). This talk goes into multiple AI systems that were either implemented from scratch or improved massively based on the needs of the new game. Specific topics include the challenges and problems solved while migrating engineering and design teams to using behavior trees instead of Lua scripting, systems implemented to give AI more awareness about their surroundings and the new enhanced movement in vertical combat spaces.",
            "translated": "更多的敌人品种，更多的伴侣，一个更具角色和野生动植物的世界：AI团队为他们完成了工作，因为工作室过渡到为《战神》创作续集（2018年）。这次演讲进入了多个AI系统，这些系统是根据新游戏的需求从头开始实施的，或者大规模改进的。具体的主题包括在迁移工程和设计团队使用行为树而不是Lua脚本的同时解决的挑战和问题，实施的系统以使AI对周围环境有更多的认识以及在垂直战斗空间中的新增强运动。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Pushing the Boundaries of Immersive Worlds (Presented by Roblox)",
            "author": "Jad Boniface ",
            "organization": "Roblox",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029296/Pushing-the-Boundaries-of-Immersive",
            "index": 357,
            "overview": "Meet RocketRide, Maximillian Studios, Metaverse Team, and Copper four studios who are experimenting with next-gen tech and strategies to push the boundaries of what exists on Roblox. From the visually breathtaking environments in Frontlines to intense scares in the survival horror games in development by RocketRide and the Metaverse Team to creating unique looks & styles in Fashion Klossette, it is clear the opportunity for high-fidelity creation on Roblox is vast. In this session, Jad Boniface, Head of Community Expansion at Roblox, will lead a panel discussion with the creators behind these studios to provide a sneak peek into exceptional high-fidelity experiences, tips on how to build for the gamer of the future and how they're building global businesses. Roblox offers the opportunity to reach an engaged community of 60M daily active users across the globe, and the users are all ages with the fastest growing age group of 17-24 year olds. Our platform provides you with unparalleled opportunities for innovative 3D creation, with instantaneous publishing across all popular platforms and multiple languages. We empower developers to build high-fidelity, megascale, lifelike worlds, and to do it on a broad, open API-first cloud platform with free tools.",
            "translated": "与Rocketride，Maximillian Studios，Metaverse Team和Copper四个工作室会面，他们正在尝试下一代技术和策略，以突破Roblox上现有的界限。从前线的视觉令人叹为观止的环境到Rocketride和Metaverse团队开发的生存恐怖游戏的强烈恐惧，再到创造时尚克洛塞特（Klossette）的独特外观和风格，很明显，在Roblox上创造高保真的机会是广阔的机会。在本次会议上，Roblox社区扩展负责人Jad Boniface将与这些工作室背后的创作者进行小组讨论，以提供偷偷摸摸的高保真体验，这是如何为未来游戏玩家构建的技巧他们正在建立全球业务。Roblox提供了一个机会，可以吸引全球6000万活跃用户的敬业社区，并且用户都是年龄段的年龄最快的17-24岁年龄段。我们的平台为您提供了无与伦比的创新3D创建机会，并在所有流行的平台和多种语言中都有瞬时发布。我们使开发人员能够建立高保真性，Megascale，栩栩如生的世界，并在具有免费工具的广阔，开放的API-First云平台上进行。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "REVOLUTIONIZING GAME ASSET LOADING WITH IPFS (Presented by Protocol Labs)",
            "author": "Adam Grodzki ",
            "organization": "3S Game Studio OU",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029300/REVOLUTIONIZING-GAME-ASSET-LOADING-WITH",
            "index": 363,
            "overview": "The speaker will present a new approach to loading game assets using dynamic download and chunk loading with the p2p IPFS (Interplanetary File System) protocol. They will explain how this approach can significantly improve the player experience by reducing load times and enabling faster downloads, as well as streamlining the distribution of DLC, mods, and updates. The speaker will also describe how the entire process of creating and managing game assets can be automated, from generating a manifest of .pak files to tracking the progress of downloads and enabling hot reloads. Attendees will gain a deep understanding of the benefits of using IPFS for game asset loading, as well as practical tips for implementing this approach in their own game development projects.",
            "translated": "扬声器将使用P2P IPFS（星际文件间文件系统）协议的动态下载和块加载来提出一种新的方法来加载游戏资产。他们将解释这种方法如何通过减少加载时间和更快的下载速度以及简化DLC，mod和更新的分布来显着改善玩家体验。扬声器还将描述如何自动创建和管理游戏资产的整个过程，从生成.pak文件的清单到跟踪下载的进度并启用热加载。与会者将深入了解将IPF用于游戏资产加载的好处，以及在自己的游戏开发项目中实施这种方法的实用技巧。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Revolutionizing Game Development: Introducing Remngu (Presented by Remngu)",
            "author": "Jan Sechovec ",
            "organization": "Remngu",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029301/Revolutionizing-Game-Development-Introducing-Remngu",
            "index": 364,
            "overview": "Learn how to attract and retain remote talent, collaborate effectively, and use state-of-the-art technologies with cloud-based game development using the Remngu platform. Hear success stories and see demos of the platform in action.",
            "translated": "了解如何使用Remngu平台来吸引和保留远程人才，有效协作，并使用基于云的游戏开发的最先进技术。聆听成功案例，并查看平台的演示。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Roblox Engine: Developing on a Platform that Powers 32M Immersive Experi...",
            "author": "Bjorn Book-Larsson ",
            "organization": "Roblox",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029302/Roblox-Engine-Developing-on-a",
            "index": 365,
            "overview": "Meet Chris Haga, President, Looty Games; Jessica Weiss Thomas, Art Director, Sawhorse Productions; Michael Daubert, CEO, Phaser Lock Interactive; and Spencer Arons, Lead Programmer, Rodeo Interactive developers who have found success leveraging the latest Roblox free cloud-based technologies to build high fidelity experiences with strong discoverability and monetization. In this session, Bjorn Book-Larsson, VP of Product, Avatar at Roblox, will lead a panel discussion exploring the tools and features on the Roblox platform critical for success.Roblox offers the opportunity to reach an engaged community of 60M daily active users across the globe, and the users are all ages with the fastest growing age group of 17-24 year olds. Our platform provides you with unparalleled opportunities for innovative 3D creation, with instantaneous publishing across all popular platforms and multiple languages. We empower developers to build high-fidelity, megascale, lifelike worlds, and to do it on a broad, open API-first cloud platform with free tools.",
            "translated": "认识掠夺游戏总裁克里斯·哈加（Chris Haga）；Sawhorse Productions艺术总监Jessica Weiss Thomas；Phaser Lock Interactive首席执行官Michael Daubert；首席程序员，Rodeo Interactive开发人员Spencer Arons发现了成功的最新基于Roblox的基于Roblox的技术，以建立具有强大的发现性和货币化的高保真体验。在本次会议上，Roblox的Avatar副总裁Bjorn Book-Larsson将领导小组讨论，探索Roblox平台上的工具和功能至关重要的工具和功能。全球和用户都是年龄段的年龄最快的17-24岁年龄段。我们的平台为您提供了无与伦比的创新3D创建机会，并在所有流行的平台和多种语言中都有瞬时发布。我们使开发人员能够建立高保真性，Megascale，栩栩如生的世界，并在具有免费工具的广阔，开放的API-First云平台上进行。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Scaling Tools for Millions of Assets for 'Horizon Forbidden West'",
            "author": "David Marcelis ",
            "organization": "Guerrilla",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028848/Scaling-Tools-for-Millions-of",
            "index": 368,
            "overview": "Horizon Forbidden West is Guerrilla's biggest game to date. Keeping up with the rapidly increasing size of the content required significant improvements to our tooling. This talk will explain how we redesigned the asset database and content loading in the Decima engine to scale to millions of files. These new tools are so powerful that it fundamentally changed the way we work with content at scale. By streaming all content from a single server and maintaining metadata of all assets in memory we can make sure our editor, game and other tools remain performant and responsive while working with huge numbers of assets. This led to a solution where we can work on the game without needing to read any files.",
            "translated": "Horizo​​n Forbidden West是迄今为止游击队最大的比赛。跟上内容迅速增加的内容需要对我们的工具进行重大改进。本演讲将解释我们如何重新设计Decima引擎中的资产数据库和内容加载，以扩展到数百万个文件。这些新工具非常强大，以至于从根本上改变了我们与内容的合作方式。通过从单个服务器中流式传输所有内容并维护内存中所有资产的元数据，我们可以确保我们的编辑器，游戏和其他工具在使用大量资产时保持性能和响应速度。这导致了一个解决方案，我们可以在其中进行游戏，而无需读取任何文件。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Space-Efficient Content Packaging for 'Horizon Forbidden West'",
            "author": "Jan-Jaap Fahner ",
            "organization": "Guerrilla B.V.",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028855/Space-Efficient-Content-Packaging-for",
            "index": 374,
            "overview": "Horizon Forbidden West presents a complex challenge of packaging and loading massive quantities of game content. In this session, Jan-Jaap Fahner, Principal Tech Programmer at Guerrilla B.V., presents an algorithm for deterministically analyzing the graph of game content to generate space-efficient content packages, allowing for any combination of content to be loaded and unloaded at any time with a minimal number of read operations. The process is fully automatic and requires no modification of artists' workflow or content setup.Jan-Jaap will also present techniques for incremental graph update during content development, and discuss the tradeoff of on-disk data duplication for faster load times.",
            "translated": "Horizo​​n Forbidden West提出了包装和加载大量游戏内容的复杂挑战。在本次会议上，游击队B.V.首席技术程序员Jan-Jaap Fahner提出了一种算法，用于确定性分析游戏内容的图表，以生成空间有效的内容内容，从而可以随时加载和卸载内容组合读取操作数量最少。该过程是完全自动的，不需要修改艺术家的工作流程或内容设置。JAN-JAAP还将在内容开发过程中提出用于增量图更新的技术，并讨论盘式数据重复的权衡，以获得更快的负载时间。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Spicy Sauce -The Secret Ingredient to Gaming DevOps (Presented by Sauce ...",
            "author": "Mac Clark ",
            "organization": "Sauce Labs",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029312/Spicy-Sauce-The-Secret-Ingredient",
            "index": 375,
            "overview": "You know what is hot? Saving time and money in making the highest quality video games on the planet. Delivering bug free game titles is a win for your customers, your brand and your all important game ratings. Join Mac Clark as they dive into the Sauce Labs DevOps Toolchain for mobile, pc and console gaming. He will be covering Sauce Labs' Real Device Cloud, supported testing frameworks and CI/CD pipeline synergy needs. Lastly, he will cover how SauceLabs' Backtrace uses crash and error reporting during development and production to provide developers the CI/CD backbone they need.",
            "translated": "你知道什么是热吗？节省时间和金钱，在地球上制作最高质量的视频游戏。提供免费的游戏标题是您的客户，品牌以及所有重要的游戏评分的胜利。加入MAC Clark，当他们潜入用于移动，PC和控制台游戏的Sauce Labs Devops工具链中。他将涵盖Sauce Labs的真实设备云，支持的测试框架和CI/CD管道协同效应需求。最后，他将介绍Saucelabs的回溯如何使用开发和生产过程中的崩溃和错误报告，以向开发人员提供所需的CI/CD骨干。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tencent Games Developer Summit: Building A Digital Great Wall with A New...",
            "author": "Yingpeng ZHANG ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028729/Tencent-Games-Developer-Summit-Building",
            "index": 390,
            "overview": "We come from the Common R&D and Operation System (CROS) of Tencent Interactive Entertainment Group. We are committed to developing a lightweight, modulable, and flexible in-house engine with high-end graphics and next-generation features such as GPU-Driven Pipeline, Virtual Geometry, and Global Illumination.nIn this session, we will introduce how to use our engine to achieve a very high-quality rendering in the \"Digital Greatwall\" with a large-scale and high-definition natural environment. We will introduce our breakthroughs in massive dynamic light source rendering, GPU-Driven Vegetation rendering, large-world shadow solution, and Dynamic global illumination.",
            "translated": "我们来自Tencent Interactive Entertainment Group的常见研发和操作系统（CRO）。我们致力于开发具有高端图形和下一代功能（例如GPU驱动的管道，虚拟几何图形和全球照明）的轻质，可调节和灵活的内部引擎。我们将介绍如何使用，我们将介绍如何使用我们的引擎在具有大规模和高清自然环境的“数字大衣”中实现非常高质量的渲染。我们将介绍大量动态光源渲染，GPU驱动的植被渲染，大世界阴影解决方案和动态全球照明中的突破。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tencent Games Developer Summit: Building A Digital Great Wall with A New...",
            "author": "Yingpeng ZHANG ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028976/Tencent-Games-Developer-Summit-Building",
            "index": 391,
            "overview": "We come from the Common R&D and Operation System (CROS) of Tencent Interactive Entertainment Group. We are committed to developing a lightweight, modulable, and flexible in-house engine with high-end graphics and next-generation features such as GPU-Driven Pipeline, Virtual Geometry, and Global Illumination.nIn this session, we will introduce how to use our engine to achieve a very high-quality rendering in the \"Digital Greatwall\" with a large-scale and high-definition natural environment. We will introduce our breakthroughs in massive dynamic light source rendering, GPU-Driven Vegetation rendering, large-world shadow solution, and Dynamic global illumination.",
            "translated": "我们来自Tencent Interactive Entertainment Group的常见研发和操作系统（CRO）。我们致力于开发具有高端图形和下一代功能（例如GPU驱动的管道，虚拟几何图形和全球照明）的轻质，可调节和灵活的内部引擎。我们将介绍如何使用，我们将介绍如何使用我们的引擎在具有大规模和高清自然环境的“数字大衣”中实现非常高质量的渲染。我们将介绍大量动态光源渲染，GPU驱动的植被渲染，大世界阴影解决方案和动态全球照明中的突破。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Character Rendering Art of 'The Callisto Protocol'",
            "author": "Jorge Jimenez ",
            "organization": "Striking Distance Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029339/The-Character-Rendering-Art-of",
            "index": 398,
            "overview": "In this session, Jorge Jimenez, Glauco Longhi, and Martin Contel will cover how art and technology worked as one in the pursuit of photorealism for The Callisto Protocol. This encompasses a journey of discovering the process of achieving photorealism through an unconventional philosophical approach. A journey of humbleness, persistence and faith.They will present advances to accurately render faces under varied lighting setups, solving the lighting not for a best-case scenario but across many of them. This will be presented within the framework of the observations made from controlled light stage photography reference.It will discuss the elements required to translate photorealistic results from a controlled environment into a live running game, on current generation consoles. They will also cover how they made competing priorities like art direction and photorealism to collaborate together.The talk will emphasize building on top of state of the art, technology and beliefs, and expanding on the required elements to cross the boundaries of photorealism.",
            "translated": "在本次会议上，豪尔赫·希门尼斯（Jorge Jimenez），格拉科·朗吉（Glauco Longhi）和马丁·帕特尔（Martin Contel）将涵盖艺术和技术如何作为追求卡利斯托协议的光真实主义的一种。这涵盖了通过非常规哲学方法发现光真相的过程的旅程。谦虚，毅力和信仰的旅程。他们将提出进步，以准确地在各种照明设置下呈现面孔，而不是为最佳情况而是在许多情况下解决照明。这将在由受控光级摄影参考的观察结果的框架内提出。它将讨论将受控环境转化为现场运行游戏所需的元素，并在当前一代游戏机上进行实时运行。他们还将涵盖他们如何将艺术指导和摄影现实主义等竞争优先级合作进行合作。谈话将强调建立在最新的，技术和信念的状态，并扩大所需的要素以跨越光真实主义的边界。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Thousands of Soldiers Battle on One Mobile Screen: Applications of Unity...",
            "author": "Jian Xiao ",
            "organization": "Tencent",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028877/Thousands-of-Soldiers-Battle-on",
            "index": 425,
            "overview": "\"Return to Empire\" is a 3D massively multiplayer online strategy mobile game developed by TiMi Studio Group. Strategy games often face the demand for large-scale battles with thousands of people on the same screen. At this time, the performance of mobile phones becomes a bottleneck. As a high-quality full 3D strategy mobile game, \"Return to Empire\" faces even more difficult problems. After continuous research and development iterations, \"Return to Empire\" based on the application and practice of the Unity DOTS technology stack, finally achieved very good game effects and performance, and established a quality benchmark for SLG mobile games in large-scale battles.We have accumulated rich research and development experience in the practice of DOTS, and have formed a set of effective practical experience for data abstraction, task parallelism, and logic splitting. We looked at how to better leverage multiple CPU cores and decouple them across multiple tasks. We combined with RenderMeshV2 to optimize the rendering. A set of efficient tools has also been accumulated for the workflow of art assets. I believe that these technologies can be very well applied to other games of the same genre, not just SLG games, but also all large-scale computing places. The potential usage scenarios of this technical solution are very broad.",
            "translated": "“返回帝国”是由Timi Studio Group开发的3D大型多人在线策略手机游戏。策略游戏通常面临着在同一屏幕上与成千上万的人进行大规模战斗的需求。目前，手机的性能变成了瓶颈。作为高质量的完整3D策略手机游戏，“返回帝国”面临更困难的问题。经过持续的研发迭代后，“返回帝国”基于Unity Dots Technology Stack的应用和实践，最终取得了很好的游戏效果和性能，并在大规模战斗中建立了SLG移动游戏的优质基准。已经积累了丰富的研究和发展经验，并在DOT的实践中积累了一系列有效的实践经验，用于数据抽象，任务并行性和逻辑分裂。我们研究了如何更好地利用多个CPU内核并将它们跨多个任务解散。我们与rendermeshv2结合使用以优化渲染。对于艺术品资产的工作流程，也积累了一组有效的工具。我相信这些技术可以很好地应用于其他类型的其他游戏，而不仅仅是SLG游戏，还可以很好地应用于所有大型计算场所。该技术解决方案的潜在用法方案非常广泛。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "UI Engineering Patterns from 'Marvel's Midnight Suns'",
            "author": "Joel Gonzales ",
            "organization": "Turtle Rock Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028880/UI-Engineering-Patterns-from-Marvel",
            "index": 433,
            "overview": "No longer just for HUDs, User Interfaces in modern games cover everything from inventory to social interactions. With so much UI now required outside of the core game loop, new techniques are needed to handle the growing demand on UI. This talk covers the implementation of the UI architecture used in Marvel: Midnight Suns, how its approach allowed the team to create the breadth of screens the game requires and shared functionality by reducing the complexity of UI creation.",
            "translated": "现代游戏中的用户界面不再仅仅用于HUD，涵盖了从库存到社交互动的所有内容。现在，在核心游戏循环之外需要的UI如此之多，因此需要新的技术来应对对UI的不断增长的需求。本演讲涵盖了Marvel：Midnight Suns中使用的UI体系结构的实现，其方法如何使团队能够通过降低UI创建的复杂性来创建游戏所需的屏幕广度和共享功能。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Building and Operating a Live Game with Unity Ga...",
            "author": "Joshua Ostrander ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029389/Unity-Developer-Summit-Building-and",
            "index": 436,
            "overview": "Unity Gaming Services (UGS) is a cohesive development platform that empowers developers to build their live games using the tech stack and engine of their choice. This session walks through practical examples of using UGS to run live games to demonstrate the platform's flexibility. It covers integration points, including API patterns, data flow for player data and game content, and rich analytics to measure performance.",
            "translated": "Unity Gaming Services（UGS）是一个具有凝聚力的开发平台，它使开发人员能够使用他们选择的技术堆栈和引擎来构建现场游戏。本届会议介绍了使用UGS运行现场游戏以展示平台灵活性的实践示例。它涵盖了集成点，包括API模式，玩家数据和游戏内容的数据流以及衡量性能的丰富分析。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Create, Launch, and Manage Multiplayer Games wit...",
            "author": "Laurent Gibert ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029390/Unity-Developer-Summit-Create-Launch",
            "index": 437,
            "overview": "Learn how to create amazing multiplayer experiences for your players. The Unity multiplayer team will walk you through how to start creating multiplayer experiences, and discuss features that accelerate complex creations, including matchmaking, leaderboards, and massively multiplayer online experiences. Check out Netcode for GameObjects and Entities, samples and guides for multiple genres (including co-op and competitive action games), and Unity Gaming Services for managing players' online experience.",
            "translated": "了解如何为球员创造出色的多人游戏体验。Unity多人游戏团队将引导您介绍如何开始创建多人游戏体验，并讨论加速复杂创作的功能，包括对接，排行榜和大量的多人在线体验。查看NetCode的游戏对象和实体，样本和指南，以获取多种流派（包括合作社和竞争性动作游戏），以及用于管理玩家在线体验的Unity Gaming Services。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Multiplatform Performance: Overcoming Technical ...",
            "author": "Michael Lee ",
            "organization": "Schell Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029393/Unity-Developer-Summit-Multiplatform-Performance",
            "index": 440,
            "overview": "There's no straight line to building a multiplatform game, but with the right approach and performance in mind, you can reach bigger audiences with Unity. Learn best practices for building multiplatform titles spanning mobile to console, and learn from Schell Games in a discussion about bringing Among Us from PC to VR.",
            "translated": "构建多平台游戏没有直线，但是考虑到正确的方法和性能，您可以以团结来吸引更大的受众。学习构建跨越移动设备的乘数型游戏的最佳实践，并从Schell Games中学习有关从PC到VR的讨论中的讨论。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: Technical Tips for Every Stage of Game Creation ...",
            "author": "Will Armstrong ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029394/Unity-Developer-Summit-Technical-Tips",
            "index": 441,
            "overview": "In this session, you'll learn how to boost your productivity in Unity at every stage of the game development lifecycle. From early prototyping to scaling to deployment, see how you can get the most out of tools like source control and profiling to identify performance opportunities and ship a truly awesome game. All tips shared in this session are pulled from actual projects delivered by our team of experts.",
            "translated": "在本次会议中，您将学习如何在游戏开发生命周期的每个阶段以团结提高生产力。从早期的原型到扩展到部署，请查看如何从源控制和分析等工具中获得最大的收益，以识别性能机会并运送真正的很棒的游戏。本课程中共享的所有提示都是从我们的专家团队提供的实际项目中提取的。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unity Developer Summit: The Unity Roadmap for 2023 (Presented by Unity T...",
            "author": "Andrew Bowell ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029396/Unity-Developer-Summit-The-Unity",
            "index": 443,
            "overview": "Learn what's new and upcoming in Unity's 2022 LTS and 2023 Tech Stream, including all the latest on graphics, multiplayer games, and the Entity Component System (ECS). Discover how Unity lets you leverage the latest platform features across mobile, desktop/web, and XR. See how you can leverage the power of Unity's DevOps and Wt Tools (Ziva, Speedtree) through the Editor.",
            "translated": "了解Unity的2022 LTS和2023 Tech流中的新功能和即将到来的内容，包括所有最新的图形，多人游戏和实体组件系统（ECS）。查找Unity如何使您在移动，台式/Web和XR上利用最新的平台功能。查看如何通过编辑器来利用Unity DevOps和WT工具（Ziva，Speedtree）的功能。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Unraveling the Mystery of a Thriving Game Codebase: What You Didn't Know...",
            "author": "Dan Danciu ",
            "organization": "Endava",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029401/Unraveling-the-Mystery-of-a",
            "index": 449,
            "overview": "Software systems are like a box of chocolates. \"You never know what you're gonna get.\" In this session, we will introduce a new, mind-boggling tool-driven technique for revealing the traits and risks of large software systems. Our approach is a comprehensive radiography of the entire system. Besides the static analysis of source code, we also intake the evolution history from the source-control and the issue-tracking systems. When we look at all these together, we identify significant threats that are not directly perceptible in the code, like subtle cross-technology dependencies, components tedious to implement and change, or poor distribution of project knowledge across developers. Over time we examined 200+ systems and about half a billion lines of code. To showcase our approach to software assessment, we will go through the insights we gained while conducting an in-depth review of a gaming company that was mid-journey into becoming a modern technology and data-driven.",
            "translated": "软件系统就像一盒巧克力。“你永远不知道你会得到什么。”在本届会议中，我们将介绍一种新的，令人难以置信的工具驱动的技术，用于揭示大型软件系统的特征和风险。我们的方法是整个系统的全面射线照相。除了对源代码的静态分析外，我们还从源控制和问题跟踪系统中摄入了演变历史记录。当我们一起查看所有这些时，我们会发现在代码中不直接感知到的重大威胁，例如微妙的跨技术依赖性，繁琐的实施和更改的组成部分，或者在开发人员跨开发人员之间的项目知识分布不佳。随着时间的流逝，我们检查了200多个系统和大约十亿条代码。为了展示我们的软件评估方法，我们将在对一家游戏公司进行深入审查时，在朱尼中期成为现代技术和数据驱动的一家游戏公司进行深入评论。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Using Vertices Over Pixels: Achieving Cartoon Graphics on Standalone VR",
            "author": "Stefan Hell ",
            "organization": "Salmi Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029404/Using-Vertices-Over-Pixels-Achieving",
            "index": 450,
            "overview": "Faced with the challenges of standing out on the constrained hardware of the Oculus Quest 1, Salmi Games created a highly stylized cartoon look for their game Sweet Surrender. Stefan Hell, Lead Programmer at Salmi Games, will share detailed insights into their novel solution to drawing outlines and inlines on objects in a highly performant way, avoiding post-processing effects and work-intensive hand-painted textures.Along the way, Stefan will explore the major existing comic-shaded solutions and their various trade-offs. He will also detail the various constraints one faces when developing for hardware-constrained platforms like standalone VR and the importance of designing for your target hardware from Day 1.",
            "translated": "面对在Oculus Quest 1的约束硬件上脱颖而出的挑战，Salmi Games为他们的游戏Sweet Surrender创造了高度风格化的卡通外观。Salmi Games的首席程序员Stefan Hell将分享其新颖的见解，以表现出色的方式，以高表现的方式绘制对象的轮廓和嵌入式，避免后处理效果以及工作密集型的手绘纹理。探索现有的主要漫画解决方案及其各种权衡。他还将在为硬件受限平台（例如独立VR）开发时所面临的各种限制，以及从第1天开始为目标硬件设计的重要性。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Using Vertices Over Pixels: Achieving Cartoon Graphics on Standalone VR",
            "author": "Stefan Hell ",
            "organization": "Salmi Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028884/Using-Vertices-Over-Pixels-Achieving",
            "index": 451,
            "overview": "Faced with the challenges of standing out on the constrained hardware of the Oculus Quest 1, Salmi Games created a highly stylized cartoon look for their game Sweet Surrender. Stefan Hell, Lead Programmer at Salmi Games, will share detailed insights into their novel solution to drawing outlines and inlines on objects in a highly performant way, avoiding post-processing effects and work-intensive hand-painted textures.Along the way, Stefan will explore the major existing comic-shaded solutions and their various trade-offs. He will also detail the various constraints one faces when developing for hardware-constrained platforms like standalone VR and the importance of designing for your target hardware from Day 1.",
            "translated": "面对在Oculus Quest 1的约束硬件上脱颖而出的挑战，Salmi Games为他们的游戏Sweet Surrender创造了高度风格化的卡通外观。Salmi Games的首席程序员Stefan Hell将分享其新颖的见解，以表现出色的方式，以高表现的方式绘制对象的轮廓和嵌入式，避免后处理效果以及工作密集型的手绘纹理。探索现有的主要漫画解决方案及其各种权衡。他还将在为硬件受限平台（例如独立VR）开发时所面临的各种限制，以及从第1天开始为目标硬件设计的重要性。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: Bring the power of web3 and blockchain to [YOUR GAME] with I...",
            "author": "Nayana Singh ",
            "organization": "ConsenSys",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029446/Web3-Forum-Bring-the-power",
            "index": 464,
            "overview": "The greatest innovations in hardware and software have been spurred by video games. Web3 is no different and Infura is here to reveal the huge opportunity for game developers to connect and build on the blockchain with low-entry. Nayana Singh will be sharing how Infura can accelerate the game development cycle by using Infura and our suite of tools created to enhance your game through NFTs, such as NFT API and SDKs. Whether you're looking for NFT Game Development with Infura's NFT API, decentralized storage with IPFS, or simply looking to facilitate your dev cycle, we're here to help you develop your next game in web3. About Infura: Trusted by 400K+ developers and 50% of the Ethereum network, Infura empowers game developers in web3 by providing a low entry barrier to up to 13 blockchain networks, through its reliable infrastructure and scalable development tools. ",
            "translated": "硬件和软件中最伟大的创新受到视频游戏的刺激。Web3也不相同，Infura在这里揭示了游戏开发人员的巨大机会，可以通过低进入区块链在区块链上进行连接和构建。Nayana Singh将分享Infura如何通过使用Infura和我们创建的工具来加速游戏开发周期，以通过NFT（例如NFT API和SDKS）增强您的游戏。无论您是使用Infura的NFT API，使用IPF的分散存储，还是只是寻求促进您的开发周期，我们都在这里帮助您在Web3中开发下一个游戏。关于Infura：由400K+开发人员和50％的以太坊网络信任，Infura通过其可靠的基础架构和可扩展的开发工具提供了高达13个区块链网络的入口障碍，以赋予Web3中的游戏开发人员。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: Building Great web3 Game Experiences with HyperPlay (Present...",
            "author": "Jacobc.eth - ",
            "organization": "HyperPlay",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1028980/Web3-Forum-Building-Great-web3",
            "index": 465,
            "overview": "Web3 gaming is more than secondary markets for in-game items. Diablo 3 had that over a decade ago, and it didn't need a blockchain to accomplish it. nnThis talk will explore web3 game worlds based on principles of interoperability where assets can be permissionlessly carried across the decentralized web and where gaming universes can be extended by the community. nnThis talk will cover how builders can implement this vision using HyperPlay, a web3-native game launcher and aggregator of game stores. HyperPlay allows players to discover and install any game from the Epic Store, GOG, or HyperPlay's own store, and integrates with MetaMask and WalletConnect for simple in-game transactions, even in native desktop games. Both native desktop games and browser games are supported. Developers can implement in-game transactions, and are free from de-platforming and Apple-tax fees.",
            "translated": "Web3游戏不仅仅是游戏中项目的二级市场。Diablo 3在十年前拥有它，并且它不需要区块链即可完成它。nnthis Talk将基于互操作性原则探索Web3游戏世界，在这些原理中，可以在分散的网络中无权携带资产，并且社区可以扩展游戏宇宙。nnththis Talk将涵盖建筑商如何使用web3-netagity游戏启动器和游戏商店的聚合器Yearplay实施此愿景。Explay允许玩家从Epic Store，GOG或Explay自己的商店中发现并安装任何游戏，并与MetAmask和WalletConnect集成，以进行简单的游戏内交易，甚至在本机桌面游戏中。支持本机桌面游戏和浏览器游戏。开发人员可以实施游戏中的交易，并且不受平台和苹果税费的费用。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: DAOs for Game Developers (Presented by Dacoco GmbH (Alien Wo...",
            "author": "Dallas Johnson ",
            "organization": "Dacoco (Alien Worlds)",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029018/Web3-Forum-DAOs-for-Game",
            "index": 466,
            "overview": "Software development for a blockchain-based dapp/game is all about providing security through decentralisation. This is usually achieved through immutable code in a smart contract. But, as every software dev knows, code will eventually need changes, upgrades and bug fixes. Rather than leaving a security backdoor for software upgrades, we can use the blockchain to host a governing system to control these changes without losing the security provided intrinsically by the blockchain. That system would be a Decentralized Autonomous Organization (DAO). This session explores the goals and challenges from both technical and human perspectives that contribute to building a successful DAO system and how they are utilised as core game components in the Alien Worlds Metaverse to complement existing NFT game mechanics and mining activities within the game.",
            "translated": "基于区块链的DAPP/GAME的软件开发旨在通过权力下放提供安全性。这通常是通过智能合同中的不变代码来实现的。但是，众所周知，代码最终需要更改，升级和错误修复。我们可以使用区块链托管管理系统来控制这些更改而不会失去区块链本质上提供的安全性，而不是为软件升级提供安全后门。该系统将是一个分散的自治组织（DAO）。本届会议从技术和人类的角度探讨了目标和挑战，这些角度和人类的观点有助于建立成功的DAO系统，以及如何将它们用作外星世界元元中的核心游戏组件，以补充游戏中现有的NFT游戏机制和矿业活动。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: How Treasure Brought 100,000 Gamers to Arbitrum, Ethereum's ...",
            "author": "A.J. Warner ",
            "organization": "Arbitrum",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029166/Web3-Forum-How-Treasure-Brought",
            "index": 471,
            "overview": "This session will discuss the success of Treasure and the power of building a bootstrapped gaming community on Ethereum's largest scaling solution, Arbitrum. nnArbitrum is a Layer 2 scaling solution that has the security guarantees of Ethereum with fees that are 95% cheaper. This allows games to scale their communities and on-chain actions in a way that was never possible before. The chain currently secures nearly $3B of value and is home to hundreds of thousands of weekly active users.nnTreasure is working to build the 'decentralized Nintendo', a crypto-native game publisher and ecosystem connected by games, resources, and infrastructure. As the #1 gaming and NFT ecosystem on Arbitrum with 10+ games today, Treasure's cultivated a vibrant and intimate community of game builders, creators, and players united through shared experiences and fun!",
            "translated": "本届会议将讨论宝藏的成功以及建立以太坊最大的扩展解决方案inotum的自举游戏社区的力量。Nnarbitrum是一种2层缩放解决方案，具有以太坊的安全保证，费用便宜95％。这允许游戏以前所未有的方式扩展其社区和链接动作。该连锁店目前可确保近3B美元的价值，并拥有数十万个每周活跃的用户。Nntreasure正在努力构建“分散的任天堂”，这是一个由加密本地游戏出版商和通过游戏，资源和基础架构连接的加密本地游戏出版商和生态系统。作为当今10多种游戏的仲裁游戏中排名第一的游戏和NFT生态系统，宝藏通过共同的经验和乐趣培养了一个充满活力和亲密的游戏建筑，创作者和玩家的社区！"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Web3 Forum: Real BUIDL: Ultimate Scaling Solution for Web3 Gaming (Prese...",
            "author": "Julian DiCarlo ",
            "organization": "NodeReal",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-23/play/1029253/Web3-Forum-Real-BUIDL-Ultimate",
            "index": 473,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tools Summit: Cosmonious High Case Study of Seret: Building a Custom VO ...",
            "author": "Daniel Perry ",
            "organization": "Owlchemy Labs",
            "trackname": "Tools Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028745/Tools-Summit-Cosmonious-High-Case",
            "index": 428,
            "overview": "Owlchemy Labs started work on Cosmonious High following their work on Vacation Simulator. After setting up the goals of what the team wanted to achieve in the game, they realized that, to reach our scoped dialogue goals, they had to create a more efficient and robust pipeline. Something that would allow them to iterate faster and save time on all the processes that can be automated along the way.That's how they came up with Seret: an internal narrative/audio pipeline system and tool. In this talk, Daniel Perry, Audio Director at Owlchemy Labs, will discuss designing and developing Seret, and the challenges that came along in production that brought added features and functionality to it.",
            "translated": "在度假模拟器上的工作之后，Owlchemy Labs开始从事宇宙高潮的工作。在设定了团队在比赛中想要实现的目标之后，他们意识到，要达到我们的范围对话目标，他们必须建立一个更有效，更强大的管道。可以使他们更快地迭代并节省所有可以自动化的过程的时间。这是他们如何提出Seret的方式：内部叙事/音频管道系统和工具。在这次演讲中，Owlchemy Labs的音频总监Daniel Perry将讨论设计和开发SERET，以及在制作中带来的挑战，这些挑战为其带来了更多的功能和功能。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tools Summit: Managing Source Content for 'Overwatch 2'",
            "author": "Rowan Hamilton ",
            "organization": "Blizzard Entertainment",
            "trackname": "Tools Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028817/Tools-Summit-Managing-Source-Content",
            "index": 429,
            "overview": "Modern game development requires the management of vast amounts of source data. As the industry moves towards globally distributed teamsand people are more often working from their homes, rather than the officehow do you build source control workflows that are frictionless for users, rather than being a source of frustration?In this talk, Rowan Hamilton, Lead Tools Engineer at Blizzard Entertainment, will look at the principles behind Overwatch's custom source control solution, designed to allow users to work in large, highly branched repositories. In addition, they'll explore how this system struggled as the team transitioned from working out of a single office to a global team of hundreds of developers working from their homes, and the new technologies we incorporated to address these issues.",
            "translated": "现代游戏开发需要管理大量源数据。随着行业朝着全球分布式的团队发展，人们更频繁地从他们的家中工作，而不是office -you Build of -office ofder of用户无摩擦的源控制工作流，而不是成为挫败感的来源？在这次演讲中，罗恩·汉密尔顿（Rowan Hamilton）Blizzard Entertainment的工程师将研究《守望先锋》的自定义源控制解决方案背后的原理，旨在允许用户在大型，高度分支的存储库中工作。此外，他们还将探讨该系统如何在团队从一个办公室工作过渡到一个由数百名从他们家工作的开发人员组成的全球团队以及我们为解决这些问题所采用的新技术而奋斗。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Tools Summit: TestMonkey: Automated Testing at Santa Monica Studio",
            "author": "Ben Hines ",
            "organization": "Santa Monica Studio",
            "trackname": "Tools Summit",
            "url": "https://gdcvault.com/free/gdc-23/play/1028866/Tools-Summit-TestMonkey-Automated-Testing",
            "index": 430,
            "overview": "Automated testing continues to grow in importance within the game industry. Santa Monica Studio has extensively used automation to test various aspects of the game for over a decade. The team created a test framework called \"TestMonkey,\" which includes game tests that can be run locally or remotely on a server as part of a Continuous Integration process.This talk will go through their experience and lessons learned when implementing this testing framework. Ben Hines, Staff DevOps Engineer at Santa Monica Studio, will give demos of their internal website, which displays test results for usersand talk about how they integrate different platforms into the system. Test suites to be discussed include: Visual Tests, Smoke Tests, SAN / ASAN Tests, Determinism, Gameplay, and Code Integration tests. Additionally, they can talk about the scripting languages used for the automated tests.",
            "translated": "自动化测试在游戏行业中的重要性不断增长。十多年来，Santa Monica Studio已广泛使用自动化来测试游戏的各个方面。该团队创建了一个名为“ TestMonkey”的测试框架，其中包括可以在服务器上或在服务器上进行远程运行的游戏测试，作为连续集成过程的一部分。此谈话将经历他们的经验以及在实施此测试框架时所学到的经验教训。Santa Monica Studio的DevOps工程师Ben Hines将提供其内部网站的演示，该网站显示了用户的测试结果，并谈论他们如何将不同的平台集成到系统中。要讨论的测试套件包括：视觉测试，烟雾测试，SAN / ASAN测试，确定性，游戏玩法和代码集成测试。此外，他们可以谈论用于自动测试的脚本语言。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "'God of War Ragnarok': Building the UI for a AAA Sequel",
            "author": "Zach Bohn ",
            "organization": "Santa Monica Studio",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029143/-God-of-War-Ragnarok",
            "index": 7,
            "overview": "In this session, Zach Bohn, Sr. Staff Technical Designer at Santa Monica Studio, will discuss the development of God of War Ragnark's User Interface (UI) and, more broadly, the role of a UI team/individual on a project.In further detail, this talk covers the unique role of the UI discipline in game development and the challenges it faces from design/engineering and artistic perspectives, how to best structure a UI team to ensure its success, and the internal Santa Monica critique of God of War (2018) and how it formed the foundational cornerstones of developing the sequel's UI. At the end, there will be several tips and tricks on how to optimize the technical aspect of UI, and things to look out for during production.",
            "translated": "在本次会议上，Santa Monica Studio的Sr. Zach Bohn技术设计师将讨论War God of War Ragnark的用户界面（UI）的发展，更广泛地说，UI团队/个人在项目中的作用。细节，此演讲涵盖了UI学科在游戏开发中的独特作用及其在设计/工程和艺术角度所面临的挑战，如何最好地构建UI团队以确保其成功以及对War Nog的内部批评（2018）及其如何形成开发续集UI的基础基石。最后，关于如何优化UI的技术方面以及在生产过程中寻找的东西将有一些技巧和技巧。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Adobe Developer Summit: 'A Plague Tale: Requiem': Making AAA Characters ...",
            "author": "Loc Paulus ",
            "organization": "Asobo Studio",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028905/Adobe-Developer-Summit-A-Plague",
            "index": 29,
            "overview": "Loc Paulus, Senior Character Artist at Asobo Studio, will present the creation process of the characters of A Plague Tale: Requiem, an AAA game, and talk about how Substance 3D Painter was used to produce these characters quickly within a limited team of two character artists. He'll walk through different techniques with Painter, such as how to speed up skin painting and details, and how the 3D Assets library was leveraged in the process.",
            "translated": "Asobo Studio的高级角色艺术家Loc Paulus将介绍瘟疫故事的角色的创建过程：Anquiem，AAA游戏，并谈论如何使用Suttance 3D Painter在两个角色的有限团队中快速生产这些角色艺术家。他将与画家一起浏览不同的技术，例如如何加快皮肤彩绘和细节，以及如何在此过程中利用3D资产库。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Adobe Developer Summit: 'The Callisto Protocol': A Tile Mask Painting Wo...",
            "author": "Sam Juarez ",
            "organization": "Striking Distance Studio",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029338/Adobe-Developer-Summit-The-Callisto",
            "index": 30,
            "overview": "Sam Juarez will showcase examples of art using the workflow and setup inside Substance 3D Painter for the tile mask system developed for The Callisto Protocol. Sam will also describe how the art team uses the different layers and masks within Substance 3D Painter, and detail why the tile mask system was so effective in allowing the team to quickly make variations of the same asset, as well as keeping the texel density high without the need for larger texture files. Sam will then showcase examples of how the tile mask system combined with a tileable base layers within the engine can be easily changed to match the look set for the various locations within The Callisto Protocol.",
            "translated": "Sam Juarez将使用为Callisto协议开发的Tile Mask系统内部的工作流程和设置3D画家的工作流程和设置来展示艺术示例。山姆还将描述艺术团队如何在物质3D画家中使用不同的层和口罩，并详细说明为什么瓷砖掩码系统如此有效地允许该团队快速进行相同资产的变化，并保持高音密度高。无需更大的纹理文件。然后，SAM将展示如何轻松更改发动机中的瓷砖蒙版系统与发动机内部的易用基层结合，以匹配Callisto协议中各个位置的外观。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Adobe Developer Summit: Adobe Substance 3D Keynote (Presented by Adobe)",
            "author": "Sbastien Deguy ",
            "organization": "Adobe",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028913/Adobe-Developer-Summit-Adobe-Substance",
            "index": 31,
            "overview": "Discover what's new in Substance 3D as Sbastien Deguy, Vice President, 3D & Immersive at Adobe, and the team announce some new product features. Get insights and updates on what the Substance 3D team is working on to support the community to build incredible games and content.",
            "translated": "发现Adobe 3D＆Immersive副总裁Sbastien Deguy的物质3D中的新功能，团队宣布一些新产品功能。获取有关3D团队正在努力支持社区以建立令人难以置信的游戏和内容的见解和最新信息。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Adobe Developer Summit: Advances in Uniform Creation for EA Sports' NHL ...",
            "author": "Gary Snyder ",
            "organization": "Electronic Arts",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028919/Adobe-Developer-Summit-Advances-in",
            "index": 32,
            "overview": "For their first year on Frostbite and the new generation of console hardware, the National Hockey League Team set out to build a new foundation for uniform and apparel creation that could carry them into the future. Learn how Substance 3D Designer and Substance 3D Painter became the backbone for a unified approach to building new uniforms for both last and current generation consoles. Gary Snyder and Dallas Finerty will break down how they rebuilt their workflow and libraries from the ground up with an eye toward resolution-independence and scalability, empowering the team to create the most authentic and detailed uniforms yet across the widest range of platforms ever for the franchise.",
            "translated": "国家曲棍球联盟团队开始在Frostbite和新一代游戏机硬件上，为统一和服装创作建立新的基础，可以将它们带入未来。了解物质3D设计师和物质3D画家如何成为统一方法的骨干，用于为最后一代和当前的游戏机构建新的制服。加里·斯奈德（Gary Snyder）和达拉斯（Dallas Finerty）将分解他们如何重建工作流程和库从头开始，着眼于解决方案独立和可扩展性，使团队能够为有史以来最宽的平台创建最真实，最详细的制服，以为尚有有史以来最广泛的平台创建。特许经营。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Adobe Developer Summit: The Material Art of 'The Last of Us Part I' (Pre...",
            "author": "Jonathan Benainous ",
            "organization": "Naughty Dog",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029357/Adobe-Developer-Summit-The-Material",
            "index": 33,
            "overview": "This session presented by Jonathan Benainous and Jared Sobotta focuses heavily on the material art and creation for The Last of Us: Part I. Jonathan and Jared will revisit the post-pandemic world of The Last of Us and talk through the recreation for the PlayStation 5. They will discuss the texture art pipeline at Naughty Dog, providing insight on the team's dynamic for success. Jonathan will shed light on the challenges of man-made, architectural material creation for the Boston Capitol Building as well as the creation of procedural generators with Substance 3D Designer, to speed up the team's process and author a large amount of materials. Jared will focus on natural, organic art and the marriage of Substance 3D Designer and organic sculpting for Tommy's Dam. Both artists will share their workflows and artistic choices utilizing Adobe Substance 3D Designer to create \"The Material Art of The Last of Us Part I\".",
            "translated": "乔纳森·贝纳纳斯（Jonathan Benainous）和贾里德·索博塔（Jared Sobotta）举行的这次会议重点介绍了我们最后一个人的材料艺术和创作：第一部分。乔纳森（I. Jonathan）和贾里德（Jared。乔纳森（Jonathan）将阐明为波士顿国会大厦建筑的人造，建筑材料创造的挑战，以及用物质3D设计师创建的程序发电机，以加快团队的流程并撰写大量材料。贾里德（Jared）将专注于自然，有机艺术以及汤米大坝（Tommy's Dam）的3D设计师和有机雕刻的婚姻。两位艺术家都将利用Adobe Suelts 3D设计师分享他们的工作流和艺术选择，以创建“我们最后一部第一部分的物质艺术”。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Autodesk Developer Summit: Creating a Digital Identity (Presented by Aut...",
            "author": "Stefan Ivanov ",
            "organization": "Stealth Meta Wear",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029007/Autodesk-Developer-Summit-Creating-a",
            "index": 67,
            "overview": "Digital identities and the metaverse continue to build momentum as people seek to engage with each other in ways they've never experienced before. Art Director, Stefan Ivanov, shares the extensive process of creating a digital version of a model and walks through how he used 3ds Max and Substance to generate unique digital clothing. You'll get an inside look at the tools used by AAA game studios to create stunning digital content and explore how a pipeline of a high-end production can be used to develop a new AR experience.",
            "translated": "当人们试图以前所未有的方式互相互动时，数字身份和元视体继续建立动力。艺术总监Stefan Ivanov分享了创建模型的数字版本的广泛过程，并介绍了他如何使用3DS Max和物质来生成独特的数字服装。您将在内部查看AAA Game Studios使用的工具来创建令人惊叹的数字内容，并探索如何使用高端生产的管道来开发新的AR体验。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Autodesk Developer Summit: Luminous Productions: The Making of 'Forspoke...",
            "author": "Junko Hiramatsu ",
            "organization": "Luminous Productions",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029221/Autodesk-Developer-Summit-Luminous-Productions",
            "index": 68,
            "overview": "Go behind-the-scenes with the talented team at Luminous Productions as they walk through their cutscene workflow for Forspoken, the highly praised action role-playing game. From asset creation and performance capture to character animation and scene layout, you'll explore how Maya, MotionBuilder and ShotGrid were used to bring the cruel land of Athia as well as its heroes to life.",
            "translated": "在Luminous Productions的才华横溢的团队中，他们穿越过场动画工作流程，以备受赞誉，这是高度赞扬的动作角色扮演游戏。从资产创造和绩效捕获到角色动画和场景布局，您将探讨如何使用Maya，Motionbuilder和ShotGrid将Athia的残酷土地及其英雄带入生活。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Autodesk Developer Summit: New Tales from the Borderlands: Maximizing Ti...",
            "author": "Marion Guignolle ",
            "organization": "Gearbox Studio Qubec",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029251/Autodesk-Developer-Summit-New-Tales",
            "index": 70,
            "overview": "Explore how Gearbox Studio Qubec built a pipeline from the ground up to support the delivery of cinematic content for New Tales from the Borderlands in a short period of time.Marion Guignolle, Senior Technical Animator, shares how her team worked with large amounts of animation content and how they automated file creation and data management using Maya and ShotGrid. She'll walk through how to transform manual and tedious tasks into an automated workflow adapted to game development, preventing human errors and allowing artists to focus on their craft while saving time and sanity.",
            "translated": "探索变速箱工作室如何从头开始建立一条管道，以支持短时间内从边境地区从世界地带的电影内容传递。以及它们如何使用Maya和ShotGrid自动化文件创建和数据管理。她将介绍如何将手动和乏味的任务转变为适合游戏开发的自动化工作流程，防止人体错误并允许艺术家专注于自己的手艺，同时节省时间和理智。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Autodesk Developer Summit: Next-Gen Game Workflows with USD ft. Epic Gam...",
            "author": "Carlos Carpintero ",
            "organization": "Autodesk",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029276/Autodesk-Developer-Summit-Next-Gen",
            "index": 71,
            "overview": "The use of USD is widespread in the VFX industry, and for good reason. How might it benefit game studios? What can Games learn from USD in Film & TV? Join technology experts from Autodesk and Epic Games in this panel discussion to explore the challenges of constructing a game asset pipeline and examine the potential of an extensible and open solution like USD.",
            "translated": "价格在VFX行业中广泛存在，这是有充分理由的。它如何使游戏工作室受益？游戏可以从电影和电视中的美元中学到什么？加入Autodesk和Epic Games的技术专家参加此小组讨论，以探索构建游戏资产管道的挑战，并研究像USD这样的可扩展和开放解决方案的潜力。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Building Champions: Character Art Pipeline for 'Rumbleverse'",
            "author": "Steven Kosanovich ",
            "organization": "Iron Galaxy Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028733/Building-Champions-Character-Art-Pipeline",
            "index": 81,
            "overview": "This talk covers the character and accessory pipeline for Rumbleverse, a 40-player brawler royale where every aspect of the culture is an homage to the glorious traditions of combat. A chief pillar of Rumbleverse is character customization. Players can choose from a constantly growing catalog of accessories to equip on six body shapes, each varying greatly in shape and sizefrom toothpick-thin, noodle armed brawlers, to short, meatball-bellied champions. Building out accessories that are to be stretched to six different body shapes, while maintaining overall appeal and a consistent read, required modeling and texturing techniques outside of standard industry practices. As character lead, Steven Kosanovich was responsible for working with technical artists and designers to develop a character and accessory system that allowed for maximum customization without resulting in broken or unappealing combinations. In this talk, he covers the character design philosophy, accessory pipeline, and accessory system development necessary to bring the characters of Rumbleverse to life.",
            "translated": "这次演讲涵盖了Rumbleverse的角色和配饰管道，Rumbleverse是一个40名玩家的皇家皇家，文化的各个方面都是对战斗的光荣传统的敬意。Rumbleverse的主要支柱是角色定制。玩家可以从不断增长的配件目录中进行选择，以装备六个身体形状，每个形状都有很大的变化，从牙签 - 薄薄的面条武装斗殴者到短而短的肉丸腹冠军。建立应将其扩展到六种不同身体形状的配件，同时保持整体吸引力，并在标准行业实践之外进行一致的读取，所需的建模和纹理技术。作为角色的负责人，史蒂文·科萨诺维奇（Steven Kosanovich）负责与技术艺术家和设计师合作开发一个角色和配件系统，该系统允许最大程度地定制，而不会导致损坏或不吸引人的组合。在这次演讲中，他涵盖了角色设计理念，附件管道和附属系统开发，将Rumbleverse的角色带入生活所需。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Co-creating Games on Mobile (Yahaha): A Generic Architecture for Runtime...",
            "author": "Przemyslaw Krompiec ",
            "organization": "Yahaha Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028992/Co-creating-Games-on-Mobile",
            "index": 93,
            "overview": "Today there are lots of game creation tools that you can use to build your own games. Some tools are easy to use and even require noa multiplayer gameBut can you build a multiplayer games on mobile together with your friends?Recently, our group built a Co-Create tool with no coding requirement on both APP and PC. Tired of building your own world? That's OK, just invite your friends to join the co-creation, from multiplayer games to hangout games. When you feel it's good to go, just send everyone into the play mode and enjoy the game. You can go back and forth until it's getting perfect.Besides many popular game templates, we also provide hundreds of smart assets and powerful built-in ccloaksents. From guns to invisibility cloak, it's exciting to put these props into your game. Since DIY is the core of UGC, our tools even allows creators to edit the properties of these assets and freely combine different logic components. We barely set any limits, which means there is no complete list of what can be created. The only limit to that is your imagination.",
            "translated": "如今，您可以使用许多游戏创建工具来构建自己的游戏。一些工具易于使用，甚至需要NOA多人游戏，但是您可以与朋友一起在移动设备上构建多人游戏吗？厌倦了建立自己的世界？没关系，只需邀请您的朋友加入共同创作，从多人游戏到聚会游戏。当您觉得这是一件好事时，只需将所有人带入游戏模式并享受游戏。您可以来回走到完美之前。BesivesBeside许多流行的游戏模板，我们还提供数百个智能资产和强大的内置CCLOAKSENTS。从枪支到隐形斗篷，将这些道具放入您的游戏中令人兴奋。由于DIY是UGC的核心，因此我们的工具甚至允许创建者编辑这些资产的属性，并自由结合不同的逻辑组件。我们几乎没有设置任何限制，这意味着没有可以创建的内容的完整列表。唯一的限制就是您的想象力。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Creating Context Art in the Open World of 'Saints Row's' Santo Ileso",
            "author": "James Taylor ",
            "organization": "DS Volition",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028749/Creating-Context-Art-in-the",
            "index": 107,
            "overview": "Creating an open world is hardespecially when that open world needs an appropriate level of signage, branding, landmarks, and road markers. With over 400 fictional brands on display, Saints Row's Santo Ileso needed a new category of artist to name, design, and place most of the signs around town... and do their best to manage the rest. The context trtist is responsible for it all. This talk covers what a context artist is, how the position came to be, how it evolved throughout the project, and how it may be a position other teams need for their next worlds.",
            "translated": "创建开放世界很难，尤其是当开放世界需要适当的标牌，品牌，地标和路标记时。Saints Row的Santo Ileso展出了超过400个虚构品牌，需要一个新的艺术家来命名，设计和放置城镇周围的大多数标志……并尽力管理其余的迹象。上下文trtist负责这一切。这次演讲涵盖了上下文艺术家是什么，职位的发展，整个项目的发展方式，以及其他团队对下一个世界的需要。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Creating Realistic Landscapes in Unreal Engine with Houdini (Presented b...",
            "author": "Darko Pracic ",
            "organization": "Embark Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029010/Creating-Realistic-Landscapes-in-Unreal",
            "index": 108,
            "overview": "In this talk, Environment Art Lead Darko Pracic will take you through Embark Studios' use of Houdini for creating realistic landscapes in Unreal Engine. The first section will cover workflows for shaping out the world using LiDAR data and QuadSpinner's Gaea Bridge tool. Darko will compare the studio's LiDAR processing setup in PDG with previous LiDAR workflows in which artists had to learn complex GIS applications like GlobalMapper. Then, you'll get a look at Embark's export/import setup from Houdini to Unreal Engine. Next, Darko will go more in depth and demonstrate the studio's in-house heightfield utility HDAs, highlighting the benefits of working with landscapes in 3D rather than 2D. You'll learn about Houdini's strengths not just as a procedural tool, but also as a tool for non-technical artists to make large landscape changes that are beautiful and realisticeven in a fast-paced production environment for free-to-play games.",
            "translated": "在这次演讲中，环境艺术领导Darko Pracic将带您通过Embark Studios使用Houdini在虚幻引擎中创建现实的景观。第一部分将涵盖使用LiDAR数据和Quadspinner的Gaea桥工具来塑造世界的工作流程。Darko将将工作室的LIDAR处理设置与以前的LiDAR工作流程进行比较，其中艺术家必须学习像GlobalMapper这样的复杂GIS应用程序。然后，您将查看Embark从Houdini到虚幻引擎的出口/导入设置。接下来，Darko将更深入地进行，并展示工作室的内部高地实用程序HDA，强调了在3D而不是2D上使用景观的好处。您将了解Houdini的优势不仅是程序工具，还可以作为非技术艺术家进行大型景观更改的工具，在快节奏的生产环境中，可以免费玩游戏。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Creating the Art of 'Harry Potter: Magic Awakened'",
            "author": "Qingfeng Zeng ",
            "organization": "NetEase",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028748/Creating-the-Art-of-Harry",
            "index": 109,
            "overview": "In this session, Qingfeng Zeng, Game Lead Artist at NetEase, will focus on the building process of hand-painted stylized art pipeline and the development experience for Harry Potter: Magic Awakenedincluding concept design theory at the early stage, implementation of stylized character and scene assets, special effects and action production, character and scene shader design, and related custom stylized render pipeline.",
            "translated": "在本次会议上，netease的游戏首席艺术家青春（Zeng Zeng Zeng资产，特殊效果和动作生产，角色和场景着色器设计以及相关的定制渲染管道。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Creative Future with Artificial Intelligence",
            "author": "Andrew Maximov ",
            "organization": "Promethean AI",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029014/Creative-Future-with-Artificial",
            "index": 112,
            "overview": "Combining the unique perspective of a veteran 3d artist and game developer, as well as a CEO of a generative AI company and a technical advisor in the class action lawsuit against Stable AI on the side of the artists, Andrew will provide a comprehensive overview of generative AI space today.nnDuring the talk he will give pointers on which technologies teams should consider adopting right now and which could be a technical, ethical and legal minefield. We will also discuss what to look forward to or watch out for in the future and how to make sure that the future we are building is ethical and inclusive.nnAnd most importantly we'll cover how all of this is going to impact individual artists and developers and what is the best way to navigate this as an individual. Whether you are a veteran or just looking to join the industry",
            "translated": "结合了一位经验丰富的3D艺术家和游戏开发人员的独特视角，以及一家生产AI公司的首席执行官以及在艺术家方面针对稳定AI的集体诉讼诉讼的技术顾问，Andrew将提供有关生产的全面概述今天的人工智能空间。他将向他提供有关哪些技术团队现在应该考虑采用哪些技术，道德和合法雷区的建议。我们还将讨论将来能期待或提防什么，以及如何确保我们建立的未来是道德和包容的。最重要的是，我们将介绍所有这些都将如何影响个人艺术家和开发人员以及作为个人导航的最佳方法是什么。无论您是退伍军人还是只是想加入行业"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "From AI Generation to Art-Directed Stylizer: How Yahaha Platform Helps C...",
            "author": "Jiao Liang ",
            "organization": "YAHAHA Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029085/From-AI-Generation-to-Art",
            "index": 163,
            "overview": "Attractive art styles are key in drawing players to a game. That's where Yahaha comes in. Our AI technology and art-directed stylizers allow creators to effortlessly construct a variety of stylized worlds. Imagine having an AI assistant by your side, suggesting the ideal assets for your world's current art style. For example, constructing a realistic house with the perfect finishing touches. And, with our AI NPC system, you can add characters with distinct personalities, voices, and behaviors for players to interact with. Moreover, we offer multiple customizable art styles, enabling creators to create their own worlds with just a few clicks and achieve the same stunning results on all supported platforms, without having to rebuild their worlds at runtime.",
            "translated": "吸引人的艺术风格是吸引玩家参加游戏的关键。这就是Yahaha的来源。我们的AI技术和艺术指导的造型器允许创作者毫不费力地构建各种风格化的世界。想象一下，在您的身边有一个AI助手，为您当前的艺术风格提供理想的资产。例如，建造一栋逼真的房屋，具有完美的修饰。而且，使用我们的AI NPC系统，您可以添加具有不同个性，声音和行为的角色，以供玩家互动。此外，我们提供多种可自定义的艺术风格，使创作者只需单击几下创建自己的世界，并在所有受支持的平台上取得相同的惊人结果，而无需在运行时重建世界。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "How To Make AAA-Looking Games Like 'A Plague Tale: Requiem' with 20 Artists",
            "author": "Loc Paulus ",
            "organization": "Asobo Studio",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029162/How-To-Make-AAA-Looking",
            "index": 225,
            "overview": "In this session, environment artist Greg Binetruy will share how Asobo Studio's Art Team managed to create the strong and critically acclaimed graphics for A Plague Tale: Requiemoften compared with the biggest AAA blockbusterswith only 15-20 artists for a development time of three years... which included a pandemic lockdown and two office relocations! The talk will examine team hierarchy and organization, production processes and techniques, the organic approach of creating props and levels, and the benefits of using in-house game engine and development tools.",
            "translated": "在本届会议上，环境艺术家Greg Binetruy将如何分享Asobo Studio的艺术团队如何为瘟疫故事创建强大而备受赞誉的图形：与最大的AAA Blockbasters相比，Requiempteren与最大的AAA Blocksters一起，只有15-20年的艺术家在三年的发展时间里。。演讲将检查团队等级制度和组织，生产过程和技术，创建道具和级别的有机方法以及使用内部游戏引擎和开发工具的好处。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "How To Make AAA-Looking Games Like 'A Plague Tale: Requiem' with 20 Artists",
            "author": "Loc Paulus ",
            "organization": "Asobo Studio",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028794/How-To-Make-AAA-Looking",
            "index": 226,
            "overview": "In this session, environment artist Greg Binetruy will share how Asobo Studio's Art Team managed to create the strong and critically acclaimed graphics for A Plague Tale: Requiemoften compared with the biggest AAA blockbusterswith only 15-20 artists for a development time of three years... which included a pandemic lockdown and two office relocations! The talk will examine team hierarchy and organization, production processes and techniques, the organic approach of creating props and levels, and the benefits of using in-house game engine and development tools.",
            "translated": "在本届会议上，环境艺术家Greg Binetruy将如何分享Asobo Studio的艺术团队如何为瘟疫故事创建强大而备受赞誉的图形：与最大的AAA Blockbasters相比，Requiempteren与最大的AAA Blocksters一起，只有15-20年的艺术家在三年的发展时间里。。演讲将检查团队等级制度和组织，生产过程和技术，创建道具和级别的有机方法以及使用内部游戏引擎和开发工具的好处。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Is Beauty Emotional or Rational?: Cosmetics and Consumer Choice in 'NARA...",
            "author": "Xinwei Chang ",
            "organization": "NetEase",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029200/Is-Beauty-Emotional-or-Rational",
            "index": 275,
            "overview": "In NARAKA: BLADEPOINT, there are hundreds of cosmetics with diversified design styles. Although each skin is a delicate work of designers, in-game skins always have drastically different sales volume, which brings the key questions discussed today: What kinds of skins do players prefer? Do consumers usually buy cosmetics emotionally or rationally? Starting from the player's aesthetic preferences, this talk will introduce the way how NARAKA: BLADEPOINT's research team found regular patterns of consumer choice and quantified the abstractive beauty.",
            "translated": "在Naraka：Bladepoint，有数百种具有多样化设计风格的化妆品。尽管每种皮肤都是设计师的精致作品，但游戏中的皮肤的销量总是截然不同，这带来了今天讨论的关键问题：玩家喜欢哪种皮肤？消费者通常会在情感或理性上购买化妆品吗？从玩家的审美偏好开始，这次演讲将介绍Naraka：Bladepoint的研究团队的方式定期找到消费者选择的模式，并量化抽象性美。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Kung-fu and Speed Painting: Sifu's Art Direction and World Building Appr...",
            "author": "Paul-Emile Boucher ",
            "organization": "Sloclap",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028808/Kung-fu-and-Speed-Painting",
            "index": 277,
            "overview": "What happens when Kung-fu Cinema meets speed painting? In this talk, you'll learn how the creative pillars behind Sifu's visual identity bring a sense of unity to the game's world, hinging on salient principles of Chinese martial arts, classic action cinema, and digital painting techniques. Explore with Art Director Paul-Emile Boucher the elements of Wuxing, the Confucian moral code, and get an in-depth look into the unique flavor brought by speed painting to the game's volumes, shapes, and textures.",
            "translated": "功夫电影院遇到速度绘画时会发生什么？在这次演讲中，您将了解SIFU视觉认同背后的创意支柱如何使游戏的世界充满团结感，取决于中国武术，经典动作电影院和数字绘画技术的显着原则。与艺术总监Paul-Emile Boucher一起探索Wuxing的元素，儒家道德守则，并深入了解Speed Painte带来的独特风味，以涉及游戏的卷，形状和纹理。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Push the Limits of Immersion in Next-Gen Games Using State-of-the-Art Ey...",
            "author": "Thomas Papa ",
            "organization": "Tobii",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029295/Push-the-Limits-of-Immersion",
            "index": 356,
            "overview": "In PC Gaming, Tobii is the #1 brand for head and eye tracking. Today, a thriving community of millions of PC Gamers is already leveraging its immersive gaming features. Each community has its own reasons and seeks immersion in different ways. What is it exactly that these players seek? And how are they getting the most out of their simulation & AAA experiences? nnAs more consumer XR devices come to the hands of gamers with sensor technology enabled features, eye tracking is playing an increasingly essential role in enhancing graphic fidelity and maintaining a stable game performance with high framerate. New innovations in using eye tracking technology to create intuitive game interactions and better social presences are also witnessed. nnIn this talk, Thomas and Johan will discuss how eye and head tracking works and how it adds value to game design, device performance, and player engagement.",
            "translated": "在PC游戏中，Tobii是头和眼睛跟踪的第一名。如今，一个繁荣的社区数百万个PC游戏玩家已经在利用其沉浸式游戏功能。每个社区都有自己的原因，并以不同的方式寻求沉浸。这些球员们在寻找什么？他们如何充分利用模拟和AAA体验？nnas更多的消费者XR设备由具有传感器技术功能的游戏玩家掌握，眼睛跟踪在增强图形忠诚度并保持稳定的游戏性能方面发挥了越来越重要的作用。还见证了使用眼睛跟踪技术来建立直观的游戏互动和更好的社交定义的新创新。nnin这次演讲，托马斯（Thomas）和约翰（Johan）将讨论眼睛和头部跟踪的工作方式，以及如何为游戏设计，设备性能和玩家参与度增加价值。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Shape and Shadow: Creating Horror in the 'The Callisto Protocol'",
            "author": "Demetrius Leal ",
            "organization": "Striking Distance Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029307/Shape-and-Shadow-Creating-Horror",
            "index": 370,
            "overview": "In this session, Demetrius Leal and Atsushi Seo will examine the development of the art and lighting of The Callisto Protocol in the context of Striking Distance Studio's horror engineering framework, including Atmosphere, Brutality, Tension, Helplessness, and Humanity. It will cover the methodology and elements used to create a realistic and cinematographic immersive experience to terrify the player. The session will give examples of ideation, concept, and the integration of art assets in gameplay and cinematics.",
            "translated": "在本届会议上，Demetrius Leal和Atsushi SEO将在醒目的远距离工作室的恐怖工程框架的背景下研究Callisto协议的艺术和照明的发展，包括气氛，残酷，紧张，无助和人类。它将涵盖用于创建现实和摄影沉浸式体验以使玩家恐惧的方法和元素。该会议将举办游戏和电影中艺术资产的概念，概念和整合的示例。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Squeezing Meta Quest 2 with Unreal Engine: A Tech Art Talk",
            "author": "Adam Andrzejczak ",
            "organization": "Black Drakkar Games",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029313/Squeezing-Meta-Quest-2-with",
            "index": 376,
            "overview": "Mobile VR is finally here! Well, sort of. Any team that wants to develop a modern-looking game on Meta Quest 2 has to understand the system's technical limitations and how to properly budget the game both assets and gameplay-wise. This talk shows all the optimization techniques and tricks used in \"Interkosmos 2000\" in order to achieve: (pseudo) Physics-Based Rendering, dynamic, shadow-casting light, photorealistic Earth with stars visible from a moving space shuttle, and more. All of these while keeping stable 72 FPS, with hundreds of interactive, independent, movable objects placed on the level, on mobile VR using Unreal Engine 4.",
            "translated": "移动VR终于在这里！好吧，有点。任何想要在Meta Quest 2上开发现代游戏的团队都必须了解系统的技术限制以及如何正确预算游戏的资产和游戏玩法。本演讲显示了“ Interkosmos 2000”中使用的所有优化技术和技巧，以实现：（伪）基于物理学的渲染，动态，阴影铸造的光，具有从移动空间的恒星可见的恒星等等。所有这些在保持稳定的72 fps时，使用虚幻引擎4在移动VR上放置了数百个互动，独立的，可移动的对象。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Squeezing Meta Quest 2 with Unreal Engine: A Tech Art Talk",
            "author": "Adam Andrzejczak ",
            "organization": "Black Drakkar Games",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1028856/Squeezing-Meta-Quest-2-with",
            "index": 377,
            "overview": "Mobile VR is finally here! Well, sort of. Any team that wants to develop a modern-looking game on Meta Quest 2 has to understand the system's technical limitations and how to properly budget the game both assets and gameplay-wise. This talk shows all the optimization techniques and tricks used in \"Interkosmos 2000\" in order to achieve: (pseudo) Physics-Based Rendering, dynamic, shadow-casting light, photorealistic Earth with stars visible from a moving space shuttle, and more. All of these while keeping stable 72 FPS, with hundreds of interactive, independent, movable objects placed on the level, on mobile VR using Unreal Engine 4.",
            "translated": "移动VR终于在这里！好吧，有点。任何想要在Meta Quest 2上开发现代游戏的团队都必须了解系统的技术限制以及如何正确预算游戏的资产和游戏玩法。本演讲显示了“ Interkosmos 2000”中使用的所有优化技术和技巧，以实现：（伪）基于物理学的渲染，动态，阴影铸造的光，具有从移动空间的恒星可见的恒星等等。所有这些在保持稳定的72 fps时，使用虚幻引擎4在移动VR上放置了数百个互动，独立的，可移动的对象。"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "Taking a Procedural Approach to Texturing the Machines of 'Horizon Forbi...",
            "author": "Tom Delboo ",
            "organization": "Guerrilla",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029327/Taking-a-Procedural-Approach-to",
            "index": 385,
            "overview": "For Horizon Forbidden West, Guerrilla expanded on its iconic machine look from its predecessor Horizon Zero Dawn. Our Machine and Weapons team was tasked with streamlining the way Guerrilla handles texturing and shading these incredibly complex assets. Our challenge was to create a workflow that speeds up work while supporting Game Design, Art Direction and Production.This lecture will give insight into how we designed this procedural workflow, how this process functions altogether, and how it provided us so much flexibility that it saved months of production time",
            "translated": "对于Horizo​​n Forbidden West，游击队的标志性机器外观从其前身Horizo​​n零黎明展开。我们的机器和武器团队的任务是简化游击队处理这些令人难以置信的复杂资产的纹理和遮蔽方式。我们的挑战是创建一个工作流程，可以加快工作流程，同时支持游戏设计，艺术指导和制作。此讲座将洞悉我们如何设计该程序性工作流程，该过程如何完全发挥作用以及如何为我们提供如此多的灵活性以至于节省了几个月的生产时间"
        },
        {
            "name": " Game Developers Conference 2023 ",
            "title": "The Facial Animation Pipeline of 'Call of Duty: Modern Warfare II' (Pres...",
            "author": "Sean Comer ",
            "organization": "Infinity Ward",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-23/play/1029448/The-Facial-Animation-Pipeline-of",
            "index": 402,
            "overview": "In Call of Duty: Modern Warfare II every main character is a digital double with the same actor providing their likeness, voice performance, body performance and facial performance. This talk will provide a deep dive into the facial scanning, rigging and animation pipeline. Light Stage scans and DI4D PRO 4D expression data of each actor formed the basis for their character's facial rig. This allowed the parameter space coefficients and deformations of the facial rig to be learned with a higher degree of accuracy than from static scans alone. The learned parameter space has sparse semantic meaning, making the rig easy for artists and animators to manipulate when required. Stereo camera HMCs allowed the capture of facial performance to be processed as PURE4D 4D motion data. High quality transfer of the facial motion onto the rig was achieved without any human intervention, making the process highly scalable.",
            "translated": "在《使命召唤：现代战争II》中，每个主角都是一个数字双重，具有相同的演员，提供了他们的肖像，语音表现，身体表现和面部表现。这次演讲将深入研究面部扫描，索具和动画管道。每个演员的光阶段扫描和DI4D Pro 4D表达数据构成了角色面部钻机的基础。这允许与单独的静态扫描相比，可以以更高的准确性来学习参数空间系数和面部钻机的变形。学习的参数空间具有稀疏的语义含义，使艺术家和动画师在需要时容易操纵钻机。立体声摄像机HMC允许将面部性能捕获为Pure4D 4D运动数据。在没有任何人类干预的情况下实现了面部运动的高质量转移，从而使过程高度可扩展。"
        }
    ]
}