{
    "vaults": [
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Advanced Graphics Summit: DX12 Memory Management in Snowdrop on PC (With...",
            "author": "Gauthier Viau ",
            "organization": "Massive Entertainment - a Ubisoft Studio",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034905/Advanced-Graphics-Summit-DX12-Memory",
            "index": 29,
            "overview": "To achieve good and reliable performance, games using DX12 on PC need to manage memory themselves. This presentation goes over Snowdrop's heaps allocation strategies, as well as how its texture streamer is used to manage memory.Attendees will learn how to use the Windows Performance Analyzer to diagnose VRAM overcommitment issues coming from OS automatic resource demotion, using real examples of performance degradations due to bad memory management in Snowdrop with DX12.Solutions to address these issues a resource residency management system and the texture streamer usage of DirectX tiled resources to free large amount of memory while minimizing quality loss are discussed, as well as what didn't work so well.",
            "translated": "为了实现良好的性能，在PC上使用DX12的游戏需要自行管理内存。本演示文稿涉及Snowdrop的堆分配策略，以及如何使用其纹理流媒体来管理内存。Attendees将学习如何使用Windows Performance Analyzer诊断来自OS自动资源降级的VRAM额外承诺问题，并使用绩效降级的真实示例来诊断。由于在雪花台上使用DX12的记忆管理不良。解决这些问题的溶液资源居住管理系统和Directx瓷砖资源的质地流媒体使用以释放大量内存，同时讨论了最小化的质量损失，以及什么不起作用很好。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Advanced Graphics Summit: DX12 Memory Management in Snowdrop on PC (With...",
            "author": "Gauthier Viau ",
            "organization": "Massive Entertainment - a Ubisoft Studio",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034334/Advanced-Graphics-Summit-DX12-Memory",
            "index": 30,
            "overview": "To achieve good and reliable performance, games using DX12 on PC need to manage memory themselves. This presentation goes over Snowdrop's heaps allocation strategies, as well as how its texture streamer is used to manage memory.Attendees will learn how to use the Windows Performance Analyzer to diagnose VRAM overcommitment issues coming from OS automatic resource demotion, using real examples of performance degradations due to bad memory management in Snowdrop with DX12.Solutions to address these issues a resource residency management system and the texture streamer usage of DirectX tiled resources to free large amount of memory while minimizing quality loss are discussed, as well as what didn't work so well.",
            "translated": "为了实现良好的性能，在PC上使用DX12的游戏需要自行管理内存。本演示文稿涉及Snowdrop的堆分配策略，以及如何使用其纹理流媒体来管理内存。Attendees将学习如何使用Windows Performance Analyzer诊断来自OS自动资源降级的VRAM额外承诺问题，并使用绩效降级的真实示例来诊断。由于在雪花台上使用DX12的记忆管理不良。解决这些问题的溶液资源居住管理系统和Directx瓷砖资源的质地流媒体使用以释放大量内存，同时讨论了最小化的质量损失，以及什么不起作用很好。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Advanced Graphics Summit: Making Connections: Real-Time Path-Traced Ligh...",
            "author": "Evan Hart ",
            "organization": "NVIDIA",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034648/Advanced-Graphics-Summit-Making-Connections",
            "index": 31,
            "overview": "Path traced effects in games have been a dream of many since the early days of real-time rendering. The advent of hardware accelerated ray tracing and recent advances in algorithms derived from Reservoir-based Spatio-Temporal Importance Sampling (ReSTIR) have turned those dreams into reality. In this session, Evan and Adam discuss the theoretical and practical elements necessary to add real-time pathtraced lighting to an advanced, modern game engine (Unreal Engine 5). Specifically, the team discusses changes to the light transport model and scalability that enhance existing engine systems to handle dramatically more complex lighting environments.",
            "translated": "自实时渲染的早期以来，游戏中的效果一直是许多人的梦想。硬件加速射线追踪的出现以及源自基于水库的时空重要性采样（Restir）的算法的最新进展已将这些梦想变成了现实。在本次会议中，埃文（Evan）和亚当（Adam）讨论了将实时病理照明添加到高级现代游戏引擎（虚幻引擎5）所需的理论和实用元素。具体而言，团队讨论了轻型传输模型和可扩展性的变化，这些变化增强了现有的发动机系统以处理更复杂的照明环境。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Advanced Graphics Summit: Raytracing in Snowdrop: An Optimized Lighting ...",
            "author": "Quentin Kuenlin ",
            "organization": "Massive Entertainment a Ubisoft Studio",
            "trackname": "Advanced Graphics Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034763/Advanced-Graphics-Summit-Raytracing-in",
            "index": 32,
            "overview": "This presentation provides an overview of the pipeline used for the raytraced global illumination and raytraced reflections in the Snowdrop engine. It goes into a deep dive into the probe system used to light the forward rendered objects and also as a cache for the global illumination and reflections. The two probe placement strategies, a grid based one and a new octree based one, are described alongside their advantages and drawbacks. Next, it presents the raytracing done from the gbuffer for both the global illumination and the reflection. Various optimizations are presented, including the use of screen space tracing to reduce the number of world space ray needed, as well as improving raytraced lighting quality.The next section briefly covers the denoising strategy used in Snowdrop. Several denoiser options are provided, including AMD Fidelity FX Reflection Denoiser, Nvidia's raytracing Denoisers, as well as two custom in-house denoisers.Finally, the presentation ends on how the raytraced result are applied to the final image.",
            "translated": "该演示文稿概述了用于雪花发动机中的射线扫带全球照明和射线式反射的管道。它深入研究了用于点亮正向渲染对象的探针系统，也可以作为全球照明和反射的缓存。两种基于网格的探针放置策略和基于新的OCTREE的探针策略与它们的优势和缺点一起描述了。接下来，它为全球照明和反射介绍了Gbuffer的射线跟踪。提出了各种优化，包括使用屏幕空间跟踪来减少所需的世界空间射线数量，并提高了射线式照明质量。提供了几种Denoiser选项，包括AMD Fidelity FX反射Denoiser，Nvidia的RayTracing Denoiser，以及两个自定义的内部Denoisers。在本文中，演示文稿以如何将射线tractac结果应用于最终图像上。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Animation Summit: Make a Choice: Performance Direction in 'Baldur's Gate 3'",
            "author": "Greg Lidstone ",
            "organization": "Larian Studios",
            "trackname": "Animation Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034783/Animation-Summit-Make-a-Choice",
            "index": 47,
            "overview": "Mocap and Performance direction have become an increasingly important part of narrative video game development over the past 20 years while players have steadily grown more discerning about digital acting. Larian invests heavily in character performance, and their recent blockbuster 'Baldur's Gate 3' has received rave reviews for the effort. But how did Larian arrive at those performances? How do performance directors help actors make choices when crafting the personality and physical behaviour of characters? How do they redirect and adjust when things aren't going well; inspire and encourage when they are. How do we inform, but not overwhelm and collaborate to build character with our actors? In this session, Larian's Performance Director speaks about techniques and approaches used on 'Baldur's Gate 3' (and built up over 20 years of directing) to prepare and work with actors for memorable performances.",
            "translated": "在过去的20年中，MOCAP和性能方向已成为叙事视频游戏开发的越来越重要的一部分，而玩家对数字表演越来越敏锐。拉里安（Larian）在角色表现上进行了大量投资，他们最近的大片“鲍德尔（Baldur）的大门3”（Baldur's Gate 3）获得了努力的好评。但是，拉里安（Larian）是如何表演的呢？在制定角色的个性和身体行为时，表演导演如何帮助演员做出选择？当事情进展顺利时，它们如何重定向和调整；何时启发和鼓励。我们如何告知但不淹没并合作与演员建立角色？在本次会议上，拉里安（Larian）的表演总监谈到了“鲍德尔（Baldur）的大门3”（并建立了20多年的导演）上使用的技术和方法，以准备和与演员合作，以表演令人难忘的表演。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Animation Summit: Thwips and Hugs: The Animation of 'Marvel's Spider-Man 2'",
            "author": "Lindsay Thompson ",
            "organization": "Insomniac Games",
            "trackname": "Animation Summit",
            "url": "https://gdcvault.com/free/gdc-24/play/1034543/Animation-Summit-Thwips-and-Hugs",
            "index": 48,
            "overview": "Join the esteemed team of Insomniac Animation Directors as they guide you on an immersive journey behind the scenes, offering a deeper exploration of the creative process behind Marvel's Spider-Man 2's animated world. From the intricacies of cinematic Quick Time Events (QTEs) to the technical and creative process of bringing ASL to the screen, they delve into both the technical challenges and creative triumphs encountered along the way. Additionally, they provide an in-depth glimpse into one of our most ambitious boss missions to date. Through this presentation, the teams aims to unveil the 'Insomniac Way,' shedding light on the inner workings and accomplishments of our animation team.",
            "translated": "加入著名的失眠动画导演团队，指导您进入幕后的身临其境的旅程，从而更深入地探索Marvel的Spider-Man 2动画世界背后的创作过程。从电影快速时间事件（QTE）的复杂性到将ASL带入屏幕的技术和创造过程，他们都深入研究了沿途遇到的技术挑战和创造性的胜利。此外，他们深入了解了迄今为止我们最雄心勃勃的老板任务之一。通过此演讲，团队的目标是揭露“失眠方式”，阐明了我们动画团队的内部运作和成就。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "'Asgards Wrath 2': How We Built VR's Largest Open-World RPG (Presented b...",
            "author": "Chris Pruett ",
            "organization": "Meta",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034698/-Asgards-Wrath-2-How",
            "index": 3,
            "overview": "Asgard's Wrath 2 is a full-fledged open-world RPG built from the ground up for VR. Players explore an epic, living world in this massive action RPG that IGN called a \"10/10 masterpiece.\" Join Sanzaru Games as the team shares how they developed one of the largest, most complex, and most well-reviewed VR games of all time. Technical, design, and business: this session is a deep dive into what the high end of VR development looks like.",
            "translated": "阿斯加德（Asgard）的《愤怒2》（Asgard's Wrath 2）是从头开始为VR构建的成熟的开放世界RPG。玩家在这个巨大的动作RPG中探索了一个史诗般的生活世界，该世界称为“ 10/10杰作”。加入Sanzaru Games，因为他们分享了他们如何开发有史以来最大，最复杂，最精心审视的VR游戏之一。技术，设计和业务：本届会议深入了解VR开发的高端外观。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "'Brawl Stars': Learnings from the Removal of Loot Boxes",
            "author": "Frank Yan ",
            "organization": "Supercell",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034813/-Brawl-Stars-Learnings-from",
            "index": 5,
            "overview": "Frank Keienburg, General Manager for 'Brawl Stars' and Frank Yan, Game Designer of 'Brawl Stars' discusses the process of removing lootboxes from Brawl Stars entirely and how the game became less engaging as a result. They cover what they did in the year since and the subsequent results, speaking to the impact of randomized rewards for the game as well as how they analyze what's right for the game using a combination of community sentiment, data, and designer intuition.",
            "translated": "“ Brawl Star”的总经理Frank Keienburg和“ Brawl Stars”的游​​戏设计师Frank Yan讨论了完全从Brawl Stars中删除掠夺盒的过程，结果如何变得越来越吸引人。他们涵盖了从那以后的一年中所做的事情以及随后的结果，对随机奖励对游戏的影响以及他们如何使用社区情感，数据和设计师直觉的结合来分析游戏的正确性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "'Brawl Stars': Learnings from the Removal of Loot Boxes",
            "author": "Frank Yan ",
            "organization": "Supercell",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034604/-Brawl-Stars-Learnings-from",
            "index": 6,
            "overview": "Frank Keienburg, General Manager for 'Brawl Stars' and Frank Yan, Game Designer of 'Brawl Stars' discusses the process of removing lootboxes from Brawl Stars entirely and how the game became less engaging as a result. They cover what they did in the year since and the subsequent results, speaking to the impact of randomized rewards for the game as well as how they analyze what's right for the game using a combination of community sentiment, data, and designer intuition.",
            "translated": "“ Brawl Star”的总经理Frank Keienburg和“ Brawl Stars”的游​​戏设计师Frank Yan讨论了完全从Brawl Stars中删除掠夺盒的过程，结果如何变得越来越吸引人。他们涵盖了从那以后的一年中所做的事情以及随后的结果，对随机奖励对游戏的影响以及他们如何使用社区情感，数据和设计师直觉的结合来分析游戏的正确性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "2D and Tomorrow: How the Developers of 'Super Mario Bros. Wonder' Find N...",
            "author": "Shiro Mouri ",
            "organization": "Nintendo Co., Ltd.",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034668/2D-and-Tomorrow-How-the",
            "index": 15,
            "overview": "Following last year's launch of the Super Mario Bros.TM Wonder game, developers Takashi Tezuka and Shiro Mouri discuss the unique challenge of taking classic side-scrolling Super Mario Bros. gameplay and turning it upside downliterally. The developers explain how the game's new elements such as Wonder effects that flip, spin and transform the game's Flower Kingdom world draw inspiration from Mario's 2D past but deliver unexpected new surprises for players to discover. Mr. Tezuka and Mr. Mouri will also share insights on the game's creative first steps, how they expanded player choice options and the process of adding a new online experience to the game. Wowie Zowie!",
            "translated": "在去年推出了Super Mario Bros.tm Wonder游戏之后，开发人员Takashi Tezuka和Shiro Mouri讨论了参加经典的Super Super Mario Bros.游戏玩法的独特挑战，并将其倒置。开发人员解释了游戏的新元素，例如如何翻转，旋转和改变游戏的Flower Kingdom World从Mario的2d过去汲取灵感，但给玩家带来了意想不到的新惊喜。Tezuka先生和Mouri先生还将分享有关游戏创意的第一步的见解，他们如何扩展玩家选择选项以及为游戏添加新的在线体验的过程。哇Zowie！"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "3D Gaussian Splatting in Game Development: What Internet Doesn't Tell Yo...",
            "author": "Jack Wang ",
            "organization": "KIRI Innovations",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034682/3D-Gaussian-Splatting-in-Game",
            "index": 16,
            "overview": "AI and Neural Networks have stormed the 3D industry in the last couple of years, introducing us to a myriad of innovative technologies like NeRFs, NeuS, NeuralAngelo, and 3D Gaussian Splatting. These technologies all promise to create photorealistic 3D assets from photos or videos, but are they all they're claimed up to be? Amidst the dazzling social media posts and research papers, actual 3D creators and game developers rarely have the opportunity nor the skills to try them. In this presentation, we'll embark on a journey through these cutting-edge technologies, aiming to demystify 3D Gaussian Splatting and its counterparts. By the end of this session, you'll not only understand the significance of 3D Gaussian Splatting but also appreciate its limitations. Our aim is to equip you with a deeper understanding of these technologies and a glimpse into the exciting future of 3D in the world of game development.",
            "translated": "在过去的几年中，AI和神经网络席卷了3D行业，向我们介绍了无数的创新技术，例如Nerfs，Neus，Neurangelo和3D高斯分裂。这些技术都承诺从照片或视频中创建感性的3D资产，但是它们是所有人所声称的吗？在令人眼花soci乱的社交媒体帖子和研究论文中，实际的3D创建者和游戏开发人员很少有机会，也没有尝试它们的技能。在本演讲中，我们将踏上这些尖端技术的旅程，旨在揭开3D高斯分裂及其同行的神秘面纱。到本次会议结束时，您不仅可以理解3D高斯分裂的重要性，而且还要理解其局限性。我们的目的是使您对这些技术有更深入的了解，并瞥见游戏开发世界中3D令人兴奋的未来。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "A Second Shot: Improving Ranged Combat in 'The Last of Us Part II'",
            "author": "Derek Mattson ",
            "organization": "Naughty Dog",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034314/A-Second-Shot-Improving-Ranged",
            "index": 20,
            "overview": "Third-person shooters are a notoriously difficult nut to crack in game design. The decoupling of the camera from the player creates as many problems as ways to solve them. In this session, discover how Naughty Dog improved the gunplay of its predecessor in The Last of Us Part II. Derek Mattson goes over the solutions used in The Last of Us Part II to address common issues with third-person shooters such as camera vs character perception, weapon feel, hit detection, and input delay. In addition, Derek provides a glimpse into how these solutions were tested and verified with in-engine debugging.",
            "translated": "第三人称射击游戏在游戏设计中很难破解。摄像机与播放器的脱钩会产生与解决这些问题一样多的问题。在本次会议上，发现顽皮的狗如何改善我们最后一部分的前身的枪声。德里克·马特森（Derek Mattson）介绍了第二部分中使用的解决方案，以解决第三人称射击者（例如角色感知，武器感觉，命中率，检测和输入延迟）的常见问题。此外，德里克（Derek）瞥见了如何通过发动机调试对这些解决方案进行测试和验证。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Alpha Puzzles + Shipped Solutions: Exploring Design Direction Across a P...",
            "author": "Francisco Souki ",
            "organization": "Schell Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034413/Alpha-Puzzles-Shipped-Solutions-Exploring",
            "index": 45,
            "overview": "Using footage from the alpha and final builds of the game, I Expect You To Die 3 Design Director Francisco Souki walks attendees through the design work of taking a level from halfway-done to final. \"Before-and-after\" comparisons illustrate specific solutions, and Francisco shares details on defining and directing the processes used to identify the problems to solve with the alpha build, and how to work with the team to define a plan for solutions.",
            "translated": "使用Alpha和游戏的最终构建的录像，我希望您能在3个设计总监Francisco Souki Walks参与者中死亡，其中包括从中途完成的设计工作。“前后”比较说明了特定的解决方案，而弗朗西斯科（Francisco）分享了定义和指导用于确定与Alpha构建解决问题的过程的详细信息，以及如何与团队合作以定义解决方案计划。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Balancing the Scales: Enabling Player Safety Without Compromising Privac...",
            "author": "Mike Pappas ",
            "organization": "Modulate",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034753/Balancing-the-Scales-Enabling-Player",
            "index": 69,
            "overview": "Delve into the nuanced tension between the imperative of safeguarding user experiences and the equally crucial need to protect user privacy, and how this tension is informed and altered by recent and upcoming online safety regulations. This in-depth conversation covers a variety of pressing topics, from the ethical considerations surrounding data collection for content moderation to the specific challenges posed by minors and Personally Identifiable Information (PII). Furthermore, the panel addresses legal obligations, including what actions are requisite under the duty of care to usersa duty that varies significantly across jurisdictions. The panel will also examine upcoming regulations that game studios need to be prepared for. This session is especially relevant for developers and platform owners seeking to navigate these murky waters, providing insights into crafting safer online spaces without crossing the boundary into surveillance.",
            "translated": "深入研究保护用户体验的必要性与保护用户隐私同样至关重要的需求之间的细微趋势，以及如何通过最近和即将到来的在线安全法规来告知和改变这种张力。从围绕数据收集的数据收集到未成年人和个人身份信息（PII）所面临的特定挑战（PII）的特定挑战，这一深入的对话涵盖了各种紧迫的主题。此外，该小组还涉及法律义务，包括在司法管辖区各义务承担责任的必要责任。该小组还将检查游戏工作室需要准备的即将到来的法规。本届会议与寻求浏览这些模糊水域的开发人员和平台所有者尤其重要，从而提供了洞察力，以洞悉更安全的在线空间，而不会越过边界进行监视。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Building and scaling MONOPOLY GO!, the #1 casual game launch of 2023 (Pr...",
            "author": "Avram Lyon ",
            "organization": "Monopoly Go!",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034914/Building-and-scaling-MONOPOLY-GO",
            "index": 74,
            "overview": "In April 2023, Scopely debuted MONOPOLY GO!, which instantly captivated millions of players around the world and became the biggest mobile game launch of 2023. Underpinning MONOPOLY GO!'s record-breaking success is Scopely's Playgami technology, connecting a massive global community spanning more than 120 countries. In this session, the architects of MONOPOLY GO! share key learnings from the development and global scaling of the game, including how Playgami's GameMaker Server framework builds on core AWS services like Amazon DynamoDB, Amazon RDS, and Amazon SQS to achieve smooth operations and rapid iteration. Learn how these choices allow the team to scale and deliver exceptional experiences to millions of MONOPOLY tycoons every day.",
            "translated": "2023年4月，Scopely首次垄断了！，它立即吸引了全球数百万球员，并成为2023年最大的手机游戏发射。支撑纪录的纪录成功是Scopely的Playgami技术，连接了一个庞大的全球社区跨越超过120个国家。在本届会议中，垄断的建筑师！从游戏的开发和全球扩展中分享关键学习，包括Playgami的GameMaker Server框架如何建立在Amazon DynamoDB，Amazon RDS和Amazon SQ等核心AWS服务上，以实现平稳的操作和快速迭代。了解这些选择如何允许团队每天为数百万垄断大亨扩展并提供出色的体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Building Safe and Prosocial Game Platforms (Presented by Community Clubh...",
            "author": "Daniel Cook ",
            "organization": "Spry Fox",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034746/Building-Safe-and-Prosocial-Game",
            "index": 78,
            "overview": "This panel invites you to a thought-provoking discussion centered on a pivotal question: What if we integrated safety directly into game platform design, rather than addressing toxicity and abuse as afterthoughts? Our panelists, each offering distinct insights, will delve into the potential of game platforms rooted in safety-first principles. We'll explore how platforms, when equipped with features intentionally designed to prevent abuse, help in enhancing player satisfaction and boosting player retention and engagement.nnThe conversation will span various approaches to designing robust, safe systems that proactively address and prevent conflict, while establishing clear safety boundaries. Additionally, we will explore the critical role of giving players control and consent mechanisms, essential in cultivating a secure gaming environment. This session aims to shed light on the vital yet often overlooked intersection of safety, user experience, and community engagement in game design.",
            "translated": "该小组邀请您参加以一个关键问题为中心的发人深省的讨论：如果我们直接将安全性直接整合到游戏平台设计中，而不是像事后思考那样解决毒性和虐待？我们的小组成员，每个提供独特的见解，都将深入研究以安全优先原则为基础的游戏平台的潜力。我们将探讨平台如何配备有意旨在防止滥用的功能，帮助增强球员满意度并提高球员的保留和参与度。nnnnnn Nn将涵盖各种方法来设计可靠的安全系统，以主动解决和防止冲突，同时建立冲突，同时建立冲突，同时建立冲突清晰的安全边界。此外，我们将探讨给玩家控制和同意机制的关键作用，这对于培养安全的游戏环境至关重要。本届会议旨在阐明安全，用户体验和社区参与游戏设计的至关重要但经常被忽视的交汇处。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Classic Game Postmortem: 'Karateka'",
            "author": "Jordan Mechner ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034209/Classic-Game-Postmortem-Karateka",
            "index": 87,
            "overview": "Before Prince of Persia, there was Karateka. Released in 1984, the directorial debut of game creator Jordan Mechner was a worldwide hit, full of groundbreaking innovations in story, cinematics, music, and animation. It was also the work of an unknown teenager looking to break into the game industry. Forty years later, Jordan discusses how he pushed the limits of Apple II technology to create his breakthrough success. Through original design documents, film footage, prototype gameplay, and more, Jordan tells the story of how he developed his craft as an independent game developer and brought the illusion of life to computer screens around the world with Karateka.",
            "translated": "在波斯王子之前，有空手道。游戏创作者乔丹·梅切纳（Jordan Mechner）的导演首次亮相于1984年发行，在全球范围内，充满了故事，电影，音乐和动画的开创性创新。这也是一个希望闯入游戏行业的未知少年的工作。四十年后，乔丹讨论了他如何推动Apple II技术的极限以创造突破性的成功。通过原始的设计文档，电影镜头，原型游戏玩法等等，约旦讲述了他如何发展自己作为独立游戏开发人员的手艺，并将生活的幻想带到了Karateka的世界各地的计算机屏幕上。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Converging Game Design and AI: New Frontiers and Pitfalls",
            "author": "Hilary Mason ",
            "organization": "Hidden Door",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034169/Converging-Game-Design-and-AI",
            "index": 93,
            "overview": "Although it's a hot topic now, AI and machine learning have existed in and outside of games for many years! To fully grasp the power of AI to transform game development, we have to understand how it works and where it's best put to use.Hilary Mason, Co-Founder and CEO at Hidden Door, gives attendees a peek behind the hidden door of AI's current integration into game development. In this session, she outlines the current state of AI as a game dev tool and explains its strengths and shortcomings. Hilary then presents potential solutions for common AI challengessuch as filtering out bad outputs and carefully handling the ethics of AI's use of copyrighted material. She then discusses how to assemble the ultimate AI game development dream team, merging the powers of man and machine to create entirely new gaming experiences.",
            "translated": "尽管现在这是一个热门话题，但多年来，AI和机器学习已经存在和外部！要完全掌握AI改变游戏开发的力量，我们必须了解它的工作原理以及最好的使用方式。HillaryMason，Hidden Door的联合创始人兼首席执行官，让与会者在AI当前的隐藏门后面窥视集成到游戏开发中。在本届会议上，她概述了AI的当前状态作为游戏开发工具，并解释了其优势和缺点。然后，希拉里（Hilary）为普通的AI挑战提供了潜在的解决方案，因为它可以过滤不良的输出，并仔细处理AI使用受版权保护材料的伦理。然后，她讨论了如何组装最终的AI游戏开发梦想团队，将人类和机器的力量融合在一起，以创造全新的游戏体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Crafting and Balancing the Story and Characters in 'Marvel's Spider-Man 2'",
            "author": "Jon Paquette ",
            "organization": "Insomniac Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034536/Crafting-and-Balancing-the-Story",
            "index": 94,
            "overview": "'Marvel's Spider-Man 2' is the third game in a franchise that has built its own universe of intersecting characters and stories (Earth-1048). How does the story team at Insomniac balance the needs of the story with the ever-changing demands of the audience? In this talk, Senior Narrative Director Jon Paquette takes you through Insomniac's process, and how the team relies on feedback to help drive their storytelling craft.",
            "translated": "“ Marvel's Spider-Man 2”是特许经营中的第三款游戏，该系列建立了自己的相交角色和故事（Earth-1048）。Insomniac的故事团队如何平衡故事的需求与观众的不断变化的需求？在这次演讲中，高级叙事总监乔恩·帕奎特（Jon Paquette）将带您完成Insomniac的过程，以及团队如何依靠反馈来帮助推动他们的讲故事的工艺。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Designing Active Time Lore for 'Final Fantasy XVI'",
            "author": "Momoka Aono ",
            "organization": "Square Enix Co., Ltd.",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034418/Designing-Active-Time-Lore-for",
            "index": 104,
            "overview": "For a story-driven game which has heavy and complex lore, players' understanding the in-game world leads to deeper immersion, but the in-game terminology and unique world rules sometimes make players feel that it's hard to grasp the background.nWhile fantasy games often use glossary and texts to introduce the in-game world's rules, what people's common sense is, or lots of characters and place names that difficult to remember, most players, except the ones who are interested in lore, rarely reads them.nIn this session, we will demonstrate how UIs can help players better understand the story of the game through examples of the lore support system called \"Active Time Lore\", invented for FINAL FANTASY XVI.nActive Time Lore helps players with a selection of lore tips they need \"at the moment\" by responding to input a player's pausing during a cutscene or gameplay.",
            "translated": "对于故事驱动的游戏具有沉重而复杂的知识，玩家的理解游戏中的世界会导致更深的沉浸式，但是游戏中的术语和独特的世界规则有时会使玩家感到很难掌握背景。游戏经常使用词汇表和文本来介绍游戏中的世界规则，人们的常识是什么，或者很多难以记住的角色和位置名称，除了对知识感兴趣的人以外，大多数玩家很少阅读他们。在本届会议上，我们将展示UIS如何通过称为“ Active Time Lore”的传说支持系统的示例来帮助玩家更好地理解游戏的故事，该系统为《最终幻想》 XVI发明了，努力的传说可帮助玩家提供一系列知​​识的技巧。需要在过场动画或游戏玩法中响应输入玩家的暂停，需要“目前”。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Developing 'Hi-Fi RUSH' Backwards and Finding Our Positive Gameplay Loop",
            "author": "John Johanas ",
            "organization": "Tango Gameworks",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034256/Developing-Hi-Fi-RUSH-Backwards",
            "index": 106,
            "overview": "In this session, Game Director John Johanas shares how the initial concept for Hi-Fi RUSH came to be. From there, he provides in-depth details into the development team's early learnings on approaching this type of rhythm-action title. This required approaching their game design philosophy from a totally different angle than they've done previously, essentially working backwards from their desired result for Hi-Fi RUSH.John goes over specific examples of how the team gained these learnings through gameplay and how this approach affected other core elements of the game - specifically, how defining their mechanics with core pillars solidified a \"positive feedback loop\" for the user and lowered the barrier to entry to enjoy Hi-Fi RUSH. This session covers how Tango approached combining music and the action game genre, but this approach can be applied to any teams attempting to implement creative ideas outside of their comfort zone.",
            "translated": "在本次会议上，游戏总监约翰·约哈纳斯（John Johanas）分享了Hi-Fi Rush的最初概念。从那里，他提供了深入的细节，以了解开发团队关于接近这种节奏标题的早期知识。这需要从与以前完全不同的角度接近他们的游戏设计理念，从本质上讲是从他们期望的Hi-Fi Rush的结果中向后工作。John介绍了该团队如何通过游戏玩法获得这些学习的具体示例影响了游戏的其他核心元素 - 具体来说，如何用核心支柱定义他们的力学，为用户巩固了“正面反馈回路”，并降低了进入hi -fi rush的进入的障碍。本届会议涵盖了探戈如何将音乐和动作游戏类型组合在一起的方式，但是这种方法可以应用于试图在舒适区之外实施创意的任何团队。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Experimental Game Workshop",
            "author": "Jake Weidner ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034919/Experimental-Game",
            "index": 126,
            "overview": "The Experimental Game Workshop, which has featured games like Baba Is You, Braid, Untitled Goose Game, and Card Shark is back for its 22nd year at GDC.In this fast-paced, game-packed session, panelists will showcase a selection of surprising and intriguing games made by innovation-minded game developers from all over the world. By demonstrating games that defy conventions and traditions in search of new genres and ideas, this session aims to ignite the imagination of all game makers. Come see what's happening in the world of Experimental Games, and be inspired!",
            "translated": "实验游戏研讨会曾在诸如Baba是您，辫子，无标题的鹅游戏和纸牌鲨鱼等游戏中进行的游戏研讨会，并在GDC上回来了22年。以及来自世界各地的创新游戏开发人员制作的有趣游戏。通过展示违背惯例和传统来寻找新类型和想法的游戏，本届会议旨在激发所有游戏制造商的想象力。快来看看实验游戏世界中正在发生的事情，并受到启发！"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Experimental Game Workshop",
            "author": "Jake Weidner ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034675/Experimental-Game",
            "index": 127,
            "overview": "The Experimental Game Workshop, which has featured games like Baba Is You, Braid, Untitled Goose Game, and Card Shark is back for its 22nd year at GDC.In this fast-paced, game-packed session, panelists will showcase a selection of surprising and intriguing games made by innovation-minded game developers from all over the world. By demonstrating games that defy conventions and traditions in search of new genres and ideas, this session aims to ignite the imagination of all game makers. Come see what's happening in the world of Experimental Games, and be inspired!",
            "translated": "实验游戏研讨会曾在诸如Baba是您，辫子，无标题的鹅游戏和纸牌鲨鱼等游戏中进行的游戏研讨会，并在GDC上回来了22年。以及来自世界各地的创新游戏开发人员制作的有趣游戏。通过展示违背惯例和传统来寻找新类型和想法的游戏，本届会议旨在激发所有游戏制造商的想象力。快来看看实验游戏世界中正在发生的事情，并受到启发！"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Game Development Workshop 1 - Design & Build (Presented by Community Clu...",
            "author": "Josh Loveridge ",
            "organization": "Stratton Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034758/Game-Development-Workshop-1-Design",
            "index": 180,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Game Development Workshop 2 - Develop & Test (Presented by Community Clu...",
            "author": "Josh Loveridge ",
            "organization": "Stratton Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034760/Game-Development-Workshop-2-Develop",
            "index": 181,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Game Development Workshop 3 - Launch & Scale (Community Clubhouse)",
            "author": "Josh Loveridge ",
            "organization": "Stratton Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034761/Game-Development-Workshop-3-Launch",
            "index": 182,
            "overview": ""
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Hyper-Personalization and the Future of AI-Enhanced Player Support (Pres...",
            "author": "Stephen Peacock ",
            "organization": "Keywords Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034731/Hyper-Personalization-and-the-Future",
            "index": 217,
            "overview": "In an era where AI is transforming how games are made and played, this session looks at the revolution in player support that these technologies are set to bring. The presenter delves into a future where games experiences are hyper-personalized and fully immersive, and player support is more critical than ever.",
            "translated": "在AI改变游戏方式的时代，本届会议着眼于这些技术将带来的革命支持。主持人深入研究了游戏体验超为个性化和完全沉浸式的未来，玩家的支持比以往任何时候都更为重要。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Little Hands, Foul Moods, and Runny Noses: Designing Games for Kids",
            "author": "Carla Engelbrecht ",
            "organization": "Betweened",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034397/Little-Hands-Foul-Moods-and",
            "index": 285,
            "overview": "Children have unique intellectual and physical needs that designers must take into account in order to create engaging gaming experiences. This session aims to help developers build a foundation of knowledge by uncovering existing research on children and technology from a variety of fields, including child developmental psychology, human computer interaction, television, and market research. The discussion will provide information on developmental psychology specific to games, UI design and input control considerations, co-play, and age-appropriate storytelling. While some guidelines will be device-specific, most recommendations provided can be easily applied to any children's game design product, regardless of platform.",
            "translated": "儿童有独特的智力和身体需求，设计师必须考虑这些需求，以创造引人入胜的游戏体验。本届会议旨在通过从各种领域（包括儿童发育心理学，人类计算机互动，电视和市场研究）揭示现有的有关儿童和技术的研究来帮助开发人员建立知识的基础。讨论将提供有关特定于游戏，UI设计和输入控制注意事项，共同游戏和适合年龄的讲故事的发育心理学的信息。尽管某些指南将是特定于设备的，但无论平台如何，提供的大多数建议都可以轻松地应用于任何儿童游戏设计产品。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Lore, Don't Tell: A Guide for Telling Culturally Rooted Stories Like 'Ve...",
            "author": "Abhi Swami ",
            "organization": "Visai Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034603/Lore-Don-t-Tell-A",
            "index": 289,
            "overview": "When players are unfamiliar with a culture, how do we tell a story that's rooted in it? It's a responsibility to ensure players who play the game leave with a deeper understanding of the culture, society, heritage and traditions we're showcasing. But the game we make has its own story to tell, and there might not be the space to be educating all players. It might also be tempting to explain and point out every aspect of the culture to ensure a player misses nothing, but this can do more harm than good. Thankfully, \"Lore\" is a very powerful tool that video games are great at that we can leverage to solve this problem. In this talk, Creative Director Abhi outlines various techniques used to follow a \"Lore, don't tell\" approach that let him not only be laser focused on the story he wanted to tell in Venba but also helped him shine a light on the culture he loves with all its details",
            "translated": "当玩家不熟悉一种文化时，我们如何讲一个植根于文化的故事？有责任确保玩游戏的玩家对我们展示的文化，社会，遗产和传统有更深入的了解。但是我们制作的游戏有自己的故事要讲，并且可能没有空间可以教育所有玩家。解释并指出文化的各个方面也可能很诱人，以确保玩家什么都没有错过，但这可能弊大于利。值得庆幸的是，“ Lore”是一个非常强大的工具，视频游戏非常出色，我们可以利用解决此问题。在这次演讲中，创意总监Abhi概述了遵循“传说，不要说出”的各种技术，这不仅让他专注于他想在Venba讲述的故事，而且还帮助他阐明了文化的启示他喜欢所有细节"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Making 'Assassin's Creed Nexus VR' Comfortable and Accessible",
            "author": "Olivier Palmieri ",
            "organization": "Ubisoft Montreal",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034320/Making-Assassin-s-Creed-Nexus",
            "index": 299,
            "overview": "Virtual Reality allows an amazing level of immersion in virtual worlds. But when it comes to locomotion, the ability to travel into these worlds may involve various degrees of discomfort, from fatigue to kinetosis (motion sickness). In Assassin's Creed Nexus VR, the open worlds of the game provide great opportunities for players to explore, parkour, climb, fight or go stealth, all of which presented unique challenges when designing a comfortable and accessible experience. The team presents the journey and share our experience working for several years on designing and building various features and presets to make the game comfortable and accessible for players. To conclude, the team presents features to help with potential fear of height, as players in Assassin's Creed Nexus VR will be able to parkour, climb and reach elevated heights, and can decide to experience the game's iconic leap of faith.",
            "translated": "虚拟现实允许在虚拟世界中吸收惊人的水平。但是，在运动方面，进入这些世界的能力可能涉及从疲劳到动力学的各种程度的不适（运动）。在刺客的信条Nexus VR中，游戏的开放世界为玩家提供了探索，跑跑，攀登，战斗或进行隐身的绝佳机会，在设计舒适且可访问的体验时，所有这些都面临着独特的挑战。团队展示了旅程，并分享了我们在设计和建立各种功能和预设方面工作多年的经验，以使游戏舒适且易于访问。总而言之，该团队提出了一些功能，以帮助潜在的高度恐惧，因为刺客信条Nexus VR的玩家将能够跑，攀登和达到高度，并决定体验游戏的标志性信仰飞跃。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Making Linear Story Playable: The Narrative Design of 'Alan Wake 2'",
            "author": "Simon Wasselin ",
            "organization": "Remedy Entertainment Oy",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034328/Making-Linear-Story-Playable-The",
            "index": 301,
            "overview": "Remedy has never shied away from complex stories and characters, and Alan Wake 2 features some of our most ambitious protagonists to date. When it came to putting players in the minds of both a talented FBI detective piecing together a supernatural mystery, and a tortured author attempting to write his way out of a web of darkness, Lead Narrative Designer Simon Wasselin (Quantic Dream) Principal Narrative Designer Molly Maloney (Telltale Games) had to tackle some big questions: How do we give players a satisfying interactive experience within the confines of a linear story that can't budge? How do we allow for player expression when the protagonists are locked into specific roles? How can we leverage interactivity to incept complex, multilayered exposition into the minds of our audience?This talk focuses on the design of the narrative mechanics used to convey exposition in Alan Wake 2. Join us as we discuss the challenges of agency vs expression, linear vs branching storytelling, and how by involving Narrative Design in gameplay we can create more powerful story experiences in AAA games.",
            "translated": "补救措施从未避开复杂的故事和角色，艾伦·韦克（Alan Wake 2）2是我们迄今为止一些最雄心勃勃的主角。当涉及到一位才华横溢的联邦调查局侦探拼凑一个超自然的奥秘时，以及一位折磨的作家试图将自己的道路写出黑暗的网络，首席叙事设计师Simon Wasselin（Quantic Dream）主要叙事设计师Molly，马洛尼（Telltale Games）必须解决一些大问题：我们如何为玩家提供令人满意的互动体验，而在线性故事的范围内无法解决？当主角被锁定为特定角色时，我们如何允许玩家表达？我们如何将互动性利用构成复杂的多层博览会进入我们的观众的思想？这次演讲重点是用于在艾伦·韦克（Alan Wake 2VS分支讲故事，以及如何通过在游戏玩法中涉及叙事设计，我们可以在AAA游戏中创造更强大的故事体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Maximum Fun: How to Build More Playful Experience...",
            "author": "Averie Chvez ",
            "organization": "Meta",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034696/Meta-Developer-Summit-Maximum-Fun",
            "index": 311,
            "overview": "Discover how the latest developments in Meta Horizon Worlds have made it easier to create compelling experiences, to share unique social moments with friends, and to have fun. From interactive experiences based on pop culture, to social gaming adventures, learn more about the process of designing social VR worlds from Developer Studios and Meta Producers. This panel will discuss the advantages, challenges, trends and strategies for building immersive experiences in Meta Horizon Worlds that spark joy, and keep users coming back for more.",
            "translated": "了解Meta Horizo​​n世界中的最新发展如何使创造引人入胜的体验，与朋友分享独特的社交时刻并获得乐趣变得更加容易。从基于流行文化的互动体验到社交游戏冒险，请了解有关从开发人员工作室和元生产者设计社交VR世界的过程的更多信息。该小组将讨论在元地平线世界中建立沉浸式体验的优势，挑战，趋势和策略，这些世界会激发喜悦，并使用户回来更多。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Your Room is the Level: Mixing Realities in Meta'...",
            "author": "Alexander Dawson ",
            "organization": "Meta",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034692/Meta-Developer-Summit-Your-Room",
            "index": 314,
            "overview": "When building a mixed-reality game, crafting and harmoniously blending two worlds into a single space is a fundamental challenge. Designing a game that incorporates the player's room as part of the level means losing out on a lot of control that fully pre-authored level design grants developers.nnAs a pack-in launch title for the Quest 3, Meta's First Encounters wowed players by smashing apart and opening their rooms to another world. Learn how the game was designed to make careful & considered use of the player's space as a core element of the game's design. Discover how the development team approached interactively transforming the player's space through a mixture of scene understanding & at-runtime procedural generation.nnGame Designer Zachary Dawson and Game Programmer Alexander Dawson discuss the design, technical challenges, and solutions developed for turning every player's room into their own game world.",
            "translated": "在建立混合现实游戏时，制作并和谐地将两个世界融入一个空间是一个根本的挑战。设计一个将玩家房间作为水平的游戏的游戏，意味着在许多人的控制中输掉完全撰稿的级别设计授予开发人员。NNAS为QUESP 3的封装启动标题，Meta的首次遇到的播放器通过粉碎而震惊分开，并向另一个世界开放房间。了解如何设计游戏来仔细并考虑将玩家的空间作为游戏设计的核心元素。发现开发团队如何通过融合场景的理解和到期时间的程序生成来互动地转换玩家的空间。自己的游戏世界。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next-Gen Tech Forum: Building Peridot, The World's First AR Only Game (P...",
            "author": "Justin Sneddon ",
            "organization": "Niantic",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034728/Next-Gen-Tech-Forum-Building",
            "index": 324,
            "overview": "Join Justin Sneddon, Niantic Group Product Manager, to learn how they built Peridot with Lightship's Augmented Reality Developer Kit. He'll spotlight some of the key features used to make these lovable creatures live in and interact with the real world including meshing, semantics, and occlusion, and shed light on the LLM techniques utilized to bring individual personality to each creature.",
            "translated": "加入Niantic Group产品经理Justin Sneddon，以了解他们如何使用Lightship的增强现实开发人员Kit建造橄榄石。他将聚焦一些用于使这些可爱的生物生活并与现实世界互动的一些关键特征，包括网格，语义和遮挡，并阐明用于将个人个性带给每个生物的LLM技术。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next-Gen Tech Forum: Keep It Simple, Make It Fun: Creative Thinking With...",
            "author": "Kwan Cheng ",
            "organization": "NetEase Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034748/Next-Gen-Tech-Forum-Keep",
            "index": 326,
            "overview": "With 100 million monthly active players, 100 million playground maps, and a milestone of 500 million Eggies, \"Eggy Party\" has achieved remarkable success since its launch. The producer will share their learnings from the development process, as well as insights into user-generated content.",
            "translated": "自推出以来，“ Eggy Party”拥有1亿个活跃的球员，1亿个游乐场地图以及5亿个鸡蛋的里程碑，其成功取得了巨大的成功。生产者将从开发过程中分享他们的学习，以及对用户生成的内容的见解。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next-Gen Tech Forum: Keep It Simple, Make It Fun: Creative Thinking With...",
            "author": "Kwan Cheng ",
            "organization": "NetEase Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034831/Next-Gen-Tech-Forum-Keep",
            "index": 327,
            "overview": "With 100 million monthly active players, 100 million playground maps, and a milestone of 500 million Eggies, \"Eggy Party\" has achieved remarkable success since its launch. The producer will share their learnings from the development process, as well as insights into user-generated content.",
            "translated": "自推出以来，“ Eggy Party”拥有1亿个活跃的球员，1亿个游乐场地图以及5亿个鸡蛋的里程碑，其成功取得了巨大的成功。生产者将从开发过程中分享他们的学习，以及对用户生成的内容的见解。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next-Gen Tech Forum: Own Your Creative Power: AI Workflows that Accelera...",
            "author": "Kent Keirsey ",
            "organization": "Invoke",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034642/Next-Gen-Tech-Forum-Own",
            "index": 329,
            "overview": "This session will explore the impact of integrating AI image generation into existing creative workflows for game development. We will demonstrate how AI image generation technology can be securely incorporated into production pipelines, while providing artists and designers the same level of creative freedom and control that they are accustomed to. We will showcase practical examples from creative teams who are leveraging their own proprietary content and intellectual property. nnAdditionally, we will address critical ethical and legal issues such as the use of copyrighted material, the automation of creative tasks, and implications for job security within the industry. This session aims to offer a balanced perspective, demonstrating how AI can be a powerful tool in the creative process while acknowledging and addressing the challenges it presents.",
            "translated": "本届会议将探讨将AI图像生成整合到现有创意工作流程中以进行游戏开发的影响。我们将展示如何将AI图像生成技术牢固地纳入生产管道中，同时为艺术家和设计师提供与他们所习惯的相同的创作自由和控制水平。我们将展示来自利用自己专有内容和知识产权的创意团队的实践例子。在不合理的情况下，我们将解决关键的道德和法律问题，例如使用受版权保护的材料，创造性任务的自动化以及对行业内部工作安全的影响。本届会议旨在提供平衡的观点，展示AI如何成为创作过程中的强大工具，同时承认并应对其提出的挑战。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Player Mythologies",
            "author": "Alexander Jaffe ",
            "organization": "Riot Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034812/Player",
            "index": 340,
            "overview": "Designers build games around player fantasies. These typically concern something the player \"pretends\" to be inside a game. But another kind of fantasy is often overlooked: \"Player Mythologies\". These are the narratives through which players view themselves as players. Explorer, spy, collector, artist - these archetypes don't just describe a character in a game. Remarkably, they sometimes describe the actual players, and how a specific game or genre fits into players' lives. By understanding these narratives, designers can gain profound insight into their players' mindset and motivation, reshaping traditional ideas of \"good\" and \"bad\" design.In this talk, Alex Jaffe introduces player mythologies, showing their impact and their root causes in subtle design choices. He then presents a case study on the player mythology of fighting games. He shows how this lens unlocked his work on Riot Games' 2XKO (formerly Project L), and illuminates the beauty of the genre along the way.",
            "translated": "设计师围绕玩家幻想建立游戏。这些通常涉及玩家“假装”在游戏中的事情。但是另一种幻想经常被忽略：“玩家神话”。这些是玩家将自己视为玩家的叙述。探险家，间谍，收藏家，艺术家 - 这些原型不仅描述了游戏中的角色。值得注意的是，他们有时描述了实际玩家，以及特定的游戏或流派如何适应玩家的生活。通过理解这些叙述，设计师可以深入了解球员的思维方式和动力，重塑传统的“好”和“坏”设计的思想。在这次演讲中，亚历克斯·贾夫（Alex Jaffe）介绍了玩家神话，表现出他们的影响力，并以微妙的方式表现出他们的根本原因设计选择。然后，他介绍了一项关于战斗游戏玩家神话的案例研究。他展示了该镜头如何解锁他在Riot Games的2XKO（以前是Project L）上的作品，并阐明了这一类型的美丽。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Relic Ruins: Creating Environmental Puzzles for 'Horizon Forbidden West'",
            "author": "Daniel Wewerinke ",
            "organization": "Guerrilla",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034875/Relic-Ruins-Creating-Environmental-Puzzles",
            "index": 347,
            "overview": "Horizon Forbidden West takes place in a massive open world filled with mysterious activities for players to encounter. Among such activities are the Relic Ruins: environmental puzzle spaces set in Horizon's ruins of the Old World, meant to challenge players to solve its mysteries. Senior Game Designer Daniel Wewerinke guides us through the design process for the Relic Ruins that players can find in Horizon Forbidden West as well as its DLC Burning Shores; from concept to block-outs, interdisciplinary work, playtesting, and iteration. He discusses both design challenges and lessons learned while aiming to create interesting, unique, and surprising puzzle spaces for the players.",
            "translated": "Horizo​​n Forbidden West发生在一个庞大的开放世界中，充满了神秘的活动，供玩家遇到。这样的活动包括遗物遗迹：地平线遗址中的环境难题空间，旨在挑战玩家解决其奥秘。高级游戏设计师Daniel Wewerinke指导我们进行遗物遗迹的设计过程，玩家可以在Horizo​​n Forbidding West及其DLC燃烧的海岸上找到这些废墟；从概念到阻止，跨学科工作，游戏测试和迭代。他讨论了设计挑战和经验教训，同时旨在为玩家创造有趣，独特和令人惊讶的拼图空间。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Revisiting Fun: 20 Years of \"A Theory of Fun\"",
            "author": "Raph Koster ",
            "organization": "Playable Worlds",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034362/Revisiting-Fun-20-Years-of",
            "index": 350,
            "overview": "A Theory of Fun for Game Design was first published twenty years ago. Today, it's required reading in game design programs all over the world. But times have changed! Our craft knowledge has evolved! nnThis talk will give an update on the latest science, discuss the impact of the book, and explore unexpected ways in which the original core idea continues to affect how we make games. Most importantly, it will give you new tools to tackle what is still the hardest problem in game design: making things fun.",
            "translated": "二十年前首次出版了一种游戏设计理论。如今，这需要阅读世界各地的游戏设计程序。但是时代已经改变了！我们的手工艺知识发展了！nnththis Talk将提供有关最新科学的最新信息，讨论本书的影响，并探讨原始核心想法继续影响我们制作游戏的意外方式。最重要的是，它将为您提供新的工具来解决游戏设计中最困难的问题：使事情变得有趣。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Start Right, Start Fun: Unveiling the Theory to Crafting the Onboarding ...",
            "author": "Fan Yi ",
            "organization": "Tencent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034824/Start-Right-Start-Fun-Unveiling",
            "index": 356,
            "overview": "This session presents insights gathered from user research and product development practices across 100+ F2P mobile games spanning various categories and regions over the last eight years. nThe team will share their methodology and user insights on game onboarding research, highlighting the \"A-G-E\" Model. The \"A\" represents \"Attraction,\" driving player engagement, \"G\" signifies \"Goal,\" guiding player motivation, and \"E\" measures the \"Effectiveness\" of tutorials. By drawing on practical project experience, the session will showcase how the AGE model enhances onboarding experiences in F2P games.",
            "translated": "本届会议介绍了过去八年中100多个F2P手机游戏的用户研究和产品开发实践中收集的见解。N该团队将分享他们的方法论和用户洞察力，对游戏入门研究，突出显示“ A-G-E”模型。“ a”代表“吸引力”，“驱动器参与度”，“ G”表示“目标”，指导球员的动机和“ E”衡量教程的“有效性”。通过利用实践项目的经验，会议将展示年龄模型如何增强F2P游戏中的入门体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Start Right, Start Fun: Unveiling the Theory to Crafting the Onboarding ...",
            "author": "Fan Yi ",
            "organization": "Tencent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034684/Start-Right-Start-Fun-Unveiling",
            "index": 357,
            "overview": "This session presents insights gathered from user research and product development practices across 100+ F2P mobile games spanning various categories and regions over the last eight years. nThe team will share their methodology and user insights on game onboarding research, highlighting the \"A-G-E\" Model. The \"A\" represents \"Attraction,\" driving player engagement, \"G\" signifies \"Goal,\" guiding player motivation, and \"E\" measures the \"Effectiveness\" of tutorials. By drawing on practical project experience, the session will showcase how the AGE model enhances onboarding experiences in F2P games.",
            "translated": "本届会议介绍了过去八年中100多个F2P手机游戏的用户研究和产品开发实践中收集的见解。N该团队将分享他们的方法论和用户洞察力，对游戏入门研究，突出显示“ A-G-E”模型。“ a”代表“吸引力”，“驱动器参与度”，“ G”表示“目标”，指导球员的动机和“ E”衡量教程的“有效性”。通过利用实践项目的经验，会议将展示年龄模型如何增强F2P游戏中的入门体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "System-Centric Puzzle Design in 'Patrick's Parabox'",
            "author": "Patrick Traynor ",
            "organization": "Independent",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034415/System-Centric-Puzzle-Design-in",
            "index": 375,
            "overview": "The designer of the IGF award-winning puzzle game Patrick's Parabox shares a collection of puzzle game design techniques used and learned during its development. These include: heuristics for iterating on mechanics, strategies for creating puzzle levels, and things to look out for when playtesting. These techniques are illustrated with examples from the development of Patrick's Parabox, and are also tied into the core design pillar of the game: showcasing the recursive puzzle system. The talk is framed as a mini-postmortem of the game, focusing just on its design.",
            "translated": "IGF屡获殊荣的益智游戏帕特里克（Patrick）的Parabox的设计师分享了一系列拼图游戏设计技术，并在其开发过程中学习了。这些包括：迭代机制，创建拼图水平的策略以及在测试时要寻找的东西。这些技术用帕特里克（Patrick's Parabox）开发的示例进行了说明，并且还与游戏的核心设计支柱相连：展示递归拼图系统。演讲被框起来是游戏的迷你柱子，仅着眼于其设计。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Teaching Complex Games: Onboarding Redesign for 'Rainbow Six Siege'",
            "author": "Marc Ballart Germ ",
            "organization": "Ubisoft Barcelona",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034331/Teaching-Complex-Games-Onboarding-Redesign",
            "index": 380,
            "overview": "Rainbow Six Siege is an extremely complex, ever-changing live game that if it wants to keep increasing and maintaining its community in the future, it requires to welcome correctly their new players to the game. This keynote aims to comprise what was needed to be done in terms of onboarding and early player journey to cover the needs of a newcomer while starting to play, the skills that were required to develop to become competent and how to retain them while doing so.",
            "translated": "Rainbow Six Siege是一款极其复杂，不断变化的现场游戏，如果它希望将来不断增加和维护社区，则需要正确欢迎他们的新玩家参加游戏。该主题演讲旨在包括在开始比赛时涵盖新手的需求，以满足新手的需求的方面需要做的事情，发展有能力的技能以及如何在这样做的同时保留他们。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The 30-Second 'Roblox' Rule: How to Hook the Next Generation of Gamers",
            "author": "Taylor Field-Draper ",
            "organization": "Gamefam",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034302/The-30-Second-Roblox-Rule",
            "index": 386,
            "overview": "In this session, Taylor highlights the four fundamental pillars of Roblox development that we follow at Gamefam discussing strategies on how to obtain, retain and grow an active player base, and how to spark the organic growth of an enthusiastic community surrounding your experience. He will compare and contrast critical distinctions between building a successful experience on Roblox that leads to higher conversion rates and player retention, and discuss the unique preferences and expectations of Roblox users which often contradict traditional game design methodology. Throughout, Taylor shows key takeaways following his work at Gamefam on the launch of 3 of the top 5 highest-rated Roblox virtual concerts of all time (Saweetie Super Bowl Concert, 24kGoldn & The Chainsmokers), as well as breakdowns of the two most popular branded games on the platform (Sonic Speed Simulator & Barbie Dreamhouse Tycoon).",
            "translated": "在本届会议上，泰勒强调了我们在GameFam上遵循的Roblox开发的四个基本支柱，讨论了如何获得，保留和发展活跃的玩家群的策略，以及如何激发围绕您经验的热情社区的有机成长。他将在Roblox上建立成功的经验，从而导致更高的转化率和球员的保留，并讨论Roblox用户的独特偏好和期望，这些偏好和期望通常与传统的游戏设计方法相矛盾。在整个过程中，泰勒（Taylor）在GameFam上的工作表现出关键的外卖，这是有史以来最高5位最高的Roblox虚拟音乐会中的3场（Saweetie Super Bowl Concert，24kgoldn＆The Chainsmokers），以及两个最受欢迎的崩溃平台上的品牌游戏（Sonic Speed Simulator＆Barbie Dreamhouse Tycoon）。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Future of MR Experiences: Everything You Ever Wanted to Know About B...",
            "author": "Jesse Schell ",
            "organization": "Schell Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034697/The-Future-of-MR-Experiences",
            "index": 395,
            "overview": "Mixed Reality is the next frontier of immersive simulation technology. But it is so new, there are many questions about it: How is it different from VR? What are its strengths and weaknesses? Who will use it, and why? What can MR do now, and what will it be able to do in the future? In this talk, game industry veteran Jesse Schell uses his thirty years of VR and AR experience to illustrate where this technology is now, where it is headed, and how by understanding the psychology of mixed reality you can successfully avoid pitfalls and invent the future of gaming.",
            "translated": "混合现实是沉浸式仿真技术的下一个前沿。但是它是如此新，有很多问题：它与VR有何不同？它的优点和缺点是什么？谁会使用它，为什么？先生现在可以做什么？将来它将做什么？在这次演讲中，游戏行业的资深杰西·谢尔（Jesse Schell）利用他的30年的VR和AR经验来说明这项技术现在的位置，它的发展方向以及如何通过理解混合现实的心理学，您可以成功避免陷阱并发明陷阱并发明未来赌博。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The PM's Dilemma - Striking a Healthy Balance when Managing Live Games (...",
            "author": "Solomon Ruiz-Lichter ",
            "organization": "CleverTap",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034917/The-PM-s-Dilemma-Striking",
            "index": 405,
            "overview": "In today's games market, Product Managers need to be more efficient than ever in how they deploy resources and spend their time. Managing Live Games requires a balance of retaining mature players with evergreen content and personalized offers, but also attracting new players and getting them into your core loop as fast as possible. It's not easy. Join CleverTap Gaming for an objective analysis on the various approaches game teams can take when choosing how to power LiveOps and manage their games.",
            "translated": "在当今的游戏市场中，产品经理需要比以往任何时候都更有效地部署资源并花费时间。管理现场游戏需要保持平衡，以保持具有常绿内容和个性化报价的成熟玩家，同时还可以吸引新玩家并尽快将他们带入您的核心循环。这并不容易。加入Clevertap游戏，对游戏团队选择如何为现场演出和管理游戏的各种方法进行客观分析。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Strange Within the Familiar How 'Once Human' Designed its Supernatur...",
            "author": "Peng Sun ",
            "organization": "NetEase Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034676/The-Strange-Within-the-Familiar",
            "index": 409,
            "overview": "Once Human received positive reviews in the beta test that ended in January, thanks to its unique art style for monsters and scenes. The most talked-about aspect of the game is the unique design of the \"living machines\" monsters and abnormal environment. This presentation will break down the design process of some most popular monsters and points of interest in Once Human, and elaborate on how we use the \"familiar + strange\" design approach to systematically and agilely move forward with the design process, and portray the high-level world and narrative design through visual and interactive experiences. Additionally, we will showcase specific examples of incorporating player suggestions into the game content and discuss the importance of the \"collaborative design\" in game development.",
            "translated": "一旦人类在1月结束的Beta测试中获得了积极的评论，这要归功于其独特的怪物和场景艺术风格。游戏中最容易说的方面是“活机”怪物和异常环境的独特设计。本演示文稿将分解一些最受欢迎的怪物和兴趣点的设计过程，并详细说明我们如何使用“熟悉 +奇怪”的设计方法来系统地和敏捷地进行设计过程，并描绘高高- 通过视觉和互动体验级别的世界和叙事设计。此外，我们将展示将玩家建议纳入游戏内容的具体示例，并讨论“协作设计”在游戏开发中的重要性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Strange Within the Familiar How 'Once Human' Designed its Supernatur...",
            "author": "Peng Sun ",
            "organization": "NetEase Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034822/The-Strange-Within-the-Familiar",
            "index": 410,
            "overview": "Once Human received positive reviews in the beta test that ended in January, thanks to its unique art style for monsters and scenes. The most talked-about aspect of the game is the unique design of the \"living machines\" monsters and abnormal environment. This presentation will break down the design process of some most popular monsters and points of interest in Once Human, and elaborate on how we use the \"familiar + strange\" design approach to systematically and agilely move forward with the design process, and portray the high-level world and narrative design through visual and interactive experiences. Additionally, we will showcase specific examples of incorporating player suggestions into the game content and discuss the importance of the \"collaborative design\" in game development.",
            "translated": "一旦人类在1月结束的Beta测试中获得了积极的评论，这要归功于其独特的怪物和场景艺术风格。游戏中最容易说的方面是“活机”怪物和异常环境的独特设计。本演示文稿将分解一些最受欢迎的怪物和兴趣点的设计过程，并详细说明我们如何使用“熟悉 +奇怪”的设计方法来系统地和敏捷地进行设计过程，并描绘高高- 通过视觉和互动体验级别的世界和叙事设计。此外，我们将展示将玩家建议纳入游戏内容的具体示例，并讨论“协作设计”在游戏开发中的重要性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unearthing 'Tetris Reversed': A Tale of Rediscovery and Collaboration",
            "author": "Alexey Pajitnov ",
            "organization": "The Tetris Company",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034732/Unearthing-Tetris-Reversed-A-Tale",
            "index": 416,
            "overview": "Discover the untold story of Tetris Reversed, a lost prototype resurfacing after a decade. Croatian game developer Vedran Klanac found himself in the possession of a never before released prototype of Tetris that he had programmed with design documents passed on to him by a middleman from none other than the creator of Tetris himself, Alexey Pajitnov. Unfortunately, this meant that Alexey and Vedran have never directly corresponded, spoken, or even met each other in person. Hear their journey, see never before shown gameplay, and witness the historic first in-person meeting of both developers. Gain insights into another hidden layer of Tetris' history, the challenges of remote collaboration, and the serendipity of rediscovery. Join us for an intimate exploration of game development's global reach and the enduring impact of a game icon.",
            "translated": "发现俄罗斯方块逆转的不为人知的故事，这是十年后的失落的原型。克罗地亚的游戏开发商Vedran Klanac发现自己拥有一个从未有过的俄罗斯方块的原型，他已经与Tetris创造者Alexey Pajitnov的中间人一起传递给了他的设计文件。不幸的是，这意味着Alexey和Vedran从未直接对应，说话，甚至亲自见面。聆听他们的旅程，从未见过展示的游戏玩法，并见证了两个开发人员的历史性首次面对面会议。洞悉俄罗斯方块历史的另一层，远程协作的挑战以及重新发现的偶然性。加入我们，深入探索游戏开发的全球影响力和游戏图标的持久影响。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: High-Fidelity Graphics on Mobile, VR, PC, and Co...",
            "author": "Mathieu Muller ",
            "organization": "Unity Technologies",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034714/Unity-Developer-Summit-High-Fidelity",
            "index": 424,
            "overview": "Discover the latest advancements in rendering, lighting, and VFX technologies in Unity 6. Learn how the new GPU Lightmapper and Adaptive Probe Volumes allow you to scale global illumination from mobile to high-end PCs with fast iterations and high visual fidelity. Also, see our artist tools updates for materials, shaders, and VFX, making them easier to use and enabling you to create effects that would have been hard to achieve before.",
            "translated": "在Unity 6中发现渲染，照明和VFX技术方面的最新进步。了解新的GPU LightMapper和自适应探针量如何使您可以将全球照明从移动设备扩展到具有快速迭代的高端PC，并具有快速的视觉效果。另外，请参阅我们的材料，着色器和VFX的艺术家工具更新，使其更易于使用，并使您能够创建以前难以实现的效果。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Unity Muse: Accelerating Prototyping in the Unit...",
            "author": "Manuel Sainsily ",
            "organization": "Unity Technologies",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034718/Unity-Developer-Summit-Unity-Muse",
            "index": 429,
            "overview": "In this session, learn how Unity Muse a collection of AI-powered capabilities helps make creating in the Unity Editor faster, less complex, and more flexible. With natural-language prompts, you can chat to produce usable code, troubleshoot issues, and enhance your scenes with generative art, textures, animations, and much more. Get ready to enhance your current workflows and speed prototyping with Unity Muse directly in the Unity Editor.",
            "translated": "在本届会议中，了解Unity Muse如何收集AI驱动的功能，有助于使在Unity编辑器中创建更快，更复杂且更加灵活。借助自然语言提示，您可以聊天以生成可用的代码，对问题进行故障排除，并通过生成艺术，纹理，动画等增强您的场景。随时可以直接在Unity编辑中使用Unity Muse来增强您当前的工作流程和速度原型。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unravelling Project AVA: Insights from Our Research on GenAI in Game Dev...",
            "author": "Stephen Peacock ",
            "organization": "Keywords Studios",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034841/Unravelling-Project-AVA-Insights-from",
            "index": 435,
            "overview": "In this informative session, Lionel Wood, Art Director at Electric Square Malta, and Stephen Peacock, Head of Games AI at Keywords Studios present an R&D case study covering the story of a team's foray into AI-powered video game development.nnThe talk candidly explores the team's successes and setbacks while employing Generative AI tools in their creative process. Attendees will gain an unbiased insight into the complexities of AI integration, its potential advantages, and the challenges it can pose.nnThis session offers a balanced perspective for game developers of all levels of experience, shedding light on the intricate dynamics of blending traditional development approaches with emergent AI technologies.nnThis session's description may have been written by AI. Or not.",
            "translated": "在这次信息会议上，马耳他电气广场的艺术总监莱昂内尔·伍德（Lionel Wood）和关键字工作室游戏AI的主管史蒂芬·孔雀（Stephen Peacock团队的成功和挫折是在使用生成的AI工具的创作过程中。与会者将对AI整合的复杂性，其潜在优势以及它可以提出的挑战获得无偏见的见解。NNNTHTHIS会议为各种经验的游戏开发人员提供了平衡的观点，阐明了融合传统发展方法的复杂动态借助Emprent AI Technologies。或不。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Using UEFN to Build New Genres (Presented by Epic Games)",
            "author": "Josh Grant ",
            "organization": "Epic Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034653/Using-UEFN-to-Build-New",
            "index": 438,
            "overview": "Join us as we discuss building new genres in Fortnite by leveraging UEFN features to expand the Fortnite Ecosystem. Explore new and upcoming tools through sample projects and community highlights. Leave feeling inspired to build games that look and feel unique.",
            "translated": "加入我们，讨论在Fortnite建立新类型的过程中，通过利用UEFN功能扩展Fortnite生态系统。通过示例项目和社区亮点探索新的和即将到来的工具。离开感觉到构建外观和感觉独特的游戏的启发。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "We Built This City on Bits 'n Maps: Four Design Techniques for Simulatin...",
            "author": "Guillaume Pierre ",
            "organization": "Magic Fuel Games",
            "trackname": "Design",
            "url": "https://gdcvault.com/free/gdc-24/play/1034401/We-Built-This-City-on",
            "index": 448,
            "overview": "City simulation games are both notoriously difficult and also incredibly rewarding to make. nnBut what kind of design techniques are needed to create responsive simulations so players can fulfill their goal of making the biggest and happiest cities? nnIn this lecture, Guillaume Pierre will go over four of these techniques, which he used when building the simulation in SimCity, and again when designing Cityscapes: Sim Builder, a #1 Apple Arcade title: Maps, Networks & Globals, Agents, and Building-to-Building Connections.nnWith these techniques, you will learn to create intricate simulation systems such as beauty, water supply, crime, fire, work shifts, and even parking lots.",
            "translated": "众所周知，城市模拟游戏都很困难，而且令人难以置信的有益。nnbut需要哪种设计技术来创建响应式模拟，以便玩家可以实现最大，最快乐的城市的目标？nnin在本讲座中，Guillaume Pierre将经过这些技术中的四种，他在模拟中构建模拟时使用了这些技术，并在设计CityScapes时再次使用：Sim Builder：Sim Builder，＃1 Apple Apple Arcade标题：地图，网络和全球，代理商和建筑物- 建造连接。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "'Crystal of Atlan': Cross-Server Architecture Design and Optimization (P...",
            "author": "Shuangxing Gao ",
            "organization": "ByteDance",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034652/-Crystal-of-Atlan-Cross",
            "index": 7,
            "overview": "The speech focuses on Crystal of Atlan, a MMOARPG with millions of DAU, and introduces the design of cross-server operations, optimization of server CPU, memory, and network, as well as its deployment and maintenance.",
            "translated": "演讲的重点是Atlan的晶体，Atlan是一个拥有数百万个DAU的MMOARPG，并介绍了跨服务器操作，服务器CPU，内存和网络的优化及其部署和维护的设计。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "'Minecraft' Players at the Center of the Universe of Big Data (Presented...",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034735/-Minecraft-Players-at-the",
            "index": 9,
            "overview": "This talk explores the vast and diverse world of Minecraft, focusing on the role of data-driven insights in improving player experiences. We'll delve into lessons from player pathing, segmentation, social listening, and discuss how these insights are applied to different areas of Minecraft. We'll demonstrate how effective prediction and recommendations can seamlessly integrate into the player experience to deepen player relationships.",
            "translated": "本演讲探讨了《我的世界》的庞大而多样化的世界，重点是数据驱动的见解在改善玩家体验中的作用。我们将从玩家路径，细分，社交聆听中深入研究课程，并讨论如何将这些见解应用于Minecraft的不同领域。我们将展示如何无缝地集成到玩家体验以加深玩家关系的有效预测和建议。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "144FPS Rendering on Mobile: Frame Prediction in 'Arena Breakout' (Presen...",
            "author": "Yue Qi ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034689/144FPS-Rendering-on-Mobile-Frame",
            "index": 10,
            "overview": "With the advancement of hardware technology, an increasing number of mobile devices support high screen refresh rates such as 120Hz, 144Hz, and even higher. This creates the challenge of increasing frame rates without sacrificing image quality in mobile rendering.nThis session introduces a frame-prediction-based rendering method (non-neural network) in Arena Breakout, specifically designed for achieving high frame rates, successfully implemented in the released game.. Frame prediction effectively reuses previously drawn pixels, significantly boosting the game's frame rate and reducing power consumption without adding latency to framebuffer presentation.nThe presentation includes the implementation of frame prediction, the corresponding rendering pipelines, accuracy and performance analysis, and a comparison with other solutions.",
            "translated": "随着硬件技术的发展，越来越多的移动设备支持高屏幕刷新率，例如120Hz，144Hz，甚至更高。这会构成提高帧速率而不牺牲移动渲染中图像质量的挑战。游戏..框架预测有效地重用先前绘制的像素，大大提高了游戏的帧速率并降低了框架的延迟，而无需增加框架的延迟。与其他解决方案。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "144FPS Rendering on Mobile: Frame Prediction in 'Arena Breakout' (Presen...",
            "author": "Yue Qi ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034828/144FPS-Rendering-on-Mobile-Frame",
            "index": 11,
            "overview": "With the advancement of hardware technology, an increasing number of mobile devices support high screen refresh rates such as 120Hz, 144Hz, and even higher. This creates the challenge of increasing frame rates without sacrificing image quality in mobile rendering.nThis session introduces a frame-prediction-based rendering method (non-neural network) in Arena Breakout, specifically designed for achieving high frame rates, successfully implemented in the released game.. Frame prediction effectively reuses previously drawn pixels, significantly boosting the game's frame rate and reducing power consumption without adding latency to framebuffer presentation.nThe presentation includes the implementation of frame prediction, the corresponding rendering pipelines, accuracy and performance analysis, and a comparison with other solutions.",
            "translated": "随着硬件技术的发展，越来越多的移动设备支持高屏幕刷新率，例如120Hz，144Hz，甚至更高。这会构成提高帧速率而不牺牲移动渲染中图像质量的挑战。游戏..框架预测有效地重用先前绘制的像素，大大提高了游戏的帧速率并降低了框架的延迟，而无需增加框架的延迟。与其他解决方案。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "3D Toon Rendering in 'Hi-Fi RUSH'",
            "author": "Kosuke Tanaka ",
            "organization": "Tango Gameworks",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034251/3D-Toon-Rendering-in-Hi",
            "index": 17,
            "overview": "'Hi-Fi RUSH' is a 60fps rhythm action game rendered in a stylish 3D toon art style using a customized Unreal Engine 4. In 'Hi-Fi RUSH', the developers at Tango Gameworks used toon shading for the entire world, both character and environment, while providing modern 3D graphics features, all at 60fps at native resolution.Learn about the development of a deferred toon renderer developed for toon shading a 3D world in a 2D way. Various customized UE4 render passes along with added render passes of their own are stylized and combined inside deferred rendered post process volumes.Comic shaders, toon lights, dynamic shadow map strategies, static shadow maps, light probe GI, and their face shadow implementation will be discussed.Learn about the core tech behind the game as well as select graphics implementations.",
            "translated": "“ Hi-Fi Rush”是一种60fps的节奏动作游戏，使用定制的虚幻引擎4以时尚的3D Toon艺术风格呈现，在“ Hi-Fi Rush”中，Tango Gameworks的开发人员都为全世界都使用Toon Shading，这两个角色都是角色和环境在提供现代3D图形功能的同时，在本机分辨率下，所有这些都以60fps为单位。各种定制的UE4渲染通行证以及额外的渲染通行证都被风格化和组合，并在递延后渲染后的过程卷中进行了样式化和组合讨论了有关游戏背后的核心技术以及精选的图形实现。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "3D Toon Rendering in 'Hi-Fi RUSH'",
            "author": "Kosuke Tanaka ",
            "organization": "Tango Gameworks",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034330/3D-Toon-Rendering-in-Hi",
            "index": 18,
            "overview": "'Hi-Fi RUSH' is a 60fps rhythm action game rendered in a stylish 3D toon art style using a customized Unreal Engine 4. In 'Hi-Fi RUSH', the developers at Tango Gameworks used toon shading for the entire world, both character and environment, while providing modern 3D graphics features, all at 60fps at native resolution.Learn about the development of a deferred toon renderer developed for toon shading a 3D world in a 2D way. Various customized UE4 render passes along with added render passes of their own are stylized and combined inside deferred rendered post process volumes.Comic shaders, toon lights, dynamic shadow map strategies, static shadow maps, light probe GI, and their face shadow implementation will be discussed.Learn about the core tech behind the game as well as select graphics implementations.",
            "translated": "“ Hi-Fi Rush”是一种60fps的节奏动作游戏，使用定制的虚幻引擎4以时尚的3D Toon艺术风格呈现，在“ Hi-Fi Rush”中，Tango Gameworks的开发人员都为全世界都使用Toon Shading，这两个角色都是角色和环境在提供现代3D图形功能的同时，在本机分辨率下，所有这些都以60fps为单位。各种定制的UE4渲染通行证以及额外的渲染通行证都被风格化和组合，并在递延后渲染后的过程卷中进行了样式化和组合讨论了有关游戏背后的核心技术以及精选的图形实现。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Anatomy of a Frame in 'Cyberpunk 2077: Phantom Liberty'",
            "author": "Charles Tremblay ",
            "organization": "CD Projekt RED",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034333/Anatomy-of-a-Frame-in",
            "index": 46,
            "overview": "Cyberpunk 2077 features an incredibly dense and action-packed world that places huge demands on CPU processingsomething that is pushed even further in the post-launch Episode Phantom Liberty. This talk dissects, in detail, a single CPU frame sampled from Phantom Liberty, in order to illustrate how the work for the various systems that drive the game are distributed across CPU cores in order to achieve 60 FPS gameplay in performance mode while updating one of the densest video game worlds to date. The process for how the team worked out their CPU budgets is described, as well as how they approached the challenge of balancing the desire to saturate CPU cores with useful work, and system update dependencies. Comparisons are made to CPU frames sampled in different gameplay situations to highlight the differences that can occur based on what is currently happening in the game.",
            "translated": "Cyber​​punk 2077具有一个令人难以置信的密集和动感十足的世界，对CPU处理的巨大需求在发出后的情节Phantom Liberty中进一步推动。本演讲详细阐述了一个从幻影自由采样的单个CPU框架，以说明如何在跨CPU核心分布驱动游戏的各种系统的工作，以便在性能模式下实现60 fps游戏，同时更新一个。迄今为止，最密集的视频游戏世界。描述了团队如何计算其CPU预算的过程，以及如何应对平衡渴望与有用的工作和系统更新依赖关系的愿望平衡的挑战。对在不同的游戏情况下采样的CPU帧进行了比较，以突出根据游戏中当前发生的情况进行的差异。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Applied Mesh Analysis: Automating Distant-City LODs in 'Marvel's Spider-...",
            "author": "Scott Kircher ",
            "organization": "Insomniac Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034403/Applied-Mesh-Analysis-Automating-Distant",
            "index": 49,
            "overview": "The New York City of Marvel's Spider-Man 2 is roughly twice as large as that of earlier titles in the series. At the same time, new quality and performance constraints required the creation of additional distant city LODs. The manual distant-LOD geometry pipeline of Marvel's Spider-Man and Marvel's Spider-Man: Miles Morales was no longer viable. This lecture describes how Insomniac Games transitioned to automated distant-LOD geometry generation. In particular, it covers in-depth the applications of fundamental mesh analysis concepts (dual meshes, the Euler Characteristic, curvature estimation, etc...) to several difficult problems (beyond standard reduction and remeshing) that arise from the unique constraints regarding distant city LODs present in Marvel's Spider-Man 2.",
            "translated": "纽约市漫威的蜘蛛侠2大约是该系列赛早期冠军的两倍。同时，新的质量和绩效限制需要创建其他遥远的城市LOD。Marvel的蜘蛛侠和Marvel的蜘蛛侠的手动远处几何管道：Miles Morales不再可行。该讲座描述了失眠游戏如何过渡到自动远处的几何产生。特别是，它涵盖了基本网格分析概念（双网格，欧拉特特征，曲率估计等）的应用，以源于几个困难问题（超出标准减少和重新构成），这些问题来自于远处的独特约束Marvel的蜘蛛侠2中出现的城市LOD。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Bringing Maximum Reality to Vulkan Games (Presented by Samsung)",
            "author": "Jungwoo Kim ",
            "organization": "Samsung Electronics",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034725/Bringing-Maximum-Reality-to-Vulkan",
            "index": 71,
            "overview": "GPU DevTech is a game development support program started by Samsung that has been optimizing Vulkan games for better performing and deliver high fidelity graphics with Samsung Galaxy products since 2016.nnWe cover many modern game optimization techniques like Vulkan, Game scaling and ray tracing with the real game practices and also update about GPUWatch, a performance monitoring tool in Galaxy, and more.",
            "translated": "GPU DevTech是一项由三星启动的游戏开发支持计划，该计划一直在优化Vulkan游戏，以更好地表现性能，并自2016年以来使用三星Galaxy产品提供高保真图形。游戏实践以及有关GPUWatch，Galaxy中的性能监视工具等的更新。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Building New Types of Islands in Fortnite (Presented by Epic Games)",
            "author": "Robert Taylor ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034660/Building-New-Types-of-Islands",
            "index": 77,
            "overview": "This talk will introduce the audience to the new features available to Fortnite Creators in UEFN and Creative that can be used to build islands using various templates.",
            "translated": "这次演讲将向观众介绍欧文特（Uefn）的Fortnite创作者可用的新功能，可用于使用各种模板来建造岛屿。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Building the Fully Connected Multiverse in 'Suicide Squad'",
            "author": "Ingimar Gumundsson ",
            "organization": "Rocksteady Studios Ltd.",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034815/Building-the-Fully-Connected-Multiverse",
            "index": 79,
            "overview": "This talk presents a method of how to support an environment design in a streaming open world that changes greatly over time within the game. The design allows for navigation data to be built, such that a predictable minimum set of offline data is readily available to complement the changing nature of the environment. Within this framework the talk will detail how to build connected navigation data that spans all surfaces, allowing agents to traverse walls, fly and reach the player at any location, quickly. Finally we address how to complement the system with dynamic elements that affect navigation.",
            "translated": "本演讲介绍了一种如何在流媒体开放世界中支持环境设计的方法，这种设计随着时间的流逝而大大变化。该设计允许构建导航数据，从而可以很容易地使用可预测的最小离线数据集，以补充环境的变化性质。在此框架内，谈话将详细介绍如何构建跨越所有表面的连接导航数据，使代理可以迅速在任何位置穿越墙壁，飞行并触及播放器。最后，我们解决了如何使用影响导航的动态元素补充系统。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Can HLOD save your game? (Presented by Simplygon, Microsoft)",
            "author": "Jesper Tingvall ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034762/Can-HLOD-save-your-game",
            "index": 80,
            "overview": "Simplygon will share their knowledge on asset optimization for massive open world games. This talk will cover the key ingredient to making them run smooth, HLOD, including what it is and what tools are suitable for generating HLOD for static meshes and vegetation. Join us to learn how HLOD can improve the performance of Unreal Engine 5 games and how Simplygon fits into the Unreal Engine 5 eco system. Finally, get a quick overview of the latest news from Simplygon 10.3 which includes an improved Unity plugin and more.",
            "translated": "SimplyGon将分享他们对大型开放世界运动会资产优化的知识。这次演讲将涵盖使它们流畅，HLOD运行的关键要素，包括它是什么以及哪种工具适合生成HLOD用于静态网眼和植被。加入我们，了解HLOD如何改善虚幻引擎5游戏的性能，以及简单地符合虚幻引擎5 ECO系统的性能。最后，快速概述SimplyGon 10.3的最新消息，其中包括改进的Unity插件等等。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Chaos Physics in LEGO Fortnite: Building a Fully Interactive Sandbox Exp...",
            "author": "Michael Lentine ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034659/Chaos-Physics-in-LEGO-Fortnite",
            "index": 84,
            "overview": "Epic will present a deep dive into the technology used to make LEGO Fortnite fully interactive where nearly everything can be physically simulated and destroyed. This includes an in-depth look at updates to the Chaos Rigid Body Engine, Destruction, and Networked Physics systems as well as gameplay technology that enables nearly every construct to work with every other construct.",
            "translated": "Epic将深入研究用于使乐高乐高富斯尼特完全互动的技术，几乎所有内容都可以在物理上模拟和破坏。这包括对混乱僵硬的车身引擎，破坏和网络物理系统的更新以及游戏技术的更新，这些技术使几乎每个结构都可以与其他每个结构一起使用。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Choreographing Superpowered AI Movement in 'Suicide Squad'",
            "author": "Lingxiao Fu ",
            "organization": "Rocksteady Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034856/Choreographing-Superpowered-AI-Movement-in",
            "index": 85,
            "overview": "This talk presents an expressive and scalable AI movement stack that realizes diverse AI traversal behaviors in Suicide Squad: Kill The Justice League. A hierarchical multi-modal pathfinding approach operating on hyper-connected navigation data is used to produce effective paths in the complex open world of Metropolis. A novel path-planning approach is introduced between pathfinding and path following to create more varied and nuanced traversal decisions. AI path is annotated and broken down into featured patterns based on agent movement constraints and preference and then solved by an HTN-style planner into traversal plans. An adaptive traversal plan execution layer allows AI agents to carry out the planned traversal with the ability to repair and adjust their actions on the fly.",
            "translated": "这次演讲提出了一种表现力且可扩展的AI运动堆栈，它意识到自杀小队中的各种AI遍历行为：杀死正义联盟。在超连接导航数据上运行的分层多模式探路方法用于在复杂的大都市开放世界中产生有效的路径。在探路和路径之间引入了一种新颖的路径规划方法，以创建更多和细微的遍历决策。AI路径被注释并分解为基于代理运动约束和偏好的特征模式，然后由HTN式计划者解决遍历计划。自适应遍历计划的执行层使AI代理可以通过即时维修和调整其动作的能力进行计划的遍历。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Compile Score: Slay the C++ Build Time Dragon",
            "author": "Ramon Viladomat ",
            "organization": "Santa Monica Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034818/Compile-Score-Slay-the-C",
            "index": 92,
            "overview": "Build times have been affecting productivity and iteration times since the dawn of programming. Developer improvement efforts have been based on guesswork so far considering the compiler has always been a closed box. 'Compile Score' allows us to peek inside and dissect how the compiler digests the code empowering the engineer to make targeted improvements and identify the real bottlenecks.This presentation covers how to extract, interpret, and act with the provided data, as well as go through C++ best practices to keep the dependencies healthy. It also goes through the setup in Santa Monica Studio to get up to date information automatically to the whole team.",
            "translated": "自编程曙光以来，构建时间一直在影响生产率和迭代时间。考虑到编译器一直是封闭式框，开发人员的改进工作一直是基于猜测。“编译得分”使我们能够窥视内部并剖析编译器如何消化代码，使工程师有能力进行有针对性的改进并确定真正的瓶颈。此演示文稿涵盖了如何提取，解释和使用所提供的数据以及GO进行的如何提取，解释和行动通过C ++的最佳实践，以保持依赖性健康。它还在圣莫尼卡工作室（Santa Monica Studio）进行了设置，以自动获取整个团队的最新信息。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Cross-Platform Determinism in 'Warhammer Age of Sigmar: Realms of Ruin'",
            "author": "Bradley Pollard ",
            "organization": "Frontier Developments",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034321/Cross-Platform-Determinism-in-Warhammer",
            "index": 99,
            "overview": "In this session, learn how and why Frontier Developments built a new deterministic simulation framework that underpins everything players see and interact with in Warhammer Age of Sigmar: Realms of Ruin. Engineering Lead Bradley Pollard covers the journey taken by the development teamfrom implementing a thread-safe ECS to creating tooling to analyze and prevent desynchronizations. Learn how determinism benefits both the developers, as well as the game, by enabling reproducibility, providing low-cost networking, and even providing a form of anti-cheat. The talk also addresses how Frontier was able to create a framework that is able to run on PC, Xbox, PlayStation, and Linux, and ensure determinism.",
            "translated": "在本届会议中，了解Frontier Developments如何以及为什么建立了一个新的确定性模拟框架，该框架为玩家在Sigmar的Warhammer时代所见和与之互动的所有事物支撑。工程负责人布拉德利·波拉德（Bradley Pollard）涵盖了开发团队从实施线程安全的EC进行创建工具以分析和防止异步的工具的旅程。了解确定论如何通过启用可重复性，提供低成本的网络，甚至提供一种反欺骗形式来使开发人员和游戏都受益。演讲还解决了Frontier如何创建能够在PC，Xbox，PlayStation和Linux上运行的框架，并确保确定性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Delta Force Techniques From Unified Production Pipeline to Cross-Platfor...",
            "author": "Shangli Liang ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034827/Delta-Force-Techniques-From-Unified",
            "index": 100,
            "overview": "Delta Force is preparing to deliver top-tier experiences to gamers for all platforms. This session will cover an efficient production process while pursuing exceptional development quality as TiMi Studio Group readies for the release of a new edition to a classic FPS franchise. This talk will summarize the valuable experiences learned through the development process of Delta Force regarding various aspects of cross-platform production including asset management, open world solutions, auto scalable 3C, adaptive UI framework and the performance tracking tools we build for better tracking during the unified development process.",
            "translated": "Delta Force正在准备为所有平台的游戏玩家提供顶级体验。本届会议将涵盖一个高效的生产过程，同时追求特殊的开发质量，因为Timi Studio Group Regise是将新版本发布给经典FPS系列的新版本。这次演讲将总结通过三角洲力量开发过程中有关跨平台生产的各个方面所学到的宝贵经验统一的发展过程。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Delta Force Techniques From Unified Production Pipeline to Cross-Platfor...",
            "author": "Shangli Liang ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034688/Delta-Force-Techniques-From-Unified",
            "index": 101,
            "overview": "Delta Force is preparing to deliver top-tier experiences to gamers for all platforms. This session will cover an efficient production process while pursuing exceptional development quality as TiMi Studio Group readies for the release of a new edition to a classic FPS franchise. This talk will summarize the valuable experiences learned through the development process of Delta Force regarding various aspects of cross-platform production including asset management, open world solutions, auto scalable 3C, adaptive UI framework and the performance tracking tools we build for better tracking during the unified development process.",
            "translated": "Delta Force正在准备为所有平台的游戏玩家提供顶级体验。本届会议将涵盖一个高效的生产过程，同时追求特殊的开发质量，因为Timi Studio Group Regise是将新版本发布给经典FPS系列的新版本。这次演讲将总结通过三角洲力量开发过程中有关跨平台生产的各个方面所学到的宝贵经验统一的发展过程。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "DirectX State of the Union Ft. Work Graphs and Introducing DirectSR (Pre...",
            "author": "Shawn Hargreaves ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034738/DirectX-State-of-the-Union",
            "index": 109,
            "overview": "The DirectX team will showcase the latest updates, demos, and best practices for game development with key partners from AMD and NVIDIA. Work graphs are the newest way to take full advantage of GPU hardware and parallelize workloads. Microsoft will provide a preview into DirectSR, making it easier than ever for game devs to scale super resolution support across Windows devices. Finally, dive into the latest tooling updates for PIX.",
            "translated": "DirectX团队将与AMD和Nvidia的主要合作伙伴展示最新的更新，演示和游戏开发的最佳实践。工作图是充分利用GPU硬件并并行化工作负载的最新方法。Microsoft将提供DirectSR的预览，使游戏开发人员比以往任何时候都更容易扩展Windows设备的超级分辨率支持。最后，深入了解PIX的最新工具更新。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "ECS in Practice: The Case Board of 'Alan Wake 2'",
            "author": "Alexander Balakshin ",
            "organization": "Remedy Entertainment",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034295/ECS-in-Practice-The-Case",
            "index": 111,
            "overview": "For Alan Wake 2, Remedy Entertainment is using a new data-oriented ECS gameplay framework instead of the previous object-oriented one. As a result, we have performance gains such as cache coherency and multithreading out of the box. Also, being implemented using some of the latest C++ features, the new framework changes the way gameplay programmers write their code by providing them some extra convenience and productivity.We will present how this framework is used for implementing one of the game's features the Case Board. We will cover how we describe the Case Board objects with components, how we register their systems, and how we interact with other modules (camera, cursor, etc.). Finally, we'll show how the interaction between C++ code and Lua scripts is organized.",
            "translated": "对于Alan Wake 2，Remedy Entertainment使用了一个新的面向数据的ECS游戏框架，而不是以前面向对象的游戏框架。结果，我们在开箱即用之外具有诸如CACHE相干性和多线程等性能。此外，通过使用一些C ++功能来实施，新框架通过提供一些额外的便利性和生产力来改变游戏玩法编写代码的方式。我们将介绍该框架如何用于实现游戏的一个案例板之一。我们将介绍如何描述具有组件的案例板对象，如何注册其系统以及如何与其他模块（相机，光标等）进行交互。最后，我们将展示如何组织C ++代码与LUA脚本之间的相互作用。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Engineering Mayhem: Technical Deep-Dive into Environmental Destruction i...",
            "author": "Mans Isaksson ",
            "organization": "Embark Studios",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034307/Engineering-Mayhem-Technical-Deep-Dive",
            "index": 124,
            "overview": "THE FINALS is a fast-paced, competitive first person shooter with a focus on emergent gameplay and dynamic systems. Front and center of these systems is the destruction system which enables most of the environment to be destroyed, buildings to collapse, and debris from buildings to re-shape the play-space, all while being physically simulated.In this session, Mns Isaksson (Game Engineer at Embark Studios) walks through the technical challenges the team at Embark had to overcome to enable this level of destruction in THE FINALS. He walks you through the workflow from constructing and fracturing structures to integrating them into the playable environment, and explore technical aspects such as replication, simulation performance, rendering, and structural analysis calculations.",
            "translated": "决赛是一个快节奏的，有竞争力的第一人称射击游戏，重点是新兴的游戏玩法和动态系统。这些系统的正面和中心是破坏系统，它使大多数环境都能被破坏，建筑物崩溃以及从建筑物中碎屑重新塑造游戏空间，同时进行物理模拟。Embark Studios的游戏工程师）浏览了Embark团队必须克服的技术挑战，以使决赛中的这种破坏程度。他将带您完成从构造和破裂结构到将它们集成到可玩环境中的工作流程，并探讨诸如复制，仿真性能，渲染和结构分析计算之类的技术方面。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Farming Simulator Vehicle Integration Pipeline (Presented by GIANTS Soft...",
            "author": "Stefan Maurus ",
            "organization": "GIANTS Software GmbH",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034645/Farming-Simulator-Vehicle-Integration-Pipeline",
            "index": 136,
            "overview": "The Farming Simulator game series showcases perhaps the most complex vehicles in the industry. In this talk it is all about the integration of those vehicles into the game, progressing from static 3D models to fully animated vehicles controllable by the user. Stefan Maurus, the lead integrator of GIANTS Software will explain the challenges his team faced by increasingly complex farming machinery and share insights into how they addressed specific cases. Additionally, he'll show clever techniques implemented to optimize performance. Given the game's highly modifiable nature, he'll also show you what has been done ensuring that all this technology is accessible to modders, providing a deeper understanding of the game's mod support.",
            "translated": "农业模拟器游戏系列展示了行业中最复杂的车辆。在本次演讲中，这一切都是关于将这些车辆集成到游戏中的全部，从静态3D型号到完全由用户控制的动画车辆。巨人软件的首席集成商Stefan Maurus将通过日益复杂的农业机制来解释他的团队面临的挑战，并分享有关他们如何解决特定案例的见解。此外，他还将展示实施的巧妙技术来优化性能。鉴于游戏的高度修改性质，他还将向您展示已完成的操作，以确保Modders可以使用所有这些技术，从而更深入地了解游戏的MOD支持。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "FP16 Shaders in Frostbite",
            "author": "Alexis Griffin-Lira ",
            "organization": "Electronic Arts",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034306/FP16-Shaders-in",
            "index": 137,
            "overview": "This talk describes how Frostbite implemented multi platform 16 bit type (FP16) support for shaders in order to increase shader performance, especially on mobile. 16 bit shader types like half and short have advantages over 32 bit types, like occupancy and ALU performance. However, converting shaders to take advantage of half precision types is often not a straightforward process, in particular when accounting for platform and driver quirks. nnThis talk will cover the process of creating Frostbite's FP16 API, which enables shader programmers to write FP16 shaders while the tools bridge the platform gaps under the hood. The talk will also explain the rationale behind embracing FP16 in our shaders, the various challenges and quirks of FP16 in different platforms, and how we worked around them, and, finally, it concludes by presenting some of our performance and visual results on various console and mobile platforms. ",
            "translated": "本演讲描述了Frostbite如何实现多个平台16位类型（FP16）对着色器的支持，以提高着色器性能，尤其是在移动设备上。16位着色器类型（例如一半和短的）具有超过32位的优点，例如占用和Alu性能。但是，转换着着色器以利用一半的精度类型通常不是一个简单的过程，尤其是在考虑平台和驱动程序怪癖时。nnthis Talk将涵盖创建Frostbite的FP16 API的过程，该过程使着色器程序员能够编写FP16着色器，而工具将平台上的平台间隙弥合引擎盖下的缝隙。演讲还将解释在着色器中拥抱FP16，不同平台中FP16的各种挑战和怪癖背后的理由，以及我们如何围绕它们的工作，最后，它通过在各种控制台上介绍了我们的一些性能和视觉结果，结论得出结论。和移动平台。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Good Game: Fostering Communities of Belonging in Minecraft (Presented by...",
            "author": "Carlos Figueiredo ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034747/Good-Game-Fostering-Communities-of",
            "index": 199,
            "overview": "Learn about Good Game (currently #1 in Minecraft Education Marketplace), a new addition to the CyberSafe collection of immersive Minecraft worlds designed to help young people stay safe, happy, and thriving online. This session will explore the journey to create a game focused on a fun, story-based adventure that helps players understand the responsibilities, tools, responses, and strategies that enable healthy online interactions, collaboration, and rewarding digital experiences. The talk will cover the conceptual phase and partnership formation all the way to crafting the game's challenge-based framework, culminating on a view of post-launch impact and outcomes, including teacher and student reception and testimonials.",
            "translated": "了解良好的游戏（目前在Minecraft教育市场中排名第一），这是网络安全收藏的新成员，旨在帮助年轻人保持安全，快乐和在线繁荣。本届会议将探索创建一款专注于一项基于故事的冒险的游戏的旅程，该游戏可帮助玩家了解能够使健康的在线互动，协作和奖励数字体验的职责，工具，回应和策略。演讲将涵盖概念阶段和伙伴关系形成，一直到制作基于挑战的框架，最终以后启动后影响和成果（包括教师和学生接待和推荐）的视图。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Google Developer Summit: Android Input on Desktop: How to Delight Your U...",
            "author": "Shenshen Cui ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034846/Google-Developer-Summit-Android-Input",
            "index": 200,
            "overview": "This session will discuss a high level overview of best practices for handling input in mobile vs PC games, including technical details on how to implement these best practices in Android for phones, tablets, PCs, and Chromebooks to help developers give their players a first class gaming experience.",
            "translated": "本届会议将讨论在移动与PC游戏中处理输入的最佳实践的高级概述，包括有关如何在Android中实施这些最佳实践的技术详细信息游戏体验。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Google Developer Summit: Beyond \"Set and Forget\": Advanced Debugging wit...",
            "author": "Joe Spiro ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034843/Google-Developer-Summit-Beyond-Set",
            "index": 201,
            "overview": "It's time to move beyond simply catching bugs; Crashlytics has added a number of features that make detecting, tracking and understanding bugs all the way from high level to native code even easier. Take your fixes to another level with native stack traces, memory debugging and the ability to log uncaught exceptions as fatal. Now developers can better understand and fix issues that occur at some of the deepest and most obscure parts of their apps.",
            "translated": "现在是时候让捕获错误了。Crashlytics添加了许多功能，这些功能使从高级别到本机代码的检测，跟踪和理解错误甚至更容易。将您的修复程序带到另一个级别，并使用本机堆栈痕迹，内存调试以及将无人例外作为致命的能力。现在，开发人员可以更好地理解并解决在其应用程序中最深，最晦涩的部分中出现的问题。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Google Developer Summit: Building Multiplatform Games with Flutter (Pres...",
            "author": "Zoey Fan ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034842/Google-Developer-Summit-Building-Multiplatform",
            "index": 203,
            "overview": "Today, Flutter is used in more than 1M apps from small studios to large companies like Lotem and PUBG who are building beautiful, natively compiled, multi-platform applications from a single codebase. Casual games have become a big part of the Flutter ecosystem with the Casual Games Toolkit, a collection of free and open source tools, templates, and resources to make game dev more productive with Flutter.",
            "translated": "如今，Flutter已用于从小型工作室到像Lotem和PubG这样的大型公司的100万个应用程序，这些公司正在从单个代码库中构建美丽，本质编译的多平台应用程序。休闲游戏已成为随意游戏工具包，免费和开源工具，模板和资源的集合，使游戏开发更具生产力的狂热，这已成为狂暴生态系统的重要组成部分。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Google Developer Summit: Creating a Global-scale Game with Google Cloud ...",
            "author": "Mark Mandel ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034844/Google-Developer-Summit-Creating-a",
            "index": 204,
            "overview": "Google Cloud is an ecosystem for live games. In this session, developers will survey the breadth of Google Cloud offerings through a working project framework capable of supporting a global-scale game.",
            "translated": "Google Cloud是现场游戏的生态系统。在本届会议上，开发人员将通过一个能够支持全球规模游戏的工作项目框架来调查Google Cloud产品的广度。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Google Developer Summit: Enhancing Game Performance: Vulkan and Android ...",
            "author": "Dohyun Kim ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034845/Google-Developer-Summit-Enhancing-Game",
            "index": 205,
            "overview": "In this talk, discover a few ways to help advance your game development. The session will kick off with how Vulkan graphics API can be leveraged to improve graphics quality or performance, including performance tuning with dynamic upscaling and additional performance optimizations. Then, discussion will turn to how the Android Dynamic Performance Framework can enhance game performance and power in Unity and native C++, release in Unreal Engine as a plugin, and check how to improve thermal status and performance in NCSoft Lineage W. ARM will join Google onstage to show how game developers can implement an ADPF plugin in Unreal Engine for mobile games to enhance player experiences",
            "translated": "在这次演讲中，发现几种方法来帮助您推进您的游戏开发。该会话将从如何利用Vulkan Graphics API开始以提高图形质量或性能，包括通过动态升级和额外的性能优化来提高图形质量或性能。然后，讨论将转向Android动态性能框架如何在Unity和Native C ++中提高游戏性能和功能，在虚幻引擎中以插件的形式释放，并检查如何改善NCSoft Slineage W. ARM中的热状态和性能。在舞台上展示游戏开发人员如何在虚幻引擎中实现ADPF插件，以增强玩家体验"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Harnessing Generative AI to Create Unlimited Content Within Game Worlds ...",
            "author": "Russ Harding ",
            "organization": "Saltwater Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034925/Harnessing-Generative-AI-to-Create",
            "index": 208,
            "overview": "Join Saltwater Games and walk through the generative AI architecture of the world of Resurgence, an upcoming free-to-play, post-apocalyptic, open-world crafting and survival game. Learn about the generative AI technology behind the in-game ThorAI (powered by Amazon Bedrock), and dive deep into fully voiced, interactive in-game NPCs in the companion mobile game Missing. Explore real-world use cases for a variety of generative AI services and solutions.",
            "translated": "加入Saltwater游戏，浏览即将举行的免费游戏，后世界末日，开放世界的手工艺和生存游戏的恢复世界的生成AI架构。了解游戏内Thorai（由亚马逊基岩提供动力）背后的生成AI技术，并深入探讨了Companion Mobile Game失踪的完全发音，互动的游戏中NPC。探索用于各种生成AI服务和解决方案的现实世界用例。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Higher, Faster, Farther: Evolving Traversal in 'Marvel's Spider-Man 2'",
            "author": "Doug Sheahan ",
            "organization": "Insomniac Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034327/Higher-Faster-Farther-Evolving-Traversal",
            "index": 210,
            "overview": "In building up on traversal from Marvel's Spider-Man, we wanted to provide players a fresh experience built upon the mechanics they loved. This session talks about how we expanded and evolved our traversal system to include additional mechanics like web wings. You also learn about how the team had to evolve several of our existing mechanics to handle the new speeds the player could traverse at.",
            "translated": "在基于Marvel的蜘蛛侠的Traversal构建时，我们希望为玩家提供基于他们喜欢的机制的新经验。本届会议讨论了我们如何扩展和发展遍历系统，以包括其他机制，例如Web Wings。您还将了解团队如何发展我们现有的几种机制来处理玩家可以穿越的新速度。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "How PlayFab Helped Texas Chainsaw Massacre Succeed (Presented by Microsoft)",
            "author": "CJ Williams ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034734/How-PlayFab-Helped-Texas-Chainsaw",
            "index": 213,
            "overview": "Gun Interactive launched Texas Chainsaw Massacre in August 2023 and player engagement immediately exceeded the team's expectations. With Playfab as their backend service, they were able to scale quickly and smoothly to meet the demands of rapidly escalating DAU, ensuring the team didn't miss a beat landing this massive success. Learn how early integration of solutions ranging from Game Servers to CloudScript, Player Profile and more, allowed Gun to depend on Playfab for a smooth and scaled launch and continued ongoing operations.",
            "translated": "Gun Interactive于2023年8月发起了德克萨斯电锯大屠杀，球员的参与立即超出了球队的期望。以Playfab作为后端服务，他们能够快速而平稳地扩展，以满足迅速升级的Dau的要求，从而确保球队不会错过任何巨大成功的节拍。了解从游戏服务器到CloudScript，玩家配置文件等的早期集成如何使Gun依靠Playfab进行平滑而扩展的启动以及继续进行的操作。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "How to Launch an Online Game and Still Attend the Launch Party",
            "author": "Christopher Shankland ",
            "organization": "Odyssey Interactive",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034605/How-to-Launch-an-Online",
            "index": 215,
            "overview": "Launch day for an online game is a very exciting time, but often not in a good way for the online or service engineering team. Odyssey Interactive's debut title, Omega Strikers, a competitive online sports-combat game launched on 7 platforms with a services team of 3 reaching hundreds of thousands of players on day 1 with no outages. This session explores the core role that Observability played in making this 'boring launch' the expected outcome. An introduction to what Observability is, some basics of the tech that makes it work, and in-depth examples of how it provides crucial focus and context in high pressure situations will be presented. Don't be scared of launch day again!",
            "translated": "在线游戏的启动日非常激动人心，但对于在线或服务工程团队来说，通常不是很好的方式。Odyssey Interactive的首张冠军Omega Strikers是一款竞争性的在线体育连接游戏，在7个平台上推出了一支由3个服务团队组成的服务团队，在第1天，没有停机。本届会议探讨了可观察性在使“无聊发射”预期结果的核心作用。介绍了什么是可观察性，使它起作用的技术的一些基础知识以及在高压情况下如何提供至关重要的重点和背景的深入示例。不要再害怕发射日！"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Innovation Unleashed: High-Performance UE5 Mobile Rendering and Next-Gen...",
            "author": "Bo Li ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034830/Innovation-Unleashed-High-Performance-UE5",
            "index": 262,
            "overview": "The bar of quality and performance on next-gen platforms has been raised once again with Unreal Engine 5. However, a significant gap has emerged between these advanced features and their mobile counterparts. In this presentation, we will explore how the presenters addressed the challenge of developing high-quality UE5 mobile games involving the implementation of multiple optimizations and creation of new mobile rendering pipelines.nnSimilarly, MetaHuman by Epic revolutionized character creation technology, yet challenges in performance and customization persist. This session will introduce a groundbreaking character creation pipeline designed for crafting high-definition, animation-ready characters that enhance the immersion in the next-level metaverse. The creators will showcase a novel system, built upon multimodal machine learning techniques, that empowers both artists and gamers to generate hyper-realistic avatars seamlessly from photos, sketches, or even text within seconds.",
            "translated": "通过虚幻引擎5再次提高了下一代平台上质量和性能的标准。但是，这些高级功能与其移动功能之间已经出现了很大的差距。在本演讲中，我们将探讨演示者如何应对开发高质量的UE5手机游戏的挑战，涉及实施多次优化和创建新的移动移动渲染管道。定制持续。本次会议将介绍一条开创性的角色创建管道，旨在制作高清动画的角色，以增强浸入下一级元元的沉浸式。创作者将展示一个基于多模式机器学习技术的新型系统，该系统使艺术家和游戏玩家都能在几秒钟内从照片，素描甚至文本中无缝地生成超现实的化身。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Innovation Unleashed: High-Performance UE5 Mobile Rendering and Next-Gen...",
            "author": "Bo Li ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034701/Innovation-Unleashed-High-Performance-UE5",
            "index": 263,
            "overview": "The bar of quality and performance on next-gen platforms has been raised once again with Unreal Engine 5. However, a significant gap has emerged between these advanced features and their mobile counterparts. In this presentation, we will explore how the presenters addressed the challenge of developing high-quality UE5 mobile games involving the implementation of multiple optimizations and creation of new mobile rendering pipelines.nnSimilarly, MetaHuman by Epic revolutionized character creation technology, yet challenges in performance and customization persist. This session will introduce a groundbreaking character creation pipeline designed for crafting high-definition, animation-ready characters that enhance the immersion in the next-level metaverse. The creators will showcase a novel system, built upon multimodal machine learning techniques, that empowers both artists and gamers to generate hyper-realistic avatars seamlessly from photos, sketches, or even text within seconds.",
            "translated": "通过虚幻引擎5再次提高了下一代平台上质量和性能的标准。但是，这些高级功能与其移动功能之间已经出现了很大的差距。在本演讲中，我们将探讨演示者如何应对开发高质量的UE5手机游戏的挑战，涉及实施多次优化和创建新的移动移动渲染管道。定制持续。本次会议将介绍一条开创性的角色创建管道，旨在制作高清动画的角色，以增强浸入下一级元元的沉浸式。创作者将展示一个基于多模式机器学习技术的新型系统，该系统使艺术家和游戏玩家都能在几秒钟内从照片，素描甚至文本中无缝地生成超现实的化身。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Inside UEFN SceneGraph (Presented by Epic Games)",
            "author": "Tim Tillotson ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034900/Inside-UEFN-SceneGraph-(Presented-by",
            "index": 264,
            "overview": "A look inside the new advanced UEFN features workflows and Verse APIs, which dramatically expand the power users have to construct content in UEFN.",
            "translated": "外观新的高级uefn具有工作流和诗歌API，它们大大扩展了电源用户必须在uefn中构建内容。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Keeping Online Communities Healthy (Presented by Microsoft)",
            "author": "Jennifer Mills-Perov ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034737/Keeping-Online-Communities-Healthy-(Presented",
            "index": 268,
            "overview": "Online gaming communities face new challenges every day that can harm the well-being and security of players. And Content Moderators have to deal with policy breaches, threats, and creating a safe and secure space for everyone. Meanwhile, government regulators are pushing for policies that can help the industry tackle online risks. Community Managers have a large responsibility and Microsoft can support them with innovative tools and solutions that make it easier to build trust with players, drive community engagement, and reduce churn by keeping players playing. In this talk, we will show how AI-powered safety can improve your gaming community creating a safe place that players expect and deserve, making everyone feel welcomed, safe and included when they play.",
            "translated": "在线游戏社区每天都面临新的挑战，可能会损害玩家的福祉和安全性。内容主持人必须处理政策违反，威胁并为每个人创造安全的空间。同时，政府监管机构正在推动可以帮助行业解决在线风险的政策。社区经理承担着巨大的责任，微软可以通过创新的工具和解决方案来为他们提供支持，从而使与玩家建立信任，推动社区参与度并通过保持玩家的比赛来减少流失。在这次演讲中，我们将展示AI驱动的安全性如何改善您的游戏社区创造一个安全的地方，这使玩家期望和应得的地方，使每个人在比赛时都感到受欢迎，安全和包括。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Large Scale GPU-Based Skinning for Vegetation in 'Alan Wake 2'",
            "author": "Kiyavash Kandar ",
            "organization": "Remedy Entertainment",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034310/Large-Scale-GPU-Based-Skinning",
            "index": 269,
            "overview": "Alan Wake 2's forests and vegetation of the Pacific Northwest carry the atmosphere of the horror survival genre almost like a character on their own.This talk showcases Remedy's new GPU-based skinning pipeline, built to handle detailed and dense environments that are mostly comprised of dynamically animated vegetation geometry. To match the team's ambitions in geometric fidelity and complexity of motion, they also developed a new GPU-based animation system that could animate skeleton rigs at runtime via compute shaders.The talk provides a look under the hood at the techniques used to hit performance targets, create feature rich systems for artists, and enable full representation in the Northlight engine's raytracing implementation.",
            "translated": "艾伦·韦克2（Alan Wake 2动画植被几何形状。为了符合团队在几何忠诚度和运动复杂性方面的野心，他们还开发了一种新的基于GPU的动画系统，该系统可以通过计算着色器在运行时为骨架钻机进行动画动画。谈话在引擎盖下为击中性能目标的技术提供了看法，为艺术家创建功能丰富的系统，并在Northlight Engine的射线缩放实现中启用完整代表。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Lessons in Integrating Third-Party Technology into Unreal Engine 5 (Pres...",
            "author": "Oliver Strunk ",
            "organization": "Havok",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034726/Lessons-in-Integrating-Third-Party",
            "index": 277,
            "overview": "Havok technology has been integrated with a broad set of proprietary engines. In this talk we want to share our learnings from integrating the Havok SDKs into Unreal Engine. We show how we approached the integrations of the three Havok SDKs - Havok Navigation, Havok Cloth and Havok Physics - unlocking Havok's industry renowned performance and rich feature set within Unreal. Join this session to learn how to integrate and maintain your own existing tech within Unreal or see how Havok can work for you.",
            "translated": "Havok技术已与广泛的专有发动机集成。在这次演讲中，我们希望分享我们的学习，从将Havok SDK集成到虚幻引擎中。我们展示了如何处理三个Havok SDK的集成 -  Havok Navigation，Havok Bloth和Havok Physics-解锁Havok的行业著名性能和Unreal内部设置的丰富功能。加入本届会议，学习如何在虚幻中集成和维护自己现有的技术，或者查看Havok如何为您工作。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Making the Most of the Magic of Meta Quest (Presented by Meta)",
            "author": "Ben Walker ",
            "organization": "Meta",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034699/Making-the-Most-of-the",
            "index": 303,
            "overview": "Whats different about making games for a mobile, immersive headset? Well, a lot. Ben Walker shares his guidance from years of helping developers publish experiences on Meta Quest. From architectural differences like Compositor Layer rendering and CPU/GPU levels, to immersive-only algorithms like Application SpaceWarp, to iteration timesavers like Meta XR Simulator and optimization tools like RenderDoc Meta Forklearn as much about developing for Meta Quest as 30 minutes will allow.",
            "translated": "为手机，身临其境的耳机制作游戏有何不同？好，很多。本·沃克（Ben Walker）分享了他多年来帮助开发人员发表Meta Quest的经验的指导。从复合层渲染和CPU/GPU级别等建筑差异到诸如应用程序空间战争之类的沉浸式算法，再到Meta XR Simulator（例如Meta XR Simulator）以及RenderDoc Meta Forklearn（例如，对于Meta Quest的开发30分钟）等迭代时间扩展。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Maximizing Graphics Performance with Flexible Virtualized Geometry (Pres...",
            "author": "Alexis Vaisse ",
            "organization": "VIRTUOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034816/Maximizing-Graphics-Performance-with-Flexible",
            "index": 304,
            "overview": "A technical walkthrough on the development of a virtualized geometry technology that can be integrated with any game engine, and an overview of the challenges faced. nThe talk explores how Virtuos achieved optimal performance with ultra high-resolution meshes, thanks to a multitude of different techniques - automatic split of mesh LODs, data streaming, occlusion culling at the chunk level, data compression, and more. nOther experimental features, such as geomorphing to enable smooth transition between LODs, will also be discussed.",
            "translated": "可以与任何游戏引擎集成的虚拟几何技术开发的技术演练，并概述所面临的挑战。n The Talk探讨了通过多种不同技术的超高分辨率网格的演讲如何通过超高分辨率网格实现最佳性能 - 网格LOD的自动拆分，数据流，闭塞，在块级别，数据压缩等等。还将讨论非试验特征，例如地理形态以实现LOD之间的平滑过渡。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Maximizing Graphics Performance with Flexible Virtualized Geometry (Pres...",
            "author": "Alexis Vaisse ",
            "organization": "VIRTUOS",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034621/Maximizing-Graphics-Performance-with-Flexible",
            "index": 305,
            "overview": "A technical walkthrough on the development of a virtualized geometry technology that can be integrated with any game engine, and an overview of the challenges faced. nThe talk explores how Virtuos achieved optimal performance with ultra high-resolution meshes, thanks to a multitude of different techniques - automatic split of mesh LODs, data streaming, occlusion culling at the chunk level, data compression, and more. nOther experimental features, such as geomorphing to enable smooth transition between LODs, will also be discussed.",
            "translated": "可以与任何游戏引擎集成的虚拟几何技术开发的技术演练，并概述所面临的挑战。n The Talk探讨了通过多种不同技术的超高分辨率网格的演讲如何通过超高分辨率网格实现最佳性能 - 网格LOD的自动拆分，数据流，闭塞，在块级别，数据压缩等等。还将讨论非试验特征，例如地理形态以实现LOD之间的平滑过渡。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Mecha BREAK's Virtual Geometry (Presented by Unity)",
            "author": "Huang Jinshou ",
            "organization": "Amazing Seasun Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034911/Mecha-BREAK-s-Virtual-Geometry",
            "index": 306,
            "overview": "Explore the essentials of Virtual Geometry, including its core concepts, clustering algorithm, and the GPU-driven rendering workflow. We'll demonstrate the enhanced visuals in Mecha BREAK with Virtual Geometry and examine the real-world performance impacts on CPU, GPU, and memory. You'll be inspired by the many ways Virtual Geometry can elevate game development.nnPlease note that this session will be translated live into English.",
            "translated": "探索虚拟几何形状的基本要素，包括其核心概念，聚类算法和GPU驱动的渲染工作流。我们将通过虚拟几何形状展示机甲断裂中增强的视觉效果，并检查对CPU，GPU和内存的现实性能影响。您会受到虚拟几何形状可以提升游戏开发的多种方式的启发。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "MergeBot: Activision's Merge and Resolve Infrastructure",
            "author": "Damianos Gkouzkouris ",
            "organization": "Activision",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034772/MergeBot-Activision-s-Merge-and",
            "index": 307,
            "overview": "Source control is one of the foundational elements in a software's lifecycle. Unfortunately, code merges and conflict resolution can be challenging, especially in a game development environment with numerous large files scattered across branches that must be kept in sync. This talk serves as a postmortem on a tool that emerged from our ongoing work to smoothly integrate Perforce changelists between streams, all while ensuring it doesn't disrupt our continuous development pipeline. The presentation will delve into the architecture of the tool, the challenges encountered while making it as hands-off as possible, the complexities involved in the file resolution process, which needed to be universally accessible, and a discussion of the compromises we had to make while developing and customizing the tool to suit our needs.",
            "translated": "源控制是软件生命周期中的基础元素之一。不幸的是，代码合并和解决冲突的解决方案可能具有挑战性，尤其是在游戏开发环境中，散布在分支机构的大量文件中，必须保持同步。这次演讲是一种工具的邮政事候，该工具从我们正在进行的工作中出现，以平稳地整合流中的长音，同时确保它不会破坏我们的持续开发管道。演示文稿将深入研究工具的体系结构，使其尽可能脱颖而出时遇到的挑战，文件解决过程所涉及的复杂性，需要普遍访问，以及对我们必须做出的妥协的讨论在开发和定制该工具以满足我们的需求时。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Build Next Generation XR Experiences with Meta Qu...",
            "author": "Rangaprabhu Parthasarathy ",
            "organization": "Meta",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034629/Meta-Developer-Summit-Build-Next",
            "index": 308,
            "overview": "Are you interested in developing your next title in VR or MR for Meta Quest? Join Rangaprabhu Parthasarathy, Mike Lamprinos, and Giray Ozil as they take you from project setup to an XR app in less than one hour. You will learn everything you need to get started building XR on Meta Quest during this crash-course. We will cover Meta's Presence Platform capabilities and SDKs that will let you create truly immersive experiences you cannot create on a flatscreen. We will discuss a wide range of Presence Platform features including hand and body tracking, intuitive interactions, and audio and haptics for a more immersive experience. We will also discuss how you can take everything you've learned to bring your experiences to the real world with MR on Meta Quest 3. This fast-paced session will move from concept understanding to practical implementation. Additional sessions throughout the day will provide even deeper dives into designing for MR, adding body tracking to your game, and creating greater immersion with haptics and interaction.",
            "translated": "您是否有兴趣在VR中开发下一个标题或META任务MR？加入Rangaprabhu Parthasarathy，Mike Lamprinos和Giray Ozil，他们将您从项目设置带到XR应用程序不到一小时。在此崩溃过程中，您将学习开始在Meta任务上构建XR所需的一切。我们将介绍Meta的存在平台功能和SDK，这些功能将使您创建无法在平板上创建的真正身临其境的体验。我们将讨论各种存在的平台功能，包括手和身体跟踪，直观的互动以及音频和触觉，以获得更身临其境的体验。我们还将讨论如何将您学到的一切与MR META任务3一起将您的经验带入现实世界。这个快节奏的会话将从概念理解转变为实际实施。全天的其他课程将为MR设计，为您的游戏增添身体跟踪，并为触觉和互动增添更大的沉浸感。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Building for Immersion: Haptics and Interactions ...",
            "author": "Andrew Lazdins ",
            "organization": "Meta RL",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034693/Meta-Developer-Summit-Building-for",
            "index": 309,
            "overview": "Immersion is key when building for XR. Right out of the box, Meta's Presence Platform provides you with the tools and SDKs you need to immerse your players. Discover how to quickly integrate natural-feeling interactions (with hands and controllers) and add HD haptics to your app with David Nelson and Andrew Lazdins. You can thrill your players with this one-two immersive punch. During this session we will introduce you to the Interaction SDK, its capabilities, how we've made it even easier to use by integrating it directly into the Unity editor, and show you how to add interactions to your app. Our haptics discussion will begin with a concise 2-minute overview of the design and integration workflow using our tools, showing how you can quickly create most of your haptics in seconds. We'll also share haptic design guidelines, principles, and processes derived from popular apps like Asgard's Wrath 2, Beat Saber, and Max Mustard, so you can enhance those 'special moments' in your app. Haptics We'll kick off with a concise 2-minute introduction to the haptic design and integration workflow using meta tools, demoing how you can quickly create the majority of your haptics in seconds. We will then deep dive into examples and lessons drawn from popular apps like Asgards Wrath 2, Beat Saber, First Hand and First Encounters as we teach you how to enhance those 'special moments' in your app by sharing a new set of haptic design guidelines, principles, and processes.",
            "translated": "浸入XR时是关键。开箱即用，Meta的存在平台为您提供了沉浸玩家所需的工具和SDK。发现如何快速与大卫·尼尔森（David Nelson）和安德鲁·拉兹（Andrew Lazdins）一起在应用程序中添加高清触觉，并在应用程序中添加高清触觉。您可以用这种一两次沉浸式的拳来激动您的球员。在本届会议期间，我们将向您介绍交互SDK，其功能，如何通过将其直接集成到Unity编辑器中，并向您展示如何将交互添加到应用程序中。我们的触觉讨论将从我们的工具进行设计和集成工作流的简洁概述开始，以表明如何在几秒钟内快速创建大多数触觉。我们还将分享触觉设计指南，原理和流程，这些过程来自Asgard的愤怒2，Beat Saber和Max Mustard，因此您可以在应用程序中增强这些“特殊时刻”。触觉我们将使用元工具进行简洁的2分钟介绍触觉设计和集成工作流程的介绍，并演示如何在几秒钟内快速创建大多数触觉。然后，我们将深入研究诸如Asgards Wrath 2，击败Saber，第一手和第一场相遇等流行应用程序的示例和课程，因为我们教您如何通过共享一套新的触觉设计指南来增强应用程序中的“特殊时刻”，原则和过程。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Optimizing for Gameplay with Body Tracking on Met...",
            "author": "Kirk Barker ",
            "organization": "Meta",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034694/Meta-Developer-Summit-Optimizing-for",
            "index": 312,
            "overview": "Using body tracking to animate a character in game play presents some unique challenges. What happens when your character is small compared to the person playing the game? What happens if the proportions are different like having a large bobble head? How do you trade off positional accuracy for hands or head while maintaining the character's look and feel? nnIn this session, Kirk Barker will teach you how to incorporate body tracking using Meta's Presence Platform Movement SDK with Meta Quest HMDs to animate characters with natural movement for action, fitness, or social. Learn how to enable body tracking and overcome common problems like character scaling, allowing for missing bones, and maintaining positional accuracy of hands, head, or hips desired for the gameplay.",
            "translated": "使用身体跟踪在游戏中进行角色动画，带来了一些独特的挑战。与玩游戏的人相比，您的角色很小时会发生什么？如果比例有不同的比例，例如拥有大型毛刺头，会发生什么？在保持角色的外观和感觉的同时，您如何权衡姿势准确性？nnin在本届会议上，柯克·巴克（Kirk Ba​​rker）将教您如何使用Meta的存在平台运动SDK与Meta Quest HMD合并身体跟踪，以使角色具有自然动作，适应性或社交活动。了解如何启用身体跟踪并克服常见问题，例如角色缩放，允许缺失的骨头以及保持游戏玩法所需的手，头或臀部的位置精度。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Meta Developer Summit: Quest for Game Developers (Presented by Meta)",
            "author": "David Borel ",
            "organization": "Meta",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034695/Meta-Developer-Summit-Quest-for",
            "index": 313,
            "overview": "Meta Quest has now reached tens of millions of users and made over a billion dollars, but the technical challenges remain immense, with a wearable form factor and a power-constrained mobile SoC. David gives an overview of the Quest build and optimize flow, geared towards console and PC developers, with an eye toward graphically-demanding, immersive games. Mixed Reality enables new creative possibilities, but it puts unique demands on programmers, artists, and designers. We share the lessons of a ten-year journey from developer kits to Quest 3.",
            "translated": "Meta Quest现在已经吸引了数千万用户，并赚了10亿美元，但是技术挑战仍然巨大，可穿戴外形和功率约束的移动SOC。David概述了任务构建和优化流程，该流程针对控制台和PC开发人员，并着眼于图形要求，沉浸式游戏。混合现实实现了新的创意可能性，但它对程序员，艺术家和设计师提出了独特的要求。我们分享从开发人员套件到任务3的十年旅程的课程。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "MotorNerve: A Character Animation System Using Machine Learning (Present...",
            "author": "Yuchen Liao ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034825/MotorNerve-A-Character-Animation-System",
            "index": 317,
            "overview": "This presentation will introduce to you a character animation system using machine learning, dubbed MotorNerve, which implements two core character animation functions: locomotion control and transition animation generation. First, by combining Motion Matching and Learned Motion Matching technologies, MotorNerve achieves high-quality, low-consumption locomotion control while speeding up the tuning process for Learned Motion Matching. Secondly, MotorNerve also implements an inhouse Motion In-Betweening (MIB) algorithm, which uses a variational autoencoder to encode leg movements, significantly improving the foot skating problem of existing methods. This method, a joint work by Zhejiang University and TiMi Studio Group, a Tencent Games studio, has been published in SIGGRAPH 2022. MotorNerve applies MIB to interactive animation scenarios, generating high-quality transition animations while saving the project costs.",
            "translated": "本演示文稿将使用机器学习（称为Motornerve）向您介绍一个角色动画系统，该系统实现了两个核心角色动画功能：运动控制和过渡动画生成。首先，通过将运动匹配和学习的运动匹配技术结合在一起，Motornerve可以在加快学习运动匹配的调音过程时实现高质量，低消耗的运动控制。其次，Motornerve还实现了内部运动内部运动（MIB）算法，该算法使用各种自动编码器来编码腿部运动，从而显着改善了现有方法的脚步滑冰问题。该方法是Zhejiang University和Timi Studio Group（腾讯游戏工作室）的联合作品，已在Siggraph 2022中发布。Motornerve将MIB应用于交互式动画场景，从而产生了高质量的过渡动画，同时节省了项目成本。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "MotorNerve: A Character Animation System Using Machine Learning (Present...",
            "author": "Yuchen Liao ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034685/MotorNerve-A-Character-Animation-System",
            "index": 318,
            "overview": "This presentation will introduce to you a character animation system using machine learning, dubbed MotorNerve, which implements two core character animation functions: locomotion control and transition animation generation. First, by combining Motion Matching and Learned Motion Matching technologies, MotorNerve achieves high-quality, low-consumption locomotion control while speeding up the tuning process for Learned Motion Matching. Secondly, MotorNerve also implements an inhouse Motion In-Betweening (MIB) algorithm, which uses a variational autoencoder to encode leg movements, significantly improving the foot skating problem of existing methods. This method, a joint work by Zhejiang University and TiMi Studio Group, a Tencent Games studio, has been published in SIGGRAPH 2022. MotorNerve applies MIB to interactive animation scenarios, generating high-quality transition animations while saving the project costs.",
            "translated": "本演示文稿将使用机器学习（称为Motornerve）向您介绍一个角色动画系统，该系统实现了两个核心角色动画功能：运动控制和过渡动画生成。首先，通过将运动匹配和学习的运动匹配技术结合在一起，Motornerve可以在加快学习运动匹配的调音过程时实现高质量，低消耗的运动控制。其次，Motornerve还实现了内部运动内部运动（MIB）算法，该算法使用各种自动编码器来编码腿部运动，从而显着改善了现有方法的脚步滑冰问题。该方法是Zhejiang University和Timi Studio Group（腾讯游戏工作室）的联合作品，已在Siggraph 2022中发布。Motornerve将MIB应用于交互式动画场景，从而产生了高质量的过渡动画，同时节省了项目成本。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Nanite GPU-Driven Materials",
            "author": "Graham Wihlidal ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034407/Nanite-GPU-Driven",
            "index": 319,
            "overview": "This advanced technical talk takes a deep dive into Nanite's novel GPU driven material pipeline.nnA high-level overview is presented, detailing all of the core components and explaining how they fit into the overall design. nnThis talk also covers low-level technical details, including how artist-authored materials drive the rasterizer, how final shading is evaluated, an innovative variable rate shading technique, and some challenges of GPU driven rendering. nnAdditionally, this talk discusses several learnings and optimizations that were discovered during the development of these components.",
            "translated": "这次高级技术谈话深入了解了Nna的NNA高级概述，介绍了NNA高级概述，详细介绍了所有核心组件，并解释了它们如何适合整体设计。nnththis Talk还涵盖了低级技术细节，包括艺术家创造的材料如何驱动栅格器，如何评估最终阴影，创新的可变速率阴影技术以及GPU驱动的渲染的一些挑战。在此上，本演讲讨论了这些组件开发过程中发现的几种学习和优化。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next Level of Mobile Graphics: Ray Tracing in 'Arena Breakout' (Presente...",
            "author": "Junhong Wang ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034829/Next-Level-of-Mobile-Graphics",
            "index": 322,
            "overview": "\"Arena Breakout\" is a next-gen immersive tactical FPS powered by Unreal Engine 4.26 on mobile devices.The game integrates Vulkan Ray Query-based reflection, ambient occlusion and soft shadow, all optimized to run seamlessly on the latest Android platform. In this session, Junhong Wang, Lead Mobile Programmer of Arena Breakout, will introduce the implementation and optimization of the Vulkan Ray Query in 'Arena Breakout', including its ability to maintain a stunning 60 FPS within the expansive open world map.",
            "translated": "“ Arena Breakout”是下一代沉浸式战术FPS，由Moble Engine 4.26在移动设备上提供动力。该游戏集成了基于Vulkan Ray Query的反射，环境遮挡和柔和的阴影，所有这些都非常优化，可以在最新的Android平台上无缝运行。在本次会议上，Arena Breakout的首席移动程序员Junhong Wang将在“ Arena Breakout”中介绍Vulkan Ray查询的实施和优化，包括其在广阔的开放世界地图中维持令人惊叹的60 fps的能力。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next Level of Mobile Graphics: Ray Tracing in 'Arena Breakout' (Presente...",
            "author": "Junhong Wang ",
            "organization": "Tencent Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034690/Next-Level-of-Mobile-Graphics",
            "index": 323,
            "overview": "\"Arena Breakout\" is a next-gen immersive tactical FPS powered by Unreal Engine 4.26 on mobile devices.The game integrates Vulkan Ray Query-based reflection, ambient occlusion and soft shadow, all optimized to run seamlessly on the latest Android platform. In this session, Junhong Wang, Lead Mobile Programmer of Arena Breakout, will introduce the implementation and optimization of the Vulkan Ray Query in 'Arena Breakout', including its ability to maintain a stunning 60 FPS within the expansive open world map.",
            "translated": "“ Arena Breakout”是下一代沉浸式战术FPS，由Moble Engine 4.26在移动设备上提供动力。该游戏集成了基于Vulkan Ray Query的反射，环境遮挡和柔和的阴影，所有这些都非常优化，可以在最新的Android平台上无缝运行。在本次会议上，Arena Breakout的首席移动程序员Junhong Wang将在“ Arena Breakout”中介绍Vulkan Ray查询的实施和优化，包括其在广阔的开放世界地图中维持令人惊叹的60 fps的能力。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Next-Gen Tech Forum: Reimagine the Future of Gaming with Google AI (Pres...",
            "author": "Dan Zaratsian ",
            "organization": "Google",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034898/Next-Gen-Tech-Forum-Reimagine",
            "index": 330,
            "overview": "Join us for a keynote from Google's leading AI minds as they delve into the transformative applications of Generative AI in the gaming landscape. This session brings together senior executives from Google Cloud, Google Play, and Labs, offering unique perspectives from across the gaming ecosystem, development and business management lifecycle.This 1 hour session includes:- A Fireside Chat with Google's Cloud, Play, and Labs AI experts- Open Source AI development tool overview for games including Keras, TensorFlow, JAX, and more- Introduction of Google Cloud Gen AI services supporting scalable architecture and quick-to-deploy design patterns for games",
            "translated": "加入我们，从Google领先的AI头脑中进行主题演讲，因为它们深入研究了Generative AI在游戏领域的变革性应用程序。本届会议将Google Cloud，Google Play和Labs的高级管理人员汇集在一起​​，提供了来自游戏生态系统，开发和业务管理生命周期的独特视角。这1小时的会话包括： - 与Google cloud，Play和Labs AI的Fireside聊天专家 - 开源AI开发工具概述，包括Keras，Tensorflow，Jax和更多的介绍Google Cloud Gen gen AI服务，支持可扩展的体系结构和游戏的快速发展设计模式"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Obstacle Traversal in the Organic World of Pandora",
            "author": "Joel Nilsson ",
            "organization": "Massive Entertainment - A Ubisoft Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034304/Obstacle-Traversal-in-the-Organic",
            "index": 333,
            "overview": "Stepups and mantles are an established part of the game character's repertoire, yet with increasingly complex game worlds traditional markup solutions have become increasingly cumbersome. In Avatar: Frontiers of Pandora we wanted to portray the full dense, organic beauty of Pandora while making the motion feel as flowing and unobstructed as you would expect from a Na'vi. In order to deal with these challenges we created a highly generic and (almost) markup-free system for stepups and mantling relying on a minimum of assumptions while trying to maximize freedom of movement. This talk presents the basic philosophy, concepts, and implementation of this solution. The focus is on providing a solid starting point for those just starting out with this problem and some useful tools for anyone working with it.",
            "translated": "Stepup和Mantles是游戏角色曲目的既定一部分，但是随着越来越复杂的游戏世界，传统标记解决方案变得越来越繁琐。在阿凡达（Avatar）：潘多拉（Pandora）的边界，我们想描绘潘多拉（Pandora）的全部密集，有机美景，同时使动作感觉像您对Na'Vi所期望的那样流动而漫不经心。为了应对这些挑战，我们创建了一个高度通用和（几乎）无标记的系统，用于踩踏和套具，依靠最小的假设，同时试图最大程度地提高行动自由。本演讲介绍了该解决方案的基本理念，概念和实施。重点是为那些刚刚从这个问题开始的人提供一个可靠的起点，并为使用该问题的任何人提供一些有用的工具。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Open World Rendering Techniques in 'Hogwarts Legacy'",
            "author": "Rob Hall ",
            "organization": "Avalanche Software",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034811/Open-World-Rendering-Techniques-in",
            "index": 336,
            "overview": "Rendering a game as complex as Hogwarts Legacy required a focus on adapting the Unreal engine for an open world game. This included handling the massive scale of the Hogwarts castle and scaling rendering systems for a seamless indoor and outdoor experience. This talk will expound on the technical aspects of this work. Topics will include how to render with hundreds of shadow casting light sources, rendering multi-layered cloth at a reduced cost, and how to batch light probes, reflections, and foliage. Hogwarts Legacy also contains several other techniques that make it an immersive experience. This will involve topics like Dynamic time of day, camera exposure, seasons, and weather. Lastly, we will discuss how to render animated paintings without the typical way of rendering to a render target.",
            "translated": "像霍格沃茨遗产一样复杂的游戏需要专注于将虚幻引擎改编成开放世界游戏。这包括处理霍格沃茨城堡的巨大规模和缩放渲染系统，以获得无缝的室内和室外体验。这次演讲将介绍这项工作的技术方面。主题将包括如何使用数百个阴影铸造的光源渲染，以降低的成本渲染多层布，以及如何将光探针，反射和叶子批量。Hogwarts Legacy还包含其他几种使其成为沉浸式体验的技术。这将涉及主题，例如一天中的动态时间，相机曝光，季节和天气。最后，我们将讨论如何在不呈现渲染目标的情况下渲染动画绘画。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Optimizing Game Development Workflows with Visual Studio and AI (Present...",
            "author": "David Li ",
            "organization": "Microsoft",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034749/Optimizing-Game-Development-Workflows-with",
            "index": 338,
            "overview": "Join us for an exploration of how you leverage Visual Studio to speed up your iteration cycle from start to finish. Thanks to your feedback, discover new productivity tools that help optimize the memory layout for your class structures. Together, we will dive deep into how to clean up build inefficiencies and reduce build times with our new integrated IDE tools. See how debugging has become more productive with breakpoint groups and performance improvements. We'll also showcase advanced Unreal Engine integrations like Blueprint references that will help provide additional context when refactoring your Blueprints. Finally, get a quick look at the latest advancements of GitHub Copilot and how it can speed up your game development process with code explanations and suggestions, regardless of your source control system.",
            "translated": "加入我们，探索如何利用视觉工作室，从头到尾加快迭代周期。多亏了您的反馈，发现新的生产力工具，可帮助优化类结构的内存布局。我们将共同深入研究如何通过我们的新集成IDE工具来清理效率低下的效率和减少构建时间。了解如何通过断点组和改进性能的调试变得更加生产力。我们还将展示高级虚幻引擎集成（例如蓝图参考），在重构蓝图时将有助于提供其他上下文。最后，快速查看Github Copilot的最新进步，以及如何通过代码解释和建议加快游戏开发过程，而不管您的源控制系统如何。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Ray Tracing in Snowdrop: Scene Representation and Custom BVH",
            "author": "Oleksandr Koshlo ",
            "organization": "Massive Entertainment - A Ubisoft Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034404/Ray-Tracing-in-Snowdrop-Scene",
            "index": 343,
            "overview": "How do you achieve high fidelity lighting with ray tracing, while maintaining high performance target in an expansive world such as the world of Avatar: Frontiers of Pandora? It requires a good implementation of ray tracing pipeline at multiple levels. This session describes BVH and material management part. The talk shows in detail two different acceleration structure implementations: a custom one used on consoles, and a DXR-based one for PC platforms. It highlights advantages and tradeoffs available with a custom approach, and tackles both common and unique challenges of each implementation, and a range of possible optimizations. The second part talks about \"average\" material representation, and how Snowdrop handles calculating the average for artist-authored materials, often dependent on runtime inputs.",
            "translated": "您如何通过射线追踪来实现高富达照明，同时在像《阿凡达世界：潘多拉的边境》等广阔世界中保持高性能目标？它需要在多个级别上良好实施射线追踪管道。本届会议描述了BVH和材料管理部分。脱口秀详细显示了两种不同的加速结构实现：一种用于控制台的自定义实现，而基于DXR的PC平台。它强调了具有自定义方法的优势和权衡，并应对每个实施的共同挑战和独特的挑战，以及一系列可能的优化。第二部分讨论了“平均”材料表示，以及如何处理雪花台计算艺术家作者的材料的平均值，通常取决于运行时输入。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Real-Time Personalization in Mobile Gaming with On-Device ML (Presented ...",
            "author": "Varun Khare ",
            "organization": "NimbleEdge",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034646/Real-Time-Personalization-in-Mobile",
            "index": 344,
            "overview": "Personalization is well-known to improve gamer engagement significantly. However, most developers rely on outdated, historical user data for personalization, missing out on rich insights regarding session context from real-time user-game interactions. This is largely due to a) prohibitively high cloud costs of handling and processing real-time session data on cloud and b) difficulty of deploying and maintaining real-time ML models on-device nnWe propose a novel approach to overcome these challenges, using our managed on-device ML platform. The platform executes data processing, inference as well as training on-device to deliver cost-efficient, real-time personalization at scale. This results in significant improvement in gamer experience and conversion, with minimal end-to-end latency and CPU and battery usage spike",
            "translated": "个性化是众所周知的，可以显着改善玩家的参与度。但是，大多数开发人员都依靠过时的历史用户数据来个性化，因此错过了有关实时用户游戏交互的会话上下文的丰富见解。这很大程度上是由于a）对云和b）在部署和维护实时ML模型的难度上的实时会话数据的高度高云成本，因此使用我们的挑战提出了一种新的方法来克服这些挑战。管理设备的ML平台。该平台执行数据处理，推理以及培训设备，以大规模提供成本效益，实时个性化。这导致游戏玩家的体验和转换的显着改善，端到端的延迟以及CPU和电池使用率最小"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Real-Time World Editing Technology in Northlight",
            "author": "Sebastian Eriksson ",
            "organization": "Remedy Entertainment",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034300/Real-Time-World-Editing-Technology",
            "index": 345,
            "overview": "Requirements for game worlds are ever-increasing, being more realistic, more interactive, and larger than ever before. This means that there is a ton of content to be authored, but also large amounts of data to pass through pipelines and workflows to the engine runtime. Remedy has been working on a new data pipeline and technology stack for the Northlight engine that allows us to optimize entity data for authoring at edit time, and performance at runtime, while keeping near-instant iteration times for world editing workflows. The fundamental parts of this technology are OpenUSD for authoring, and Northlight's transformative live-edit pipeline that enables entity modifications to be applied to a running game process on the fly. In this presentation, Sebastian shares how we keep the editor and runtime data representations separated, how the data is transformed, and how the real-time editing between the editor and runtime works in practice.",
            "translated": "对游戏世界的要求越来越不断增加，比以往任何时候都更加现实，更具互动性和更大。这意味着要撰写大量内容，但也有大量数据可以通过管道和工作流程到发动机运行时。Remedy一直在为Northlight Engine开发新的数据管道和技术堆栈，使我们能够优化实体数据在编辑时和运行时的性能，同时保留近乎固有的迭代时间以进行世界编辑工作流程。这项技术的基本部分是为创作而开放的，而Northlight的变革性实时管道使实体修改可以随时应用于运行的游戏过程。在本演讲中，塞巴斯蒂安（Sebastian）分享了我们如何保持编辑器和运行时数据表示形式分开，数据的转换方式以及编辑器和运行时之间的实时编辑如何在实践中工作。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Scaling Git Workflows for Game Development",
            "author": "Vikram Saran ",
            "organization": "Independent",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034326/Scaling-Git-Workflows-for-Game",
            "index": 353,
            "overview": "Game development studios often face a dilemma when choosing version control systemsspecific requirements like exclusive file locking can limit options, while common solutions remain financially out of reach for up-and-coming studios. Surprisingly, even with widely used solutions, many projects struggle to adhere to the 'not rocket science' rule of software engineering: maintaining a code repository that consistently passes all tests. Join Vikram in this session as he delves into the challenges of version control in game development and explores how modern git tooling, coupled with strategic workflow adjustments, can pave the way for a cost-effective solution. Discover practical insights to start utilising modern DevOps practices with your projects.",
            "translated": "在选择版本控制系统特定要求（例如独家文件锁定）时，游戏开发工作室通常会遇到困境，而公共解决方案在经济上仍然无法实现新兴的工作室。令人惊讶的是，即使有了广泛使用的解决方案，许多项目也很难遵守“不火箭科学”的软件工程规则：维护始终通过所有测试的代码存储库。加入Vikram在本次会议上，深入研究游戏开发中版本控制的挑战，并探讨如何加上战略工作流程调整的现代GIT工具，可以为具有成本效益的解决方案铺平道路。发现实用的见解，以开始利用您的项目利用现代DevOps实践。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Supporting INT8 Quantized Networks with Unity Sentis (Presented by Arm)",
            "author": "Yusuf Duman ",
            "organization": "Arm",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034897/Supporting-INT8-Quantized-Networks-with",
            "index": 373,
            "overview": "Discover the cutting-edge advancements in Unity Sentis as we discuss the support for INT8 quantized networks. Dive into a dynamic showcase revealing real-time depth map generation from live camera feeds, demonstrating the transformative power of quantized nets. nnUncover the game-changing advantages, including increased performance, optimized memory, and reduced bandwidth usage vital elements for resource-constrained environments such as mobile. Empower game developers to unleash potent neural networks on mobile devices, crafting immersive and compelling experiences that redefine the boundaries of gaming.",
            "translated": "当我们讨论对INT8量化网络的支持时，发现Unity Sentis的前沿进步。潜入一个动态的展示柜，揭示了实时摄像头馈电的实时深度图生成，这表明了量化网的变革力。nnuncover改变了游戏的优势，包括提高性能，优化的内存以及减少资源约束环境（例如移动设备）的带宽使用元素。授权游戏开发人员在移动设备上释放有效的神经网络，制作沉浸式和引人入胜的体验，以重新定义游戏的界限。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Terminal Velocity: Lessons Learned from Server Scaling During the Launch...",
            "author": "Edwin Jones ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034308/Terminal-Velocity-Lessons-Learned-from",
            "index": 385,
            "overview": "At launch, the player population of \"Fall Guys\" peaked at 650,000 concurrent users, which was 8-times the projected load. In this session, walk through how the game services team at Mediatonic prepared for launch, the challenges encountered with this sudden influx of users, and describe improvements made over the last few years to scale to millions of players.",
            "translated": "在发布时，“秋季家伙”的玩家人数达到了650,000名并发用户，这是预计负载的8倍。在本次会议中，浏览Midiatonic的游戏服务团队如何准备发射的方式，这种突然涌入的用户遇到的挑战，并描述了过去几年中的改进，以扩展数百万球员。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Job System in 'Cyberpunk 2077': Scaling Night City on the CPU",
            "author": "David Block ",
            "organization": "CD Projekt RED",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034296/The-Job-System-in-Cyberpunk",
            "index": 398,
            "overview": "This talk covers the evolution of REDengine 4's thread-based job system: its API, internal implementation details, and our overall efforts to achieve greater parallelism. The final design was the result of many iterations and stages of feedback while the game was under development. The final approach chosen resulted in nearly all engine and gameplay systems taking advantage of multiple cores, which helped toward reaching our performance goals. Particular topics include solutions for a thread-based approach using counters for interjob dependencies, debugging and profiling, practical philosophy towards CPU resource sharing, integration with other systems, and overall approaches to the composability of jobs.",
            "translated": "本演讲涵盖了Redengine 4基于线程的工作系统的演变：其API，内部实施细节以及我们为实现更大并行性的整体努力。最终的设计是游戏正在开发时的许多迭代和反馈阶段的结果。选择的最终方法导致几乎所有发动机和游戏系统都利用了多个核心，这有助于实现我们的性能目标。特定的主题包括用于使用计数器的基于线程的方法的解决方案，用于互惠依赖性，调试和分析，实用的CPU资源共享的理念，与其他系统集成以及用于工作合成性的整体方法。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Tunes of the Kingdom: Evolving Physics and Sounds for 'The Legend of Zel...",
            "author": "Takuhiro Dohta ",
            "organization": "Nintendo Co., Ltd.",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034667/Tunes-of-the-Kingdom-Evolving",
            "index": 413,
            "overview": "Developers of The Legend of Zelda: Tears of the Kingdom discuss structuring an expanded Hyrule around physics-based gameplay and evolved sound design! Join the game's Technical Director Takuhiro Dohta, Lead Physics Programmer Takahiro Takayama, and Lead Sound Engineer Junya Osada as they explore challenges their teams faced when approaching this sequel. They will share insights on Link's new abilities, composing Hyrule's expanded sound design and music, and how these go hand-in-(Ultra)hand to create a new experience for players. By the end of Mr. Dohta, Mr. Takayama, and Mr. Osada's talk, they aim to give attendees and players everywhere new perspective on the world of Tears of the Kingdom and the innovations within.",
            "translated": "《塞尔达传说：王国的眼泪》的开发商讨论了围绕物理基于物理的游戏玩法和进化的声音设计的扩展的Hyrule！加入游戏的技术总监Takuhiro Dohta，首席物理程序员Takayama，以及首席声音工程师Junya Osada，探索在接近此续集时面临的团队面临的挑战。他们将分享有关Link的新能力的见解，构成Hyrule扩展的声音设计和音乐，以及它们如何手掌握（Ultra）手为玩家创造新体验。到Dohta先生，高山先生和Osada先生的演讲结束时，他们的目标是在各地为与会者和参与者提供有关王国眼泪和内部创新世界的新观点。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "UEFN Roadmap (Presented by Epic Games)",
            "author": "Bjorn Book-Larsson ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034901/UEFN-Roadmap-(Presented-by-Epic",
            "index": 414,
            "overview": "Join us as we share the current state of Unreal Editor for Fortnite (UEFN) and discuss future development plans. This presentation will guide developers and studios through the latest capabilities they can leverage to engage the Fortnite audience. It will include tips on how to get started within the Fortnite Ecosystem, as well as discussing current limitations.",
            "translated": "加入我们，当时我们共享Fortnite（UEFN）的非现实编辑状态并讨论未来的发展计划。本演讲将指导开发人员和工作室通过他们可以利用的最新功能来吸引Fortnite受众。它将包括有关如何在Fortnite生态系统中开始的技巧，以及讨论当前的局限性。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "UIPainter: Tile-Based UI Rendering in One Draw Call",
            "author": "Wessel Mast ",
            "organization": "Guerrilla B.V.",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034768/UIPainter-Tile-Based-UI-Rendering",
            "index": 415,
            "overview": "Every game editor needs a user interface. It is how we allow developers to create content for the game in a visual way. A good UI renderer has clear-cut constraints, like drawing nicely anti-aliased primitives, yet programmers have vastly different approaches to rendering game editor UI.In this session, Wessel Mast, Tools Programmer at Guerrilla, will tell you about how Guerrilla's editor 'Decima' renders UI: how it uses a tile-based renderer, commonly used in light culling, SSAO, depth of field and more, for drawing complex UI in an efficient manner and how it manages to draw thousands of primitives like rectangles, lines and curves in a single draw call using signed distance fields.",
            "translated": "每个游戏编辑器都需要用户界面。这就是我们允许开发人员以视觉方式为游戏创建内容的方式。一个好的UI渲染器具有明确的限制，例如绘制良好的抗恶心原始图，但是程序员采用截然不同的方法来渲染Game Editor ui。Decima''Frenders UI：如何使用基于瓷砖的渲染器，通常用于轻度culling，SSAO，景深等，用于以有效的方式绘制复杂的UI，以及它如何设法绘制数千个矩形，线条和线条，线条和线条等原始人使用签名的距离字段中的单个拉动呼叫中的曲线。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Best Practices for Building Successful Web Games...",
            "author": "Ben Craven ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034712/Unity-Developer-Summit-Best-Practices",
            "index": 417,
            "overview": "In this session, Unity product and engineering leads share best practices for setting up web games in Unity 2022 LTS, including time-saving tips, optimization tricks, and why the web platform is key for reaching certain audiences without being blocked by hardware requirements or app stores. They also share how some creative developers found success on CrazyGames a web-gaming platform whose Unity titles rack up around 75 million plays per month by bringing their games from mobile app stores directly to players through web browsers. Additionally, the presenters provide a sneak peek at the improvements and continued investments Unity is making in web runtimes coming to Unity 6.",
            "translated": "在本届会议中，Unity产品和工程领导着共享在Unity 2022 LT中设置网络游戏的最佳实践，包括节省时间的提示，优化技巧，以及为什么Web平台是在不被硬件需求或应用程序阻止的情况下吸引某些受众的关键商店。他们还分享了一些创意开发人员如何在CrazyGames上找到成功的网络获奖平台，该平台通过将他们的游戏从移动应用商店直接通过Web浏览器带给玩家，其Unity标题每月的统一标题每月增加了约7500万次。此外，演示者还提供了偷看改进的偷窥，而Unity在Web运行时间内的持续投资持续到了Unity 6。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Bring Order to DAM Content Chaos with Unity Clou...",
            "author": "Andranne Abel ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034722/Unity-Developer-Summit-Bring-Order",
            "index": 418,
            "overview": "Its expensive to create and challenging to transform 3D content across multiple pipelines and applications. Just finding and using the right content can be a huge source of lost time and broken workflows. In this session, we discuss the unique challenges of 3D digital asset management (DAM) and how the new Unity Asset Manager can help organize your content across the studio and get great-looking games to market faster.",
            "translated": "创建和挑战以在多个管道和应用程序中转换3D内容的昂贵。仅找到和使用正确的内容可能是浪费时间和破裂工作流程的巨大来源。在本届会议上，我们讨论了3D数字资产管理（DAM）的独特挑战，以及新的Unity Asset Manager如何帮助整个工作室组织您的内容，并获得更快的市场来推销。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Drive Better Gameplay Experiences on User Device...",
            "author": "Bill Cullen ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034721/Unity-Developer-Summit-Drive-Better",
            "index": 421,
            "overview": "Following Unity Sentis's 2023 beta, we demonstrate how powerful this game-changing technology is by showcasing real-world applications and the integration with Hugging Face. Unity Sentis helps make AI models more accessible, powering in-game features like object recognition, smart NPCs, and graphics optimizations. Learn how our solution for AI models on end-user devices can bring dynamic, living worlds alive like never before.",
            "translated": "在Unity Sentis的2023年Beta之后，我们通过展示现实世界的应用程序以及与拥抱面孔的集成，证明了这种改变游戏规则的技术的功能。Unity Sentis有助于使AI模型更易于访问，可以在对象识别，智能NPC和图形优化等游戏内功能。了解最终用户设备上的AI模型解决方案如何使动态，生活世界像以前一样活跃。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Get Ahead of the F2P Treadmill with Engaging Con...",
            "author": "Rambod Kermanizadeh ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034720/Unity-Developer-Summit-Get-Ahead",
            "index": 423,
            "overview": "In today's capricious F2P landscape, keeping your most valuable players engaged and converting them into payers can make you feel like you're continuously falling off the dreaded content treadmill. There's a better way. Using a real-world LiveOps use case, we show how you can customize Unity services to build, launch, and operate live service games supported by data-driven decisions to outpace the content demands of your players. You'll learn how to build your game mechanics securely, organize and release your game content, make data-informed decisions to use what works, and avoid introducing instabilities into your player experience.",
            "translated": "在当今的反复无常的F2P景观中，保持最有价值的玩家参与其中，并将他们转换为付款人可以使您觉得自己不断地从可怕的内容跑步机上掉下来。有更好的方法。使用现实世界中的LiveOps用例，我们展示了如何自定义Unity服务来构建，启动和操作由数据驱动的决策支持的实时服务游戏，以超过播放器的内容需求。您将学习如何安全地构建游戏机制，组织和发布游戏内容，做出数据信息以使用有效的方法，并避免将不稳定性引入您的玩家体验中。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Multiplayer Development 101 with Our \"Megacity M...",
            "author": "Hersh Bansal ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034713/Unity-Developer-Summit-Multiplayer-Development",
            "index": 425,
            "overview": "In this session, we show you how a small, agile team at Unity quickly built a competitive and cross-platform multiplayer sample that can support 128+ players simultaneously. We discuss the team's journey with Unity's Data-Oriented Technology Stack (DOTS), including native Netcode, physics, and rendering, plus give you a behind-the-scenes look at Unity's multiplayer solutions.",
            "translated": "在本届会议中，我们向您展示了一个团结的小型团队如何迅速建立一个竞争性和跨平台多人游戏样本，该样本可以同时支持128多名球员。我们通过Unity的面向数据的技术堆栈（DOTS）讨论团队的旅程，包括本机NetCode，Physics和Rendering，并为您提供幕后介绍Unity的多人游戏解决方案。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Rendering Customization and Performance in Unity...",
            "author": "Mathieu Muller ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034719/Unity-Developer-Summit-Rendering-Customization",
            "index": 426,
            "overview": "Discover how Unity 6 can boost graphics performance and give you more control over visuals while optimizing your game for all Unity-supported end-user devices. Get a tour of the latest render pipeline optimizations, including GPU-driven rendering as well as Unity Spatial-Temporal Post-Processing (STP), a novel cross-platform upscaler. Finally, you'll learn how to customize your game's graphics rendering at a deeper level using Render Graph, VFX Graph, and latest additions to the Ray Tracing API.",
            "translated": "发现Unity 6如何提高图形性能，并为您提供更多对视觉效果的控制，同时为所有统一支持的最终用户设备优化游戏。参观最新的渲染管道优化，包括GPU驱动的渲染以及Unity时空后处理（STP），这是一种新颖的跨平台上图。最后，您将学习如何使用渲染图，VFX图和射线跟踪API的最新添加来定制游戏的图形渲染。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: The Great Data Bake-Off: Improving Performance w...",
            "author": "Ashley Alicea ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034717/Unity-Developer-Summit-The-Great",
            "index": 427,
            "overview": "Attend this session to see how you can maximize your game's performance using specialized features of Unity's Data-Oriented Tech Stack (DOTS). This includes baking a crucial process that converts scene data into entities and components. You also learn how to benefit from configurable components, custom allocators, and other features that help with performance optimization, more efficient memory utilization, and effective debugging.",
            "translated": "参加本次会议，以了解如何使用Unity面向数据的技术堆栈（DOTS）的专业功能来最大化游戏的性能。这包括烘烤关键过程，将场景数据转换为实体和组件。您还将学习如何从可配置的组件，自定义分配器和其他有助于性能优化，更有效的内存利用和有效调试的功能中受益。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Unity 6 and Beyond: A Roadmap of Unity Engine an...",
            "author": "Andrew Bowell ",
            "organization": "Unity Technologies",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034706/Unity-Developer-Summit-Unity-6",
            "index": 428,
            "overview": "This is the can't-miss session of GDC 2024. Join Unity to discover the latest developments in the Unity Engine and how they're supported through additional tools and services to maximize your creative freedom and efficiency, while enabling you to produce gorgeous, immersive games that will wow players over and over. nnIn just an hour, we show you how to achieve fantastic graphics fidelity and flexibility through rendering pipelines, shader/VFX Graph, and AI tools like Muse. In addition, with new tools like Multiplayer Center and Multiplayer Playmode, you get a head start on streamlining your multiplayer development. And of course we haven't forgotten that a lot of you work in teams, so learn about some great collaboration tools such as Unity Cloud (with Azure) and Muse project-aware chat. Finally, we know it's all about platform reach so we have you covered there, too. ",
            "translated": "这是GDC 2024的不可错过的会议。加入Unity，发现Unity引擎中的最新发展以及如何通过其他工具和服务来支持它们，以最大程度地提高您的创作自由和效率，同时使您能够产生华丽的，沉浸式游戏会一遍又一遍地让人惊叹。Nnin仅一个小时，我们向您展示了如何通过渲染管道，着色器/VFX图和Muse等AI工具来实现出色的图形保真度和灵活性。此外，借助多人游戏中心和多人游戏游戏的新工具，您可以从简化多人游戏开发方面获得一项启发。当然，我们还没有忘记很多人在团队中工作，因此请了解一些出色的协作工具，例如Unity Cloud（带有Azure）和Muse Project-Project Anawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawawaw and。最后，我们知道这一切都与平台到达有关，因此我们也为您提供了覆盖。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Upgrading the Snowdrop Engine for the Massive World of 'Avatar: Frontier...",
            "author": "Joshua Simmons ",
            "organization": "Massive Entertainment - A Ubisoft Studio",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034412/Upgrading-the-Snowdrop-Engine-for",
            "index": 436,
            "overview": "Avatar: Frontiers of Pandora is Massive Entertainment's largest and most complex world to date. This session describes the changes made to the Snowdrop engine to support a huge world densely filled with procedurally generated objects, as well as the optimizations necessary to support online co-op server hosting and local servers for offline play.",
            "translated": "阿凡达（Avatar）：潘多拉（Pandora）的边界是迄今为止巨大的娱乐世界，迄今为止最大，最复杂的世界。本届会议描述了对Snowdrop Engine的更改，以支持一个庞大的世界，这些世界密集填充了程序生成的对象，以及支持在线合作服务器托管和本地服务器以进行离线游戏所需的优化。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Verse Update (Presented by Epic Games)",
            "author": "Phil Pizlo ",
            "organization": "Epic Games",
            "trackname": "Programming",
            "url": "https://gdcvault.com/free/gdc-24/play/1034657/Verse-Update-(Presented-by-Epic",
            "index": 441,
            "overview": "A look at the latest Verse features and what's coming soon to the language and framework.",
            "translated": "看看最新的经文功能以及即将到来的语言和框架。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: Adobe Substance 3D Keynote (Presented by Adobe)",
            "author": "Jrmie Noguer ",
            "organization": "Adobe",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034739/Adobe-Developer-Summit-Adobe-Substance",
            "index": 23,
            "overview": "Learn the latest developments and announcements taking place in the Adobe Substance 3D ecosystem. Discover how the Substance 3D team continues to improve workflows and support artists to create stunning content. The team will share the latest product updates and initiatives, and much more.",
            "translated": "了解在Adobe物质3D生态系统中进行的最新发展和公告。发现“物质3D团队”如何继续改善工作流程并支持艺术家创建令人惊叹的内容。该团队将分享最新产品的更新和计划，等等。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: Prince of Persia: The Lost Crown - A Versatile A...",
            "author": "Jean-Baptiste Rollin ",
            "organization": "Ubisoft",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034745/Adobe-Developer-Summit-Prince-of",
            "index": 24,
            "overview": "Ubisofts Lead Environment Artist Jean-Baptiste Rollin and Senior 3D Artist Loic Anquetil will share the philosophy and the different techniques and tools that helped bring the game's environments to life. They will discuss how an indie approach and a craftsman's mindset made it possible to meet the challenges specific to the Metroidvania genre, with a small team, in a short production time frame, without compromising on artistic direction or performance. They will dive into the process of creating stylized textures in Substance 3D Designer, as well as the various pipelines put in place to facilitate asset creation.",
            "translated": "Ubisofts领导环境艺术家让·巴蒂斯特·罗林（Jean-Baptiste Rollin）和高级3D艺术家洛克·安奎蒂（Loic Anquetil）将分享哲学以及不同的技术和工具，这些技术和工具有助于使游戏的环境栩栩如生。他们将讨论独立的方法和工匠的心态如何使得面向银业车类型所面临的挑战，而一支小型团队则在短期的生产时间内，而不会损害艺术方向或表现。他们将深入研究物质3D设计器中创建风格化纹理的过程，以及为促进资产创造的各种管道而进行的。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: Prince of Persia: The Lost Crown - A Versatile A...",
            "author": "Jean-Baptiste Rollin ",
            "organization": "Ubisoft",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034909/Adobe-Developer-Summit-Prince-of",
            "index": 25,
            "overview": "Ubisofts Lead Environment Artist Jean-Baptiste Rollin and Senior 3D Artist Loic Anquetil will share the philosophy and the different techniques and tools that helped bring the game's environments to life. They will discuss how an indie approach and a craftsman's mindset made it possible to meet the challenges specific to the Metroidvania genre, with a small team, in a short production time frame, without compromising on artistic direction or performance. They will dive into the process of creating stylized textures in Substance 3D Designer, as well as the various pipelines put in place to facilitate asset creation.",
            "translated": "Ubisofts领导环境艺术家让·巴蒂斯特·罗林（Jean-Baptiste Rollin）和高级3D艺术家洛克·安奎蒂（Loic Anquetil）将分享哲学以及不同的技术和工具，这些技术和工具有助于使游戏的环境栩栩如生。他们将讨论独立的方法和工匠的心态如何使得面向银业车类型所面临的挑战，而一支小型团队则在短期的生产时间内，而不会损害艺术方向或表现。他们将深入研究物质3D设计器中创建风格化纹理的过程，以及为促进资产创造的各种管道而进行的。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: The Art and Technology Behind Creating Character...",
            "author": "Alena Dubrovina ",
            "organization": "Larian Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034742/Adobe-Developer-Summit-The-Art",
            "index": 26,
            "overview": "The introduction of in-game cinematics was a game-changer for the character art team on Baldur's Gate 3, as this meant characters needed to look good not only from the perspective of top-down combat cameras but also for extreme close-ups in cinematics. In this talk we'll dive into some of the tools and processes that helped the Larian Studios team create high-quality characters, and allowed them to build up a customization system for players and NPCs to populate the vast world of Baldur's Gate. Alena will demonstrate a breakdown of a character, discuss ways to speed up production, and highlight how much can be achieved with simple texture customization techniques.",
            "translated": "游戏中电影的引入是Baldur's Gate 3上角色艺术团队的游戏规则改变者，因为这意味着角色不仅需要从自上而下的战斗摄像头的角度看待好，而且还需要进行电影电影的极端特写。。在这次演讲中，我们将深入研究一些工具和过程，这些工具和过程帮助Larian Studios团队创建了高质量的角色，并允许他们建立一个为玩家和NPC的定制系统，以填充Baldur大门的广阔世界。Alena将展示角色的细分，讨论加快生产的方法，并突出使用简单的纹理自定义技术可以实现多少。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: The Environment Art Technology and Workflows of ...",
            "author": "Miro Vesterinen ",
            "organization": "Remedy Entertainment",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034741/Adobe-Developer-Summit-The-Environment",
            "index": 27,
            "overview": "The presentation will give a brief high-level overview of the narrative-driven AAA game development company, Remedy Entertainment, and an in-depth look into the environment art workflows developed for Alan Wake 2. The talk will demonstrate prior conventions related to asset creation and texturing at the company and how these were improved during development. A deeper dive into physically based rendering (PBR) practices and pitfalls, Substance texturing processes and the in-engine (Northlight) developed landscape and material workflows will be provided as well as a glimpse into future tech development plans.",
            "translated": "演讲将简要介绍叙事驱动的AAA游戏开发公司，补救娱乐公司，并深入了解Alan Wake 2开发的环境艺术工作流程。演讲将展示与资产创建相关的先前惯例并在公司的纹理以及在开发过程中如何改善。将提供更深入地研究基于物理的渲染（PBR）实践和陷阱，物质纹理过程以及内引擎（Northlight）开发的景观和材料工作流程，并瞥见未来的技术开发计划。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Adobe Developer Summit: Tips & Tricks in Adobe Substance 3D Painter to M...",
            "author": "Anna Beganskaya ",
            "organization": "Dardo Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034740/Adobe-Developer-Summit-Tips-Tricks",
            "index": 28,
            "overview": "3D Character Artist Anna Beganskaya will present the creation of textures for her \"Cyperpunk Girl\" project, which was fully textured in Substance 3D Painter. She will demonstrate how to combine procedural and hand-painted techniques to make semi-realistic textures which can be rendered further in Arnold. Anna will show that making good textures is easier than it often seems, as well as sharing her own tips and tricks.",
            "translated": "3D角色艺术家Anna Beganskaya将为她的“ Cyperpunk Girl”项目展示纹理的创造，该项目在Sports 3D Painter中充分纹理。她将演示如何结合程序和手绘技术以制造半现实的纹理，这些纹理可以在阿诺德（Arnold）进一步呈现。安娜将表明，制作良好的纹理比看上去经常更容易，还可以分享自己的技巧和技巧。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Autodesk Developer Summit: 'FINAL FANTASY XVI': Wrangling Complexity to ...",
            "author": "Eitaro Iwabuchi ",
            "organization": "SQUARE ENIX CO., LTD.",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034705/Autodesk-Developer-Summit-FINAL-FANTASY",
            "index": 64,
            "overview": "Uncover SQUARE ENIX's strategies for reducing workload and complexity without compromising the quality of FINAL FANTASY XVI. This session explores how the studio seamlessly integrated Autodesk and in-house tools, allowing data to flow between the two for environment layout, animation and more, enabling them to create extraordinary realms and characters that have captivated a loyal audience of over three million players.",
            "translated": "揭示了Square Enix减少工作量和复杂性的策略，而不会损害最终幻想XVI的质量。本届会议探讨了工作室如何无缝集成的Autodesk和内部工具，从而使数据可以在两者之间进行环境布局，动画等之间流动，从而使他们能够创建非凡的领域和角色，这些领域和角色吸引了超过300万玩家的忠实观众。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Autodesk Developer Summit: Harnessing the Power of Accelerated Volumetri...",
            "author": "Paul Van der Meer ",
            "organization": "Vertigo Games",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034703/Autodesk-Developer-Summit-Harnessing-the",
            "index": 65,
            "overview": "Three decades after its initial release, The 7thGuest was resurrected in VR and hailed for delivering \"the best human performance ever seen\" - (The Gamer). Their secret? Accelerated Volumetric Video (AVV). In this session, discover how Arcturus' AVV Codec, Autodesk Maya and MotionBuilder helped Vertigo Games achieve massive performance gains and push the boundaries of visual quality.",
            "translated": "首次发行后的三十年，这位第七Guest在VR中复活了，并因提供“有史以来最好的人类表演”而受到赞誉 - （游戏玩家）。他们的秘密？加速体积视频（AVV）。在本届会议中，发现Arcturus的AVV编解码器，Autodesk Maya和Motionbuilder如何帮助Vertigo Games获得巨大的性能增长并突破视觉质量的界限。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Autodesk Developer Summit: Maximize Efficiency and Creativity with AI fo...",
            "author": "Avi Latner ",
            "organization": "Sloyd",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034704/Autodesk-Developer-Summit-Maximize-Efficiency",
            "index": 66,
            "overview": "Creating game assets is a complex, multi-stage process that requires specialized tools and the expertise of many talented creatives. While game art will always result from artistic vision and skill, integrating AI into the process can enhance it, automating and accelerating game art production. In this session, Sloyd will delve into exciting advancements in 3D AI, how it seamlessly integrates into game art production, and how their technology tackles three crucial challenges: maintaining topology quality, optimizing for speed, and addressing copyright concerns.",
            "translated": "创建游戏资产是一个复杂的多阶段过程，需要专门的工具和许多才华横溢的创意者的专业知识。尽管游戏艺术总是由艺术愿景和技巧造成的，但将AI集成到过程中可以增强它，自动化和加速游戏艺术生产。在本届会议上，Sloyd将深入研究3D AI的令人兴奋的进步，如何将其无缝集成到游戏艺术制作中，以及他们的技术如何应对三个至关重要的挑战：保持拓扑质量，优化速度和解决版权问题。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Building a User and Developer Friendly Cross-DCC Animation Pipeline",
            "author": "Fleming Lin ",
            "organization": "LIGHTSPEED STUDIOS",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034312/Building-a-User-and-Developer",
            "index": 73,
            "overview": "This session provides insights into the technical artist team's development of a lightweight, highly reusable and artist-and-developer-friendly Cross-DCC animation pipeline. Fleming Lin from LIGHTSPEED STUDIOS will introduce two key pipeline frameworks: Protostar and NodeZoo. The presentation includes a demonstration of versioning strategies, data-driven rig generation, and the implementation of universal toolkits tailored to diverse projects at LIGHTSPEED STUDIOS.",
            "translated": "本届会议提供了有关技术艺术家团队的开发，可重复使用的，高度可重复使用，艺术家和开发人员友好的交叉DCC动画管道。Lightspeed Studios的Fleming Lin将引入两个关键的管道框架：Protostar和Nodezoo。演示文稿包括版本控制策略，数据驱动的钻机生成以及针对Lightspeed Studios量身定制的通用工具包的实施。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Delta Force World Creation: Cross-Platform Art Pipeline and Tools (Prese...",
            "author": "Lichuan Wang ",
            "organization": "Tencent Games",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034826/Delta-Force-World-Creation-Cross",
            "index": 102,
            "overview": "Delta Force is developing top-tier experiences to gamers for all platforms and its' development team is working across multiple platforms in the short term to achieve it. This session will give a detailed introduction to a set of In-house art pipelines and tools that cover various modules ranging from Digital Content Creation (DCC) to the Engine including art assets solutions, OpenWorld infrastructure/Biome integrations, and more. The team and processes take great consideration to achieve the high fidelity and design density required to hit the high-end graphics PC gamers crave while accounting for maintaining a high level of performance on mobile devices.",
            "translated": "Delta Force正在为所有平台的游戏玩家开发顶级体验，其开发团队在短期内跨多个平台工作以实现这一目标。本届会议将详细介绍一组内部的艺术管道和工具，这些管道和工具涵盖了从数字内容创建（DCC）到引擎，包括Art Assets Solutions，OpenWorld Infrastructure/Biome Integrations等各种模块。团队和流程非常考虑到达到高端图形PC游戏玩家所需的高忠诚度和设计密度，同时考虑到在移动设备上保持高度性能。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Delta Force World Creation: Cross-Platform Art Pipeline and Tools (Prese...",
            "author": "Lichuan Wang ",
            "organization": "Tencent Games",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034687/Delta-Force-World-Creation-Cross",
            "index": 103,
            "overview": "Delta Force is developing top-tier experiences to gamers for all platforms and its' development team is working across multiple platforms in the short term to achieve it. This session will give a detailed introduction to a set of In-house art pipelines and tools that cover various modules ranging from Digital Content Creation (DCC) to the Engine including art assets solutions, OpenWorld infrastructure/Biome integrations, and more. The team and processes take great consideration to achieve the high fidelity and design density required to hit the high-end graphics PC gamers crave while accounting for maintaining a high level of performance on mobile devices.",
            "translated": "Delta Force正在为所有平台的游戏玩家开发顶级体验，其开发团队在短期内跨多个平台工作以实现这一目标。本届会议将详细介绍一组内部的艺术管道和工具，这些管道和工具涵盖了从数字内容创建（DCC）到引擎，包括Art Assets Solutions，OpenWorld Infrastructure/Biome Integrations等各种模块。团队和流程非常考虑到达到高端图形PC游戏玩家所需的高忠诚度和设计密度，同时考虑到在移动设备上保持高度性能。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Facing Our Failures: Creating 3D Environments from a 2D Legacy for 'Dark...",
            "author": "Marielle Fox ",
            "organization": "Red Hook Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034303/Facing-Our-Failures-Creating-3D",
            "index": 129,
            "overview": "In this session, Red Hook Studios' Lead Environment Artist, Marielle Fox, will discuss the pillars of Darkest Dungeon 2's environment art creation and how the art team established their unique workflow.nnShe will share the experiences of the team and the challenges they faced while trying to transition the 2D art style of the first Darkest Dungeon game to 3D for the sequel. They will cover various methods that the team experimented with, and how, through a few failures, they managed to develop an elegant solution that fit the project's needs and resources perfectly. nnThis presentation will also discuss various rendering and procedural generation techniques that Red Hook developed and maintained, in order to achieve the look and tone of various 3D worlds in the style of Darkest Dungeon.",
            "translated": "在本次会议上，Red Hook Studios的主要环境艺术家Marielle Fox将讨论最黑暗的Dungeon 2的环境艺术创作的支柱，以及艺术团队如何建立他们独特的工作流程。试图将第一个最黑暗的地牢游戏的2D艺术风格转变为续集的3D。他们将涵盖团队尝试的各种方法，以及如何通过一些失败，设法开发出一种优雅的解决方案，完美地满足了项目的需求和资源。nnththis演示还将讨论红钩开发和维护的各种渲染和程序发电技术，以便以最黑暗的地牢的风格实现各种3D世界的外观和音调。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Larian Cinematics: A Top-Down Look at Our Bottom-Up Approach in 'Baldur'...",
            "author": "Jason Latino ",
            "organization": "Larian Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034814/Larian-Cinematics-A-Top-Down",
            "index": 270,
            "overview": "No plan survives development. Join the cinematic director of Larian Studios, Jason Latino, for an account of how the realities of making a game at the scale and reactivity of Baldur's Gate 3 required constant evolution and reexamination of first principles. Jason will go over the initial vision and track the specific moments that forced changes on tools, team and approach--leading up to the final challenge--bringing in the release date by a month.",
            "translated": "没有计划能够生存开发。加入Larian Studios的电影总监Jason Latino，以说明如何以Baldur的Gate 3的规模和反应性制作游戏的现实需要不断进化并重新检查第一原则。杰森（Jason）将讨论最初的愿景，并跟踪迫使工具，团队和进近的特定时刻 - 达到最终挑战 - 在发行日期缩小一个月。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Larian Cinematics: A Top-Down Look at Our Bottom-Up Approach in 'Baldur'...",
            "author": "Jason Latino ",
            "organization": "Larian Studios",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034616/Larian-Cinematics-A-Top-Down",
            "index": 271,
            "overview": "No plan survives development. Join the cinematic director of Larian Studios, Jason Latino, for an account of how the realities of making a game at the scale and reactivity of Baldur's Gate 3 required constant evolution and reexamination of first principles. Jason will go over the initial vision and track the specific moments that forced changes on tools, team and approach--leading up to the final challenge--bringing in the release date by a month.",
            "translated": "没有计划能够生存开发。加入Larian Studios的电影总监Jason Latino，以说明如何以Baldur的Gate 3的规模和反应性制作游戏的现实需要不断进化并重新检查第一原则。杰森（Jason）将讨论最初的愿景，并跟踪迫使工具，团队和进近的特定时刻 - 达到最终挑战 - 在发行日期缩小一个月。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Proceduralism Made Easy : SideFX Labs and Houdini Engine (Presented by H...",
            "author": "Damien Pernuit ",
            "organization": "SideFX",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034649/Proceduralism-Made-Easy-SideFX-Labs",
            "index": 341,
            "overview": "Houdinis procedural tools have been empowering artists at game and vfx studio with powerful and flexible workflows for years, with SideFX Labs always remaining at the cutting edge of technology needed by Houdini Users.nIn this session, you will discover how Houdini Engine can bring the power of proceduralism straight to your game engine of choice. And, as SideFX Labs is always in continued development, adjusting and adding tools based on industry trends and user needs, you'll discover what's been brewing at SideFX Labs this past year. Take a look inside at our newest tool releases and our developing projects.",
            "translated": "多年来，Houdinis程序工具一直在增强艺术家和VFX工作室的能力，并具有强大而灵活的工作流程，而Sidefx Labs总是留在Houdini用户所需的技术的最前沿。在本届会议上，您将发现Houdini Engine如何带来力量可以直接进入您选择的游戏引擎。而且，由于SideFX实验室始终处于持续开发，根据行业趋势和用户需求进行调整和添加工具，因此您将在过去一年中发现SideFX Labs正在酿造的东西。看看我们的最新工具发布和我们的发展项目。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Realistic Mobile Graphics with Optimized Ray Tracing (Presented by Arm)",
            "author": "Iago Calvo Lista ",
            "organization": "Arm",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034894/Realistic-Mobile-Graphics-with-Optimized",
            "index": 346,
            "overview": "Dive into the future of 3D graphics with Vulkan Ray Tracing! Uncover the transformative potential for mobile applications as hardware Ray Tracing accelerates on smartphones. nnJoin our technical deep-dive for a journey into hybrid rendering, unlocking unparalleled realism and quality in shadows and reflections without compromising performance. nnExplore fine-tuned optimizations and game-changing best practices tailored for mobile hardware, enhancing your Vulkan based project. Seize this ideal moment to elevate your game development with cutting-edge technology, ensuring your creations stand out in the evolving landscape of immersive mobile experiences!",
            "translated": "通过Vulkan Ray Tracing深入研究3D图形的未来！将移动应用程序作为硬件射线追踪的变革潜力在智能手机上加速。nnjo我们的技术深入研究，以进行混合渲染的旅程，在不损害性能的情况下，在阴影和反射中解锁了无与伦比的现实主义和质量。Nnexplore微调的优化和针对移动硬件量身定制的游戏规则的最佳实践，从而增强了基于Vulkan的项目。抓住这个理想的时刻，通过最先进的技术来提升您的游戏开发，以确保您的创作在不断发展的沉浸式移动体验中脱颖而出！"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "SmartGI Evolution: Adaptive NanoMesh on Mobile (Presented by Arm)",
            "author": "Nathan Li ",
            "organization": "Arm",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034895/SmartGI-Evolution-Adaptive-NanoMesh-on",
            "index": 354,
            "overview": "SmartGI, a cutting-edge Vulkan renderer developed by Tencent Games, aims to enable the best possible graphics on all platforms is taking one step further. nnDevelopers now can enjoy the most advanced techniques, such as real-time global illumination, cluster based seamless LOD and textures, alongside a fine-tuned deferred pipeline to render pixel scale detail and high object counts on mobile.",
            "translated": "Smartgi是由Tencent Games开发的尖端Vulkan渲染器，旨在使所有平台上的最佳图形都进一步发展。NNDevelopers现在可以享受最先进的技术，例如实时全球照明，基于群集的无缝LOD和纹理，以及一条微调的延期延迟管道，以渲染像素尺度的细节以及对移动设备的高对象计数。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Steel Arms: Bringing Lumen to Immortalis (Presented by Arm)",
            "author": "Patrick Wang ",
            "organization": "Arm",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034896/Steel-Arms-Bringing-Lumen-to",
            "index": 371,
            "overview": "Immerse yourself in a game-changing session tailored for technical artists. Uncover the secrets of seamlessly integrating Lumen into Arm Immortalis GPUs, showcased through the our \"Steel Arms\" demo. Gain insights into the high-level Lumen lighting pipeline and unlock optimization best practices for ray tracing content at each stage, derived from the immersive journey of crafting Steel Arms. Join us for an inspiring exploration where technical artistry meets cutting-edge GPU innovation, propelling your game development to new heights.",
            "translated": "沉浸在针对技术艺术家量身定制的改变游戏规则的会议中。通过我们的“钢臂”演示展示了无缝将管腔无缝整合到手臂不朽GPU中的秘密。洞悉高级管腔照明管道，并解锁优化在每个阶段的射线追踪内容的最佳实践，这些实践来自制作钢臂的沉浸式旅程。加入我们，进行鼓舞人心的探索，技术艺术性符合尖端的GPU创新，将您的游戏开发推向新的高度。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Dark Place of 'Alan Wake 2': Crafting an Evolving Nightmare Dimension",
            "author": "Nazareno Urbano ",
            "organization": "Remedy Entertainment",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034416/The-Dark-Place-of-Alan",
            "index": 390,
            "overview": "The presentation is a dive into the world-building aspect of The Dark Place of Alan Wake II, we explain how we approach the environment world-building and what tools we use to create an evolving nightmare dimension where the world is shifting, and multiple layers of reality are interconnected in a dream logic structure where the reality is subjective.",
            "translated": "演示文稿深入研究了艾伦·韦克（Alan Wake II）的黑暗之地的世界建设方面，我们解释了我们如何处理环境建设环境以及我们使用哪些工具来创建一个不断发展的噩梦维度，而世界正在变化，以及多层的发展。现实的现实互连在梦想结构中，现实是主观的。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Dark Place of 'Alan Wake 2': Crafting an Evolving Nightmare Dimension",
            "author": "Nazareno Urbano ",
            "organization": "Remedy Entertainment",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034351/The-Dark-Place-of-Alan",
            "index": 391,
            "overview": "The presentation is a dive into the world-building aspect of The Dark Place of Alan Wake II, we explain how we approach the environment world-building and what tools we use to create an evolving nightmare dimension where the world is shifting, and multiple layers of reality are interconnected in a dream logic structure where the reality is subjective.",
            "translated": "演示文稿深入研究了艾伦·韦克（Alan Wake II）的黑暗之地的世界建设方面，我们解释了我们如何处理环境建设环境以及我们使用哪些工具来创建一个不断发展的噩梦维度，而世界正在变化，以及多层的发展。现实的现实互连在梦想结构中，现实是主观的。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "The Dark Place of 'Alan Wake 2': Crafting an Evolving Nightmare Dimension",
            "author": "Nazareno Urbano ",
            "organization": "Remedy Entertainment",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034398/The-Dark-Place-of-Alan",
            "index": 392,
            "overview": "The presentation is a dive into the world-building aspect of The Dark Place of Alan Wake II, we explain how we approach the environment world-building and what tools we use to create an evolving nightmare dimension where the world is shifting, and multiple layers of reality are interconnected in a dream logic structure where the reality is subjective.",
            "translated": "演示文稿深入研究了艾伦·韦克（Alan Wake II）的黑暗之地的世界建设方面，我们解释了我们如何处理环境建设环境以及我们使用哪些工具来创建一个不断发展的噩梦维度，而世界正在变化，以及多层的发展。现实的现实互连在梦想结构中，现实是主观的。"
        },
        {
            "name": " Game Developers Conference 2024 ",
            "title": "Unity Developer Summit: Crafting Beautiful Natural Environments with Uni...",
            "author": "Sarah Scruggs ",
            "organization": "Unity Technologies",
            "trackname": "Visual Arts",
            "url": "https://gdcvault.com/free/gdc-24/play/1034716/Unity-Developer-Summit-Crafting-Beautiful",
            "index": 419,
            "overview": "Have you seen The oasis, our photorealistic URP sample? Go behind the scenes with the experts that crafted it and learn new ways to create eye-catching environments, ranging from vegetation to sky. This session walks you through how the shaders were made, how to create a beautiful sky, and how to build a Sago Palm including procedural structure and leaf canopy clusters.",
            "translated": "您是否看过我们的影像学URP样品绿洲？与精心制作的专家一起走在幕后，学习创造引人注目的环境的新方法，从植被到天空。本次会议将带您了解着着色机的制作方式，如何创造美丽的天空以及如何建造西马棕榈（包括程序结构和叶冠层簇）。"
        }
    ]
}